[
  {
    "Class": "Youngster",
    "Name": "Jim",
    "Sprite": "gen4/Youngster_2_.png",
    "Greeting": "And we’re off!",
    "Win": "We did it, yeah!",
    "Loss": "Uncle!"
  },
  {
    "Class": "Youngster",
    "Name": "Erroll",
    "Sprite": "gen4/Youngster_2_.png",
    "Greeting": "My Pokémon are a cut apart from the usual. Maybe even two cuts!",
    "Win": "Their cutting intensity and solid attack... Top class, yeah?",
    "Loss": "Grr... Rendered harmless..."
  },
  {
    "Class": "Youngster",
    "Name": "Casimir",
    "Sprite": "gen4/Youngster_2_.png",
    "Greeting": "The prince among shorts-wearing Youngsters, that is me!",
    "Win": "I hope I lived up to my title of the prince among the shorts wearers.",
    "Loss": "I can’t lose here! Not as the prince among the wearers of shorts!"
  },
  {
    "Class": "Lass",
    "Name": "Cameron",
    "Sprite": "gen4/Lass_3_.png",
    "Greeting": "I can’t bear this tension. Would they be mad if I went home?",
    "Win": "I did it! I won somehow!",
    "Loss": "That’s gone past my limit! I need to be excused!"
  },
  {
    "Class": "Lass",
    "Name": "Peaches",
    "Sprite": "gen4/Lass_3_.png",
    "Greeting": "I’m not very good at this, but please don’t hold back.",
    "Win": "Oh, didn’t I say? You shouldn’t have held back.",
    "Loss": "Fweh! I wish you would have held back a little bit!"
  },
  {
    "Class": "Lass",
    "Name": "Yasmin",
    "Sprite": "gen4/Lass_3_.png",
    "Greeting": "In romance, fashion, and Pokémon! Today’s girls want it all!",
    "Win": "The greed of today’s girls knows no bounds!",
    "Loss": "Did being greedy end up costing me everything?"
  },
  {
    "Class": "School Kid",
    "Name": "Foster",
    "Sprite": "gen4/School Kid_60_.png",
    "Greeting": "I’m thinking hard about why everyone likes battling so much.",
    "Win": "Why does winning a battle make people happy?",
    "Loss": "Why is losing a battle so downright infuriating?"
  },
  {
    "Class": "School Kid",
    "Name": "Ken",
    "Sprite": "gen4/School Kid_60_.png",
    "Greeting": "I’m trying to keep up with my Pokémon training and my own schooling.",
    "Win": "I’d like to think I’ve struck the right balance of fun and education.",
    "Loss": "This isn’t going to work? My grades are the best in class, but..."
  },
  {
    "Class": "School Kid",
    "Name": "Owen",
    "Sprite": "gen4/School Kid_60_.png",
    "Greeting": "I crammed hard for this. I can’t possibly fail!",
    "Win": "Yes! I get the win! I’m glad I kept with this!",
    "Loss": "It means I need to study at home some more."
  },
  {
    "Class": "School Kid",
    "Name": "Marcy",
    "Sprite": "gen4/School Kid_61_.png",
    "Greeting": "My Pokémon are my treasures. I’ll let you see them. Just you.",
    "Win": "See? Cute and strong! Eheheheh.",
    "Loss": "See? They’re cute even when losing. Eheheheh."
  },
  {
    "Class": "School Kid",
    "Name": "Shelly",
    "Sprite": "gen4/School Kid_61_.png",
    "Greeting": "I won’t lose ever! Please abide by my rule!",
    "Win": "Thank you so much! I owe this win to you!",
    "Loss": "I so did not want to lose..."
  },
  {
    "Class": "School Kid",
    "Name": "Aspen",
    "Sprite": "gen4/School Kid_61_.png",
    "Greeting": "I can do this... I can shine here, too!",
    "Win": "Yes! I won! I’m going to be a star!",
    "Loss": "One day, I’m going to shine as the brightest star in the world!"
  },
  {
    "Class": "Rich Boy",
    "Name": "Matt",
    "Sprite": "gen4/Rich Boy_32_.png",
    "Greeting": "Don’t be shy. You can bring it any which way.",
    "Win": "Yeah, I figured you’d be like this. Heh.",
    "Loss": "W-well, sometimes I have to lose, just so I don’t crush everyone. Ahaha..."
  },
  {
    "Class": "Rich Boy",
    "Name": "Alvan",
    "Sprite": "gen4/Rich Boy_32_.png",
    "Greeting": "My father’s wealthy. There’s nothing he can’t afford.",
    "Win": "My father’s money bought my Pokémon.",
    "Loss": "There are things that money can’t buy. I know that..."
  },
  {
    "Class": "Rich Boy",
    "Name": "Asa",
    "Sprite": "gen4/Rich Boy_32_.png",
    "Greeting": "Well, shall we? Time is money, and the meter is running.",
    "Win": "Well, I’ll take my leave. Yet another fancy dinner date, you know. Adieu!",
    "Loss": "It’s my loss, is it? So be it. I had to leave for a date anyway."
  },
  {
    "Class": "Lady",
    "Name": "Isabel",
    "Sprite": "gen4/Lady_33_.png",
    "Greeting": "Uphold the rules of etiquette and courtesy... That’s what a lady does.",
    "Win": "If I couldn’t unwind this way, I would lose my ladylike composure.",
    "Loss": "I wish I could be free like the bird Pokémon in the skies..."
  },
  {
    "Class": "Lady",
    "Name": "Nichole",
    "Sprite": "gen4/Lady_33_.png",
    "Greeting": "If I were Honey, then you would be Gooey Mulch, I would think.",
    "Win": "Do you see now? How different we are in level and class?",
    "Loss": "How dare you! I won’t forget this humiliation ever!"
  },
  {
    "Class": "Lady",
    "Name": "Juanita",
    "Sprite": "gen4/Lady_33_.png",
    "Greeting": "Partying, shopping, dining... Darling, I’ve grown bored of it all.",
    "Win": "Excitement is so lacking in my life. What will send my heart racing?",
    "Loss": "Only battling lifts me from this idle existence of boredom and apathy..."
  },
  {
    "Class": "Camper",
    "Name": "Bernard",
    "Sprite": "gen4/Camper_4_.png",
    "Greeting": "I’m glad to make your acquaintance! May this friendship be fruitful!",
    "Win": "Thank you very much! Thank you so very much!",
    "Loss": "Thank you very much... ...Pah."
  },
  {
    "Class": "Camper",
    "Name": "Herbert",
    "Sprite": "gen4/Camper_4_.png",
    "Greeting": "The most natural Trainer is... Oh, why hide it? None other than me!",
    "Win": "This is the natural outcome. It was inevitable!",
    "Loss": "I was battling naturally, and ended up with the loss."
  },
  {
    "Class": "Camper",
    "Name": "Colbert",
    "Sprite": "gen4/Camper_4_.png",
    "Greeting": "Yes! Not a grown-up! Lucky me! I stand a chance!",
    "Win": "Yup, battling another kid is a lot less scary.",
    "Loss": "I get really nervous in front of grown-ups."
  },
  {
    "Class": "Picnicker",
    "Name": "Maggy",
    "Sprite": "gen4/Picnicker_5_.png",
    "Greeting": "It’s hard to keep the streak alive, but the battles are fun.",
    "Win": "It’s more fun to win, of course!",
    "Loss": "Even losing is fun. It’s the wonder of Pokémon!"
  },
  {
    "Class": "Picnicker",
    "Name": "Melanie",
    "Sprite": "gen4/Picnicker_5_.png",
    "Greeting": "My daddy is a real mountain man. Does that make my mom a mountain woman?",
    "Win": "Mountain woman sounds icky. Not for me, thank you!",
    "Loss": "I’m their daughter. Is being a mountain woman my destiny?"
  },
  {
    "Class": "Picnicker",
    "Name": "Ann",
    "Sprite": "gen4/Picnicker_5_.png",
    "Greeting": "I have a packed lunch all ready, and of course I have some snacks.",
    "Win": "My favorite Pokémon make winning so easy!",
    "Loss": "Oh, no, no! I forgot to bring my favorite Pokémon!"
  },
  {
    "Class": "Tuber",
    "Name": "Manford",
    "Sprite": "gen4/Tuber_44_.png",
    "Greeting": "I frolic with my water Pokémon in a pool all the time.",
    "Win": "It sure makes me happy winning with my Pokémon favorites.",
    "Loss": "I’d love to swim in a pool full of water Pokémon."
  },
  {
    "Class": "Tuber",
    "Name": "Hank",
    "Sprite": "gen4/Tuber_44_.png",
    "Greeting": "I promised Mommy I’ll practice swimming if I lose.",
    "Win": "Yay! I won’t have to go to the pool with Mommy today!",
    "Loss": "Aww, I lost. Now I’ll have to go to swimming practice today."
  },
  {
    "Class": "Tuber",
    "Name": "Percy",
    "Sprite": "gen4/Tuber_44_.png",
    "Greeting": "I went and caught my Pokémon with my daddy.",
    "Win": "I won, Daddy! Daddy, thank you!",
    "Loss": "I wonder if Daddy will show me how to train my Pokémon next?"
  },
  {
    "Class": "Tuber",
    "Name": "Dakota",
    "Sprite": "gen4/Tuber_45_.png",
    "Greeting": "I’m on the way home from the pool, but OK, I can battle.",
    "Win": "I hope I can go home soon. I need some dry clothes!",
    "Loss": "Ah-ah-atchoo! Aww... Atchoo! We lost..."
  },
  {
    "Class": "Tuber",
    "Name": "Jenny",
    "Sprite": "gen4/Tuber_45_.png",
    "Greeting": "I’m the captain of a heroic vessel among the crashing waves of a storm!",
    "Win": "Made it to shore with the ease of a real swashbuckler!",
    "Loss": "That was a bigger crash than I wanted!"
  },
  {
    "Class": "Tuber",
    "Name": "Tia",
    "Sprite": "gen4/Tuber_45_.png",
    "Greeting": "I just now got back from my vacation.",
    "Win": "The beach is a good place to show off.",
    "Loss": "Ooh, my sunburn is itching."
  },
  {
    "Class": "Guitarist",
    "Name": "Malcolm",
    "Sprite": "gen4/Guitarist_52_.png",
    "Greeting": "Hunh? A battle, is that it? Sure thing, sure thing.",
    "Win": "Hey, you’re something special, huh?",
    "Loss": "Yeah, thanks for your time."
  },
  {
    "Class": "Guitarist",
    "Name": "Tad",
    "Sprite": "gen4/Guitarist_52_.png",
    "Greeting": "This is going out to all the ladies. Babes, I sing and battle for you!",
    "Win": "My ladies, my babes, I won for you. Your love is my power, right?",
    "Loss": "I lost, but my love for the babes can’t be beat...maybe."
  },
  {
    "Class": "Guitarist",
    "Name": "Concord",
    "Sprite": "gen4/Guitarist_52_.png",
    "Greeting": "This is no guitar I have here. It’s traditional and Japanese.",
    "Win": "It has only three strings. Can you tell what this is?",
    "Loss": "My instrument is called a shamisen."
  },
  {
    "Class": "Idol",
    "Name": "Penny",
    "Sprite": "gen4/Idol_85_.png",
    "Greeting": "We teen Idols have a secret code of conduct that’s strictly enforced.",
    "Win": "For example, if an Idol wins, she has to squeal and jump around.",
    "Loss": "If an Idol loses, she must never act angry. That’s a big no-no."
  },
  {
    "Class": "Idol",
    "Name": "Lana",
    "Sprite": "gen4/Idol_85_.png",
    "Greeting": "Do the monster Meteor Mash! It’s my catchphrase!",
    "Win": "My Meteor Mash goes to your heart!",
    "Loss": "All Idols need a catchphrase, especially right after their debut."
  },
  {
    "Class": "Idol",
    "Name": "Crimson",
    "Sprite": "gen4/Idol_85_.png",
    "Greeting": "You’re ever so lucky to get the chance to battle with me.",
    "Win": "You’re super lucky to even battle an Idol like me. Don’t you get it?",
    "Loss": "Huh? Huh? Now, why did you win? You know I’m supposed to win!"
  },
  {
    "Class": "Pokéfan",
    "Name": "Ewan",
    "Sprite": "gen4/Pokéfan_21_.png",
    "Greeting": "Krink... Krak... Heheheh. Let me limber up for this.",
    "Win": "Hah! Weak, even for a joke!",
    "Loss": "Gnnrrr... I have only myself to blame..."
  },
  {
    "Class": "Pokéfan",
    "Name": "Kane",
    "Sprite": "gen4/Pokéfan_21_.png",
    "Greeting": "Aren’t they pretty? Adorable? They’re my beloved Pokémon.",
    "Win": "You worked so hard! I’ll give you a nice massage at home.",
    "Loss": "What are you doing to my Pokémon?! What if you hurt them?!"
  },
  {
    "Class": "Pokéfan",
    "Name": "Theo",
    "Sprite": "gen4/Pokéfan_21_.png",
    "Greeting": "I come before you as a member of the Pokémon Fan Club! En garde!",
    "Win": "Long live the Pokémon Fan Club! May it always be glorious!",
    "Loss": "This is hardly a taste of what the Pokémon Fan Club can bring down..."
  },
  {
    "Class": "Pokéfan",
    "Name": "Alexia",
    "Sprite": "gen4/Pokéfan_20_.png",
    "Greeting": "Fan Club Department Manager... I hereby accept your challenge.",
    "Win": "Heheh... Honestly, you thought you stood a chance against the Fan Club?",
    "Loss": "Gwah! I will be avenged... B-by the Division Manager..."
  },
  {
    "Class": "Pokéfan",
    "Name": "Luna",
    "Sprite": "gen4/Pokéfan_20_.png",
    "Greeting": "Raising Pokémon with love isn’t the same as coddling them. Don’t you see?",
    "Win": "Ooh, you did it! Oh, I love you so! My luvly, wuvly Pokémon!",
    "Loss": "How could you?! What if my Pokémon are injured?!"
  },
  {
    "Class": "Pokéfan",
    "Name": "Celene",
    "Sprite": "gen4/Pokéfan_20_.png",
    "Greeting": "On behalf of my village, I take on this challenge!",
    "Win": "Thank you, everyone! Thank you for your vocal support!",
    "Loss": "Fellow villagers, I’m sorry! My best wasn’t enough!"
  },
  {
    "Class": "Waiter",
    "Name": "Cyan",
    "Sprite": "gen4/Waiter_81_.png",
    "Greeting": "Thank you for your patience. Here is the battle you’d ordered.",
    "Win": "I trust you were satisfied? I feel shortchanged somewhat.",
    "Loss": "I trust you were satisfied? I’ve had my fill."
  },
  {
    "Class": "Waiter",
    "Name": "Indigo",
    "Sprite": "gen4/Waiter_81_.png",
    "Greeting": "Work is fun, and Pokémon also. I am happy I come to this country.",
    "Win": "Having fun I am! I hoping to live here forever.",
    "Loss": "Oh, why you beat me? So mean! I want go home to my country."
  },
  {
    "Class": "Waiter",
    "Name": "Orin",
    "Sprite": "gen4/Waiter_81_.png",
    "Greeting": "I’m cool, right? So, everywhere I work, they make me the maitre d’...",
    "Win": "I’m a good battler, too. I can’t help it that the ladies fall for me.",
    "Loss": "I dream of evolving from a maitre d’ to a celebrity chef."
  },
  {
    "Class": "Waitress",
    "Name": "Ashley",
    "Sprite": "gen4/Waitress_26_.png",
    "Greeting": "There are no free deals on a battle. You’ll get the full course, though.",
    "Win": "Where’s the fun if you don’t battle like you mean it?",
    "Loss": "I take work and play seriously. That’s what sparks my passion!"
  },
  {
    "Class": "Waitress",
    "Name": "Noelle",
    "Sprite": "gen4/Waitress_26_.png",
    "Greeting": "Hi, may I interest you in a meal combo? ...I’m so used to saying that at work!",
    "Win": "Thank you, and have a great day! ...What am I saying?",
    "Loss": "We look forward to your next visit! ...What am I thinking?"
  },
  {
    "Class": "Waitress",
    "Name": "Kandace",
    "Sprite": "gen4/Waitress_26_.png",
    "Greeting": "Your team looks impressive. Will I be OK...?",
    "Win": "Oh, what? Are those Pokémon only for Contests?",
    "Loss": "Ouch! I said ouch! It was too much! Way, way too much!"
  },
  {
    "Class": "Bug Catcher",
    "Name": "Floyd",
    "Sprite": "gen4/Bug Catcher_6_.png",
    "Greeting": "I love bug Pokémon! I love my bug net even more!",
    "Win": "I caught my Pokémon using my trusty bug net.",
    "Loss": "It’d be cool if there was a bug net Pokémon."
  },
  {
    "Class": "Bug Catcher",
    "Name": "Hoffman",
    "Sprite": "gen4/Bug Catcher_6_.png",
    "Greeting": "The bugs are my minions, and I’m the boss. Are you prepared to lose?",
    "Win": "Wahaha! Well done, my minions!",
    "Loss": "We were mowed down... My minions have learned the hard way!"
  },
  {
    "Class": "Bug Catcher",
    "Name": "Amadeus",
    "Sprite": "gen4/Bug Catcher_6_.png",
    "Greeting": "I’m breaking out of my shell! I’m taking it to the next level!",
    "Win": "It’s like I’ve sprouted wings! Viva to the new me!",
    "Loss": "Is it not my time yet? Do I need to stay in my shell longer?"
  },
  {
    "Class": "Ninja Boy",
    "Name": "Shia",
    "Sprite": "gen4/Ninja Boy_28_.png",
    "Greeting": "You transgressor! Hold still, I say!",
    "Win": "I willed myself to victory!",
    "Loss": "C-curses... I’ve brought dishonor on us..."
  },
  {
    "Class": "Ninja Boy",
    "Name": "Vincent",
    "Sprite": "gen4/Ninja Boy_28_.png",
    "Greeting": "Hey, hey, what’s that over there? It’s... It’s a legendary Pokémon!",
    "Win": "Kekeke... Ninjutsu misdirection! It worked to perfection!",
    "Loss": "Ninjutsu misdirection was a failure! I’ll disappear in a puff of smoke!"
  },
  {
    "Class": "Ninja Boy",
    "Name": "Pierre",
    "Sprite": "gen4/Ninja Boy_28_.png",
    "Greeting": "You’ll be befuddled by my dazzling speed!",
    "Win": "Your movements... It’s as if you’re moving in molasses.",
    "Loss": "I didn’t need to do all that dashing around, did I?"
  },
  {
    "Class": "Poké Kid",
    "Name": "Alice",
    "Sprite": "gen4/Poké Kid_22_.png",
    "Greeting": "I’ve been wearing these clothes for a long time. Bathing is for the birds!",
    "Win": "Changing clothes takes too much effort. Taking a bath is even worse!",
    "Loss": "No, no, no! I won’t take a bath!"
  },
  {
    "Class": "Poké Kid",
    "Name": "Anita",
    "Sprite": "gen4/Poké Kid_22_.png",
    "Greeting": "I like my mommy, PIKACHU, and my daddy, too.",
    "Win": "A weak Trainer isn’t cool. I don’t like you.",
    "Loss": "A not-wimpy Trainer is cool. I like you."
  },
  {
    "Class": "Poké Kid",
    "Name": "Allison",
    "Sprite": "gen4/Poké Kid_22_.png",
    "Greeting": "Pikapika pikaah! Pikka! Pikachuuuh!",
    "Win": "Piika pikapikka! Pikka pikkachuuh!",
    "Loss": "Pikka ppi pi piii..."
  },
  {
    "Class": "Fisherman",
    "Name": "Kiefer",
    "Sprite": "gen4/Fisherman_11_.png",
    "Greeting": "When I enter battle, I picture the vast sea in my mind.",
    "Win": "When I can envision the sea, I feel as if I could never lose.",
    "Loss": "When I envision the sea, I don’t feel the sting of defeat."
  },
  {
    "Class": "Fisherman",
    "Name": "Basil",
    "Sprite": "gen4/Fisherman_11_.png",
    "Greeting": "In battle and in love, one needs to know when it is best to back off.",
    "Win": "After all, both battle and romance can become quagmires of despair.",
    "Loss": "I may have lost, but I said something deep, in an endless bog kind of way."
  },
  {
    "Class": "Ruin Maniac",
    "Name": "Henrik",
    "Sprite": "gen4/Ruin Maniac_48_.png",
    "Greeting": "I’m afraid I got cursed on our last exploration of ancient ruins. Ehehe.",
    "Win": "Even just now, I have no idea how I won. Heeheehee.",
    "Loss": "I may be cursed, but this is fun. It is all so very good. Heeheehee."
  },
  {
    "Class": "Ruin Maniac",
    "Name": "Aubry",
    "Sprite": "gen4/Ruin Maniac_48_.png",
    "Greeting": "Seeing buildings and towns from the old ages sends my pulse racing.",
    "Win": "People interested in old architecture are potential Ruin Maniacs.",
    "Loss": "Open your eyes in towns. There will be exciting new discoveries. I mean it."
  },
  {
    "Class": "Collector",
    "Name": "Upton",
    "Sprite": "gen4/Collector_37_.png",
    "Greeting": "I put this team together with my Internet buddies. It took us all day!",
    "Win": "We won! I need to thank my Internet buddies for their advice!",
    "Loss": "Aww, darn it! We lost?! I’ll report it to my Internet buddies!"
  },
  {
    "Class": "Collector",
    "Name": "Emil",
    "Sprite": "gen4/Collector_37_.png",
    "Greeting": "I’m the main character of this story. It’s impossible for me to lose.",
    "Win": "You’re good! Though, as a supporting character, you’re a bit too strong.",
    "Loss": "...The hero has to suffer a bit so the audience feels more empathy."
  },
  {
    "Class": "Parasol Lady",
    "Name": "Bridget",
    "Sprite": "gen4/Parasol Lady_80_.png",
    "Greeting": "I’m very fickle. I can’t stick with any one thing for very long.",
    "Win": "I won, and it’s enough for me. I’m going to check out the Wi-Fi Plaza.",
    "Loss": "I lost, so that’s enough. I’ll go to the Safari Zone."
  },
  {
    "Class": "Parasol Lady",
    "Name": "Blanche",
    "Sprite": "gen4/Parasol Lady_80_.png",
    "Greeting": "I have a ton more experience than you. What will you do about it?",
    "Win": "Not bad, but you need more maturing.",
    "Loss": "Experience alone doesn’t ensure any wins, I’m learning."
  },
  {
    "Class": "Parasol Lady",
    "Name": "Colette",
    "Sprite": "gen4/Parasol Lady_80_.png",
    "Greeting": "Don’t you think Pokémon battles are a lot like the weather?",
    "Win": "Winning makes me feel warm and cheerful like a sunny day.",
    "Loss": "Losing makes me sad like a dreary, cloudy day."
  },
  {
    "Class": "Beauty",
    "Name": "Tiffany",
    "Sprite": "gen4/Beauty_36_.png",
    "Greeting": "I was out all night at a party again. I’m feeling dizzy from playing games!",
    "Win": "I’m so bored of fancy parties and silly games, too.",
    "Loss": "Urp...!"
  },
  {
    "Class": "Beauty",
    "Name": "Britney",
    "Sprite": "gen4/Beauty_36_.png",
    "Greeting": "Ooh, aren’t you the most darling thing! Can you win a smile from me?",
    "Win": "Ooh, sweetie, I win, so no smile! Be sure to win next time!",
    "Loss": "I don’t feel like smiling now...but I’ll be happy to wave good-bye!"
  },
  {
    "Class": "Beauty",
    "Name": "Harmony",
    "Sprite": "gen4/Beauty_36_.png",
    "Greeting": "...Oh, wait one second. I have to take this call.",
    "Win": "Hi, yup... Yeah, battling... Uh-huh... Yup, I won... Well, duh... LOL...",
    "Loss": "Hi, yup... Yes, just battled... Nope... Kid beat me... Uh-huh..."
  },
  {
    "Class": "Aroma Lady",
    "Name": "Lucy",
    "Sprite": "gen4/Aroma Lady_7_.png",
    "Greeting": "Snivel! Hnurrff! Snort! This hay fever is a wicked misery...",
    "Win": "Hnurrff! Snivel! Snivel! Snivel! I won, but the misery continues!",
    "Loss": "Sniffle. Snivel. Snort. I’m not crying. My nose is running."
  },
  {
    "Class": "Aroma Lady",
    "Name": "Jackie",
    "Sprite": "gen4/Aroma Lady_7_.png",
    "Greeting": "My acute sense of smell tells me how tough a Trainer is.",
    "Win": "Keep trying. My nose tells me you have great potential.",
    "Loss": "Sniff, sniff... Snort! My nose tells me you’ve been working hard!"
  },
  {
    "Class": "Aroma Lady",
    "Name": "Kara",
    "Sprite": "gen4/Aroma Lady_7_.png",
    "Greeting": "Kyahaha! I smell a powerful battle in the making!",
    "Win": "The sweet smell of success!",
    "Loss": "Defeat smells like a SKUNTANK!"
  },
  {
    "Class": "Guitarist",
    "Name": "Bernie",
    "Sprite": "gen4/Guitarist_52_.png",
    "Greeting": "I like hard, fast beats in my battling and my rock ’n’ roll! Let’s wail!",
    "Win": "And, bam! That rhythm pattern ruled, if I may say so myself!",
    "Loss": "Ouch! That’s an insult to the ears! Those beats were offensive, man!"
  },
  {
    "Class": "Guitarist",
    "Name": "Curtis",
    "Sprite": "gen4/Guitarist_52_.png",
    "Greeting": "To show you how much this means to me, I’ll use sound effects from now on.",
    "Win": "Raaaah! Dun dun! Dun dun! Oompa-oompa-oompapa!",
    "Loss": "Blip-bip, blip-bip... Blip... Bweeee..."
  },
  {
    "Class": "Bird Keeper",
    "Name": "Nancy",
    "Sprite": "gen4/Bird Keeper_69_.png",
    "Greeting": "Wait, please wait... The winds... I hear them...",
    "Win": "I can hear them... The winds are laughing...",
    "Loss": "I can hear them... The winds... They are in tears..."
  },
  {
    "Class": "Bird Keeper",
    "Name": "Trinity",
    "Sprite": "gen4/Bird Keeper_69_.png",
    "Greeting": "I can’t fly... But these babies can soar...",
    "Win": "My spirit has been uplifted to the skies... Thank you, everyone...",
    "Loss": "You broke my wings... I won’t ever forget you..."
  },
  {
    "Class": "Bird Keeper",
    "Name": "Shawna",
    "Sprite": "gen4/Bird Keeper_69_.png",
    "Greeting": "Every day, I’m like a migratory bird, but I go in all cardinal directions.",
    "Win": "I gained experience while traveling to all sorts of places.",
    "Loss": "I’d love to live somewhere where I can find other Trainers like you."
  },
  {
    "Class": "Sailor",
    "Name": "Layton",
    "Sprite": "gen4/Sailor_46_.png",
    "Greeting": "I was born unto rolling waves that washed me, with the beach, my cradle.",
    "Win": "I was born and grew up on the seas. That’s what made me the big man I am.",
    "Loss": "I lost, did I? Time to go to the sea and stare inscrutably at it."
  },
  {
    "Class": "Sailor",
    "Name": "Godwin",
    "Sprite": "gen4/Sailor_46_.png",
    "Greeting": "Youths of today aim for the world! How’s that for deep!",
    "Win": "There’d be some mighty cool Trainers around the world. I’m sure of that.",
    "Loss": "Go on, kid! Take on the world! I’ll look forward to your return!"
  },
  {
    "Class": "Hiker",
    "Name": "Everett",
    "Sprite": "gen4/Hiker_9_.png",
    "Greeting": "What’s that? I smell dusty? Don’t you know the aroma of soil?",
    "Win": "See, that’s what you get! Your team had to eat dirt, get it?",
    "Loss": "Dropped in the dirt by some kid who doesn’t know the smell of soil!"
  },
  {
    "Class": "Hiker",
    "Name": "Raiden",
    "Sprite": "gen4/Hiker_9_.png",
    "Greeting": "Sorry for looking so scruffy and dirty. I’ve been holed up in the mountains.",
    "Win": "I wasn’t really holed up, at least not on purpose. I was lost out there.",
    "Loss": "It’s better to be holed up in the mountains than in your room, I say."
  },
  {
    "Class": "Idol",
    "Name": "Ada",
    "Sprite": "gen4/Idol_85_.png",
    "Greeting": "I’m not supposed to be here. Can we do this on the sly?",
    "Win": "Even battling can draw attention. It’s not easy being a pop star.",
    "Loss": "Pop stars are ordinary girls at heart. We want to enjoy our Pokémon, too!"
  },
  {
    "Class": "Idol",
    "Name": "Annie",
    "Sprite": "gen4/Idol_85_.png",
    "Greeting": "I’m a self-made celebrity. Do you have a problem with that?",
    "Win": "A celebrity is a celebrity, even if it’s in my own mind.",
    "Loss": "I want to be the center of attention, just me and only me."
  },
  {
    "Class": "Idol",
    "Name": "Basia",
    "Sprite": "gen4/Idol_85_.png",
    "Greeting": "I’m facing retirement soon... I was never admired as an Idol.",
    "Win": "I’m going to shine as a star battler of Pokémon!",
    "Loss": "I would have liked to end my career with a win in this match..."
  },
  {
    "Class": "Jogger",
    "Name": "Steve",
    "Sprite": "gen4/Jogger_19_.png",
    "Greeting": "I think training Pokémon shares a lot of similarities with a marathon. You agree?",
    "Win": "There’s meaning in sticking with your training regimen every day.",
    "Loss": "If you don’t pace yourself, you can’t win."
  },
  {
    "Class": "Jogger",
    "Name": "Dave",
    "Sprite": "gen4/Jogger_19_.png",
    "Greeting": "Howdy! Let’s keep it clean, fair, refreshing, and pleasant!",
    "Win": "Whew, I feel invigorated! Pokémon are the greatest!",
    "Loss": "Uh, haha...ha... It actually feels kinda cleansing to be thrashed this badly."
  },
  {
    "Class": "Worker",
    "Name": "Shane",
    "Sprite": "gen4/Worker_59_.png",
    "Greeting": "It’s the Workers of the world like us who keep the world going.",
    "Win": "There are times we would like to lay down our tools and rest.",
    "Loss": "Don’t forget how Workers like us work for you."
  },
  {
    "Class": "Worker",
    "Name": "Benji",
    "Sprite": "gen4/Worker_59_.png",
    "Greeting": "My wife and boy are waiting on me back home. I can’t afford to lose!",
    "Win": "I’m sorry, but I had to do this. You’ll get tougher with a family behind you.",
    "Loss": "Oh, no! How am I supposed to show my face around my dear wife and boy now?"
  },
  {
    "Class": "Rancher",
    "Name": "Pierce",
    "Sprite": "gen4/Rancher_71_.png",
    "Greeting": "Pokémon are like family to me. ...Nah, they are family.",
    "Win": "Yes! My family, you did it! We knocked off that mean Trainer!",
    "Loss": "Fwaaaah! That’s cruel! My family’s hurting!"
  },
  {
    "Class": "Rancher",
    "Name": "Etienne",
    "Sprite": "gen4/Rancher_71_.png",
    "Greeting": "I was too lenient with my Pokémon. They grew up all selfish on me.",
    "Win": "Hey, now, enough. Stop attacking! The battle’s long over already.",
    "Loss": "Hey, now, the battle’s over and done. No attacking the Trainer."
  },
  {
    "Class": "Rancher",
    "Name": "Leon",
    "Sprite": "gen4/Rancher_71_.png",
    "Greeting": "You, there. Don’t look around now. Pay attention to me. Focus.",
    "Win": "Kid, you’re grossly underpowered. You ought to train with me.",
    "Loss": "Oh, yeah. You’re better than you look. I was wrong about you, kid."
  },
  {
    "Class": "Cowgirl",
    "Name": "Doris",
    "Sprite": "gen4/Cowgirl_18_.png",
    "Greeting": "Go, my Pokémon. But don’t strain yourselves.",
    "Win": "Oh, wow, I like how tough everyone was. Our Pokémon and you, yup.",
    "Loss": "OK, nice try, gang. Thanks much for trying."
  },
  {
    "Class": "Cowgirl",
    "Name": "Paisley",
    "Sprite": "gen4/Cowgirl_18_.png",
    "Greeting": "My papa’s dream... I’m going to make it real.",
    "Win": "Papa, did you see? We did it all for you...",
    "Loss": "We lost... Papa, I am so sorry..."
  },
  {
    "Class": "Cowgirl",
    "Name": "Leslie",
    "Sprite": "gen4/Cowgirl_18_.png",
    "Greeting": "I’d like to take a break. ...No? We have to begin right away?",
    "Win": "Aww, see? You should have taken a break with me before.",
    "Loss": "Ooh, aren’t you a tough one? You should take breaks, though."
  },
  {
    "Class": "Cameraman",
    "Name": "Hudson",
    "Sprite": "gen4/Cameraman_83_.png",
    "Greeting": "Yes, yes, looking good! I need a smile now. Can you do that?",
    "Win": "No, no, no. I need a smile from you. Let’s see those teeth sparkle!",
    "Loss": "Yes, that’s a good smile! Now tilt your head toward me."
  },
  {
    "Class": "Cameraman",
    "Name": "Xenon",
    "Sprite": "gen4/Cameraman_83_.png",
    "Greeting": "You probably can’t tell, but I can see right down to your pores.",
    "Win": "Yes, I see it, indeed. I can see you clearly.",
    "Loss": "I zoomed in on you too much. I couldn’t see your Pokémon."
  },
  {
    "Class": "Cameraman",
    "Name": "Amleth",
    "Sprite": "gen4/Cameraman_83_.png",
    "Greeting": "While battling, I’ll keep looking for the best shot of you.",
    "Win": "There! And there again! Decisive moments in time!",
    "Loss": "Shots of me losing? Those get deleted immediately."
  },
  {
    "Class": "Reporter",
    "Name": "Dot",
    "Sprite": "gen4/Reporter_84_.png",
    "Greeting": "I’ll be bringing you live coverage from my imminent battle!",
    "Win": "Our intrepid and beautiful Reporter has carried the day! Go, me!",
    "Loss": "Our intrepid and beautiful Reporter has gone down in defeat. Take pity on me!"
  },
  {
    "Class": "Reporter",
    "Name": "Marble",
    "Sprite": "gen4/Reporter_84_.png",
    "Greeting": "I hate admitting it, but I wanted to be an Idol, too.",
    "Win": "I didn’t want to lose to any Idol. That motivated me to train.",
    "Loss": "This is crushing... I work so much harder than any silly Idol..."
  },
  {
    "Class": "Reporter",
    "Name": "Gingham",
    "Sprite": "gen4/Reporter_84_.png",
    "Greeting": "This microphone is what made me a star. It’s my all and everything.",
    "Win": "Even for a battle, I don’t let this microphone leave my hand.",
    "Loss": "...Thud. Bzzzzt..."
  },
  {
    "Class": "Cyclist",
    "Name": "Gaspar",
    "Sprite": "gen4/Cyclist_13_.png",
    "Greeting": "Hey, ’sup. I should warn you, I’m right fast, Trainer. Hold on to your hat.",
    "Win": "Trainer, from now on, you can start adding Mister to my name.",
    "Loss": "Trainer, that was a real learning experience. Thank you, seriously."
  },
  {
    "Class": "Cyclist",
    "Name": "Ignatio",
    "Sprite": "gen4/Cyclist_13_.png",
    "Greeting": "This Bike has become an extension of my very being.",
    "Win": "Any damage to my Bike, I feel the pain as if it were mine to bear.",
    "Loss": "Please! I’ll ask you to keep your filthy hands off my Bike."
  },
  {
    "Class": "Cyclist",
    "Name": "Kaylene",
    "Sprite": "gen4/Cyclist_12_.png",
    "Greeting": "When I was little, I hated cycling. I couldn’t get the hang of it.",
    "Win": "I love cycling now. I’ve made many friends riding.",
    "Loss": "Can you ride a Bike? It’s healthy and a lot of fun."
  },
  {
    "Class": "Cyclist",
    "Name": "Kaya",
    "Sprite": "gen4/Cyclist_12_.png",
    "Greeting": "I’ll ride toward the breaking dawn with you on my mind.",
    "Win": "I will shift my gears higher and higher until I catch up to you...",
    "Loss": "My tires have deflated, and so has my heart..."
  },
  {
    "Class": "Black Belt",
    "Name": "Clement",
    "Sprite": "gen4/Black Belt_14_.png",
    "Greeting": "Let the curtains rise on the festivities of muscles and Pokémon!",
    "Win": "Did you enjoy our demonstration of muscles and Pokémon?",
    "Loss": "Though I’ve lost, my muscles and Pokémon are seared into your mind."
  },
  {
    "Class": "Black Belt",
    "Name": "Mason",
    "Sprite": "gen4/Black Belt_14_.png",
    "Greeting": "They say I have fists of steel and the heart of a child.",
    "Win": "Oh, yay! Yippee! I won, I won!",
    "Loss": "Oh, boo! Boo! This stinks! I’m not talking to you!"
  },
  {
    "Class": "Battle Girl",
    "Name": "Kodi",
    "Sprite": "gen4/Battle Girl_10_.png",
    "Greeting": "Hwoaaah... Hwoaaah...",
    "Win": "Howatchah! Howaaatchaah!",
    "Loss": "Fweeeh... Fweeehhh..."
  },
  {
    "Class": "Battle Girl",
    "Name": "Aileen",
    "Sprite": "gen4/Battle Girl_10_.png",
    "Greeting": "In my dictionary, there is no entry for “restraint.”",
    "Win": "The greatest show of respect among Trainers is to battle all out.",
    "Loss": "I went all out and still lost. Of course it stings."
  },
  {
    "Class": "Black Belt",
    "Name": "Jericho",
    "Sprite": "gen4/Black Belt_14_.png",
    "Greeting": "A professional martial artist is in perpetual control of his body.",
    "Win": "A martial artist must be more than strong. He must also be wise.",
    "Loss": "Gah! I overdid my training and ran out of stamina early..."
  },
  {
    "Class": "Black Belt",
    "Name": "Harris",
    "Sprite": "gen4/Black Belt_14_.png",
    "Greeting": "When I close my eyes, I can picture you being defeated. Come on.",
    "Win": "Why be sad? You knew this was coming.",
    "Loss": "I berate myself for my own lack of care..."
  },
  {
    "Class": "Black Belt",
    "Name": "Soren",
    "Sprite": "gen4/Black Belt_14_.png",
    "Greeting": "I don’t like to move much. I trained using the Net and TV.",
    "Win": "Uhihi! I’m a naturally talented pro at both karate and Pokémon, I am.",
    "Loss": "Oh, man, this is rotten! I’m tired and hungry and want to go home!"
  },
  {
    "Class": "Battle Girl",
    "Name": "Trina",
    "Sprite": "gen4/Battle Girl_10_.png",
    "Greeting": "...To get this far, I had to make sacrifices. Many, many sacrifices.",
    "Win": "It’s for this one moment that I live.",
    "Loss": "What else do I have to give up so I can beat you?"
  },
  {
    "Class": "Battle Girl",
    "Name": "Alta",
    "Sprite": "gen4/Battle Girl_10_.png",
    "Greeting": "First, let’s battle. Talking can wait.",
    "Win": "That wasn’t bad at all, yup. That goes for you and your Pokémon.",
    "Loss": "You’re a tough one, yup. Where do you do your training?"
  },
  {
    "Class": "Battle Girl",
    "Name": "Ingrid",
    "Sprite": "gen4/Battle Girl_10_.png",
    "Greeting": "Cute little Trainer! We’ll squash you flat.",
    "Win": "Eheh! You’re so cute when you look angry and frustrated!",
    "Loss": "What do you think you’re doing? I hate to lose, I’ll have you know!"
  },
  {
    "Class": "Veteran",
    "Name": "Beck",
    "Sprite": "gen4/Veteran_27_.png",
    "Greeting": "My precious Pokémon will set you right!",
    "Win": "My Pokémon have no flaws that you can exploit!",
    "Loss": "I apologize, my dear Pokémon... I was caught unprepared..."
  },
  {
    "Class": "Veteran",
    "Name": "Eric",
    "Sprite": "gen4/Veteran_27_.png",
    "Greeting": "Fwo-fwo-fwo. Youngster, what’s most important is to never give up.",
    "Win": "If you give up, that’s it. The game’s over.",
    "Loss": "Fwo-fwo-fwo. You’re an admirable Trainer already."
  },
  {
    "Class": "Veteran",
    "Name": "Padgett",
    "Sprite": "gen4/Veteran_27_.png",
    "Greeting": "I can tell by the way you look, you’re quite taken with my dandy style!",
    "Win": "You shouldn’t be so mesmerized by me. Like a MOTHIM drawn to a flame!",
    "Loss": "Oh, you’re not interested in me? You’re just SHELLOS, if I say so myself."
  },
  {
    "Class": "Socialite",
    "Name": "Barbara",
    "Sprite": "gen4/Socialite_35_.png",
    "Greeting": "Oh, hello, aren’t you a sweetie! Are you sure you’re up to this?",
    "Win": "Oh, now, please don’t cry. You should be proud of yourself, dear.",
    "Loss": "Oh, my... You’re quite the capable practitioner of the art."
  },
  {
    "Class": "Socialite",
    "Name": "Isabel",
    "Sprite": "gen4/Socialite_35_.png",
    "Greeting": "You and your Pokémon could use an obedience lesson from me.",
    "Win": "This isn’t over until I say. Once more.",
    "Loss": "You defy me? How very amusing."
  },
  {
    "Class": "Socialite",
    "Name": "Carmen",
    "Sprite": "gen4/Socialite_35_.png",
    "Greeting": "Over the years, I’ve crossed paths with many a Trainer.",
    "Win": "They were all wonderful Trainers in their own way. All fond memories now...",
    "Loss": "You’re one among those many Trainers. I’m sorry I wasn’t younger."
  },
  {
    "Class": "Psychic",
    "Name": "Alpha",
    "Sprite": "gen4/Psychic_49_.png",
    "Greeting": "I am a Psychic, though I may not look like one. I’ll do something psychic.",
    "Win": "I didn’t use any psychic power to win. No, really.",
    "Loss": "Did you notice? I was levitating while I was in battle with you."
  },
  {
    "Class": "Psychic",
    "Name": "Beta",
    "Sprite": "gen4/Psychic_49_.png",
    "Greeting": "Fwazzam! So! You are my next victim!",
    "Win": "Fwazzam! Have you no spine?!",
    "Loss": "Fwizzle... Don’t think there will be a next time!"
  },
  {
    "Class": "Psychic",
    "Name": "Essie",
    "Sprite": "gen4/Psychic_49_.png",
    "Greeting": "I can use psychic power, but I prefer ordinary sleight-of-hand magic tricks.",
    "Win": "It’s my opinion that psychic power should be left to the Pokémon.",
    "Loss": "I’m a Psychic, but I’m also a student of a magician’s school."
  },
  {
    "Class": "Psychic",
    "Name": "Amelia",
    "Sprite": "gen4/Psychic_50_.png",
    "Greeting": "In the next few minutes, you will learn true terror at my hands!",
    "Win": "Hah! Too weak! Too weak! What pitiful resistance!",
    "Loss": "Noooo! I cannot lose!"
  },
  {
    "Class": "Psychic",
    "Name": "Celine",
    "Sprite": "gen4/Psychic_50_.png",
    "Greeting": "I see what I have no right seeing... Like there. Behind you.",
    "Win": "Oh? You can’t see it? Then, you’re fortunate. Giggle...",
    "Loss": "I wouldn’t ask about what I see. It’s better not to know. Really."
  },
  {
    "Class": "Psychic",
    "Name": "Jillian",
    "Sprite": "gen4/Psychic_50_.png",
    "Greeting": "The great unseeable power... I beseech you for help...",
    "Win": "Oh, great unseeable power... I thank you for coming to my aid...",
    "Loss": "Oh... Great unseeable power... Why have you forsaken me..."
  },
  {
    "Class": "Pokémon Breeder",
    "Name": "Howard",
    "Sprite": "gen4/Pokémon Breeder_17_.png",
    "Greeting": "Why do I raise Pokémon? Because they are there!",
    "Win": "I think I said something deep and cool! Didn’t I?",
    "Loss": "That’s no reason at all? That’s the reason in itself!"
  },
  {
    "Class": "Pokémon Breeder",
    "Name": "Derrell",
    "Sprite": "gen4/Pokémon Breeder_17_.png",
    "Greeting": "My team has been raised with care. I have absolute confidence in them.",
    "Win": "You should pay closer attention to the unique aspects of your Pokémon.",
    "Loss": "How did you find my Pokémon? Did you notice their significance?"
  },
  {
    "Class": "Pokémon Breeder",
    "Name": "Baldwin",
    "Sprite": "gen4/Pokémon Breeder_17_.png",
    "Greeting": "Everyone, it’s showtime! Get out and do some clobbering!",
    "Win": "Oh, bravo! Nicely won!",
    "Loss": "Arrgh! How humiliating! Quick! Out of the spotlight!"
  },
  {
    "Class": "Pokémon Breeder",
    "Name": "Adriana",
    "Sprite": "gen4/Pokémon Breeder_16_.png",
    "Greeting": "I love raising Pokémon. It’s what I live for!",
    "Win": "Seeing them try so hard to please... It’s so unbearably adorable.",
    "Loss": "Don’t you dare do that again!"
  },
  {
    "Class": "Pokémon Breeder",
    "Name": "Sonya",
    "Sprite": "gen4/Pokémon Breeder_16_.png",
    "Greeting": "I’ve been devising ways of raising tough Pokémon from the genetic level.",
    "Win": "You can’t overlook the role of knowledge in raising tough Pokémon.",
    "Loss": "I need to study and understand what genetics is about first."
  },
  {
    "Class": "Pokémon Breeder",
    "Name": "Tatyana",
    "Sprite": "gen4/Pokémon Breeder_16_.png",
    "Greeting": "Raise them with love, and Pokémon will answer in kind. Probably.",
    "Win": "They responded to my love. Probably.",
    "Loss": "You’re raising your Pokémon with a lot of love. I think."
  },
  {
    "Class": "Gentleman",
    "Name": "Zante",
    "Sprite": "gen4/Gentleman_34_.png",
    "Greeting": "I believe I will approach this battle from the perspective of a newborn.",
    "Win": "Abuboo dah.",
    "Loss": "Ababaa. Manmaa."
  },
  {
    "Class": "Gentleman",
    "Name": "Giliam",
    "Sprite": "gen4/Gentleman_34_.png",
    "Greeting": "If you prevail, I’ll recount to you a tale from my youth.",
    "Win": "Seeing you brings back a flood of memories. Ah, yes, indeed...",
    "Loss": "...Hm? I seem to have forgotten..."
  },
  {
    "Class": "Roughneck",
    "Name": "Rodney",
    "Sprite": "gen4/Roughneck_57_.png",
    "Greeting": "There’s no end to either adolescence or Pokémon.",
    "Win": "See ya! That was fun! Enjoy your youth!",
    "Loss": "I’m still a dreamer. A precious, unspoiled snowflake..."
  },
  {
    "Class": "Roughneck",
    "Name": "Rainier",
    "Sprite": "gen4/Roughneck_57_.png",
    "Greeting": "Daddy... Mommy... Can you hear me? Please watch over me...",
    "Win": "Daddy... Mommy... Did you see? I won, and it’s all for you...",
    "Loss": "Oh... Daddy... Mommy... I couldn’t win..."
  },
  {
    "Class": "Scientist",
    "Name": "Jean",
    "Sprite": "gen4/Scientist_113_.png",
    "Greeting": "Finally... The time has come to put the fruits of my research to the test...",
    "Win": "Success... Sacrificing my youth was worthwhile.",
    "Loss": "No! Nooooooo! Give me back my youth!"
  },
  {
    "Class": "Scientist",
    "Name": "Brad",
    "Sprite": "gen4/Scientist_113_.png",
    "Greeting": "I developed a special Pokémon drink. Have some! Bottoms up!",
    "Win": "Glug, glug... Belch! It’ll make you strong! Don’t waste it!",
    "Loss": "My Pokémon drink contains no actual Pokémon or their byproducts."
  },
  {
    "Class": "Clown",
    "Name": "Francis",
    "Sprite": "gen4/Clown_58_.png",
    "Greeting": "An analogy for battling is... I’d say a bachelor guy.",
    "Win": "Heheh, do you get it? I doubt you’d get it. No one does.",
    "Loss": "Do you get what I’m saying? I doubt you’d get it. No one ever does."
  },
  {
    "Class": "Clown",
    "Name": "Prescot",
    "Sprite": "gen4/Clown_58_.png",
    "Greeting": "Myself, I have been born, raised, and spent my life under a circus tent.",
    "Win": "My Pokémon, too. They were born and raised under a circus tent.",
    "Loss": "The outside world is so very cruel... We shall return to our circus tent."
  },
  {
    "Class": "Ace Trainer",
    "Name": "Yardley",
    "Sprite": "gen4/Ace Trainer_24_.png",
    "Greeting": "Oi, you! Yeah, you! Snap to it! I’ll be training you!",
    "Win": "What?! You’re down and out already?! This is no bed! Get up!",
    "Loss": "Good! Enough! That will do for today!"
  },
  {
    "Class": "Ace Trainer",
    "Name": "Stavros",
    "Sprite": "gen4/Ace Trainer_24_.png",
    "Greeting": "Fwah? You mean to challenge me?",
    "Win": "Fwahaha! I win! Better luck next time, punk!",
    "Loss": "Fwaah?! You defeated me? Who are you to do that?!"
  },
  {
    "Class": "Ace Trainer",
    "Name": "Zane",
    "Sprite": "gen4/Ace Trainer_24_.png",
    "Greeting": "Ooh, it gives me shivers... I live for this moment.",
    "Win": "Oh, yeah... That’s it... Perfection doesn’t come better...",
    "Loss": "It’s gotten so I can’t live without battling anymore."
  },
  {
    "Class": "Ace Trainer",
    "Name": "Kim",
    "Sprite": "gen4/Ace Trainer_25_.png",
    "Greeting": "OK! I’m going to do it! I’m going to show you my best!",
    "Win": "Gasp, gasp...",
    "Loss": "Never again! You can forget about a next time!"
  },
  {
    "Class": "Ace Trainer",
    "Name": "Macy",
    "Sprite": "gen4/Ace Trainer_25_.png",
    "Greeting": "Um... I’m honestly quite tough. Please keep up.",
    "Win": "I’m sorry. I don’t think you measure up after all.",
    "Loss": "I’m amazed. I didn’t think you’d win..."
  },
  {
    "Class": "Ace Trainer",
    "Name": "Faun",
    "Sprite": "gen4/Ace Trainer_25_.png",
    "Greeting": "Let’s go, me! Go, me, go! Don’t lose, don’t lose, rah, rah, rah!",
    "Win": "Way to go, me! I’m so wonderful! Rah, rah, rah! Gooooooo, me!",
    "Loss": "It’s OK, me! Don’t cry! Don’t cry! Go home, go home, goooooo!"
  },
  {
    "Class": "Pokémon Ranger",
    "Name": "Doyle",
    "Sprite": "gen4/Pokémon Ranger_39_.png",
    "Greeting": "Woohoo! Here comes a cool Trainer! Let’s see what you can bring!",
    "Win": "Yes! Bravo! You have some good attacks, Trainer!",
    "Loss": "Whaaaaat?! Nooooo! I can’t get over how tough you are!"
  },
  {
    "Class": "Pokémon Ranger",
    "Name": "Duke",
    "Sprite": "gen4/Pokémon Ranger_39_.png",
    "Greeting": "To serve and protect Pokémon and nature. That’s my mission!",
    "Win": "My skills I developed in the embrace of Mother Nature!",
    "Loss": "My mission needs me! This is where we bid good-bye!"
  },
  {
    "Class": "Pokémon Ranger",
    "Name": "Deacon",
    "Sprite": "gen4/Pokémon Ranger_39_.png",
    "Greeting": "Never fear, this Pokémon Ranger is here to protect my own personal peace!",
    "Win": "My personal peace has been protected!",
    "Loss": "You vile Trainer, you! You’ve shattered my peace!"
  },
  {
    "Class": "Pokémon Ranger",
    "Name": "Mena",
    "Sprite": "gen4/Pokémon Ranger_40_.png",
    "Greeting": "Any bad kids littering the fields? Any bad kids fouling the sea?",
    "Win": "Be sure to sort your recyclables from the trash when you’re throwing it out!",
    "Loss": "Trash is like a battle. Don’t be too quick to throw it!"
  },
  {
    "Class": "Pokémon Ranger",
    "Name": "Mercy",
    "Sprite": "gen4/Pokémon Ranger_40_.png",
    "Greeting": "Watch me, darling! I’m putting my best into this!",
    "Win": "See, darling? Did you see? I put in my best effort for you.",
    "Loss": "I can’t have my darling see me like this. How pathetic I must look..."
  },
  {
    "Class": "Pokémon Ranger",
    "Name": "Evita",
    "Sprite": "gen4/Pokémon Ranger_40_.png",
    "Greeting": "So, I lead with this... Then, counter... Ugh, I can’t get our strategy right!",
    "Win": "To overanalyze can be a bad thing, I guess.",
    "Loss": "Waaah! Couldn’t you have waited? Until I’m ready at least?"
  },
  {
    "Class": "Dragon Tamer",
    "Name": "Harold",
    "Sprite": "gen4/Dragon Tamer_29_.png",
    "Greeting": "How do you like my cape? I had it specially made!",
    "Win": "What is my cape made of? I’m afraid I can’t tell you.",
    "Loss": "Rip... Riiiiiiiiiiiipppppp! ...What?! My cape! Waaaaah!"
  },
  {
    "Class": "Dragon Tamer",
    "Name": "Herman",
    "Sprite": "gen4/Dragon Tamer_29_.png",
    "Greeting": "Do you know what real terror is? I am familiar with it. Intimately so...",
    "Win": "You learned something today, yes? The true meaning of terror.",
    "Loss": "Aiyeeh! What’s with you? I’m pleading for mercy here!"
  },
  {
    "Class": "Dragon Tamer",
    "Name": "Emmett",
    "Sprite": "gen4/Dragon Tamer_29_.png",
    "Greeting": "See it! Hear it! Smell it! Marvel at my power!",
    "Win": "That’s right! Use all your senses and realize what you were up against!",
    "Loss": "I didn’t see anything! I’m not listening! And I don’t smell a thing!"
  },
  {
    "Class": "Dragon Tamer",
    "Name": "Erich",
    "Sprite": "gen4/Dragon Tamer_29_.png",
    "Greeting": "Unluckily for you, your winning streak ends with me.",
    "Win": "You lost to me, but you’re still on your feet. Kudos to you!",
    "Loss": "This can’t be. I won’t accept it. There has to be a mistake somewhere."
  },
  {
    "Class": "Ace Trainer",
    "Name": "Garvey",
    "Sprite": "gen4/Ace Trainer_53_.png",
    "Greeting": "I c-c-can’t stop shivering. B-but this is a b-battle. I have to.",
    "Win": "Urrff... Ch-chatter... I won, I won...",
    "Loss": "Sh-shiver... Urf... My eyelids are getting droopy..."
  },
  {
    "Class": "Ace Trainer",
    "Name": "Cruz",
    "Sprite": "gen4/Ace Trainer_53_.png",
    "Greeting": "I’ll say good-bye to you now. Battles always end in tears.",
    "Win": "Fweeeeh! My tears of joy flow freely!",
    "Loss": "Fweeeeh! My tears of anguish flow freely!"
  },
  {
    "Class": "Ace Trainer",
    "Name": "Pamela",
    "Sprite": "gen4/Ace Trainer_54_.png",
    "Greeting": "How amusing! You came here knowing of your certain defeat?",
    "Win": "Ahahahah! Very entertaining! I shall be happy to see you again!",
    "Loss": "Wh-what is happening...? M-my vision is turning milky white..."
  },
  {
    "Class": "Ace Trainer",
    "Name": "Daniela",
    "Sprite": "gen4/Ace Trainer_54_.png",
    "Greeting": "A Trainer am I, a new ray of hope from the land of the midnight sun.",
    "Win": "In the frigid falls of the north, I honed my skills. With them, I made you fall.",
    "Loss": "Your foul trickery deserves contempt. But effective it was, too."
  },
  {
    "Class": "Youngster",
    "Name": "Kaden",
    "Sprite": "gen4/Youngster_2_.png",
    "Greeting": "I’ve been pondering lately... How much longer will I be wearing shorts?",
    "Win": "Will I still be in shorts as a grown-up?",
    "Loss": "If I grow old like this, will they call me something silly like “Shorts Man”?"
  },
  {
    "Class": "Youngster",
    "Name": "Kolby",
    "Sprite": "gen4/Youngster_2_.png",
    "Greeting": "That’s right, I’m the legendary kid in shorts who’s the talk of the town.",
    "Win": "Even a Youngster in shorts like me can be the stuff of a legend or two.",
    "Loss": "My legend is over..."
  },
  {
    "Class": "Lass",
    "Name": "Karissa",
    "Sprite": "gen4/Lass_3_.png",
    "Greeting": "Uh... Um... H-hello. P-pleased to meet you.",
    "Win": "S-s-sorry. I’m r-really n-nervous.",
    "Loss": "Uh... Th-thank you. That was f-fun."
  },
  {
    "Class": "Lass",
    "Name": "Liliana",
    "Sprite": "gen4/Lass_3_.png",
    "Greeting": "Oh, this place is so passé now. I’m missing out on shopping.",
    "Win": "You’re kind of stylish, actually. Oh, I wish I had new clothes.",
    "Loss": "Maybe I’ll collect Accessories for some Contests..."
  },
  {
    "Class": "School Kid",
    "Name": "Jonas",
    "Sprite": "gen4/School Kid_60_.png",
    "Greeting": "Exam season’s coming up, but I’m neck-deep in battling...",
    "Win": "Mom’s going to cut me off. I just know it...",
    "Loss": "I have to keep up on both my studying and Pokémon..."
  },
  {
    "Class": "School Kid",
    "Name": "Keon",
    "Sprite": "gen4/School Kid_60_.png",
    "Greeting": "Hiya, you Trainer there! Slip on some glasses. They’ll make you look better.",
    "Win": "Nothing’s the matter with my eyes. I wear glasses for the looks I get.",
    "Loss": "Whoops! My glasses, my glasses."
  },
  {
    "Class": "School Kid",
    "Name": "Chelsie",
    "Sprite": "gen4/School Kid_61_.png",
    "Greeting": "I’ve been taught every opponent has a weakness. If I can find yours...",
    "Win": "Eheheh. I figured out your weakness.",
    "Loss": "Did you figure out my weakness?"
  },
  {
    "Class": "School Kid",
    "Name": "Regina",
    "Sprite": "gen4/School Kid_61_.png",
    "Greeting": "It’s been so long since I had my last battle.",
    "Win": "You know, battling is fun after all.",
    "Loss": "Battling is so much fun, but..."
  },
  {
    "Class": "Rich Boy",
    "Name": "Daulton",
    "Sprite": "gen4/Rich Boy_32_.png",
    "Greeting": "The age of money has come to Pokémon battling. I’ll teach you who is right.",
    "Win": "You understand, don’t you? What is right, and who is stronger?",
    "Loss": "M-my Pokémon! What have you done? What am I to do?!"
  },
  {
    "Class": "Rich Boy",
    "Name": "Hanson",
    "Sprite": "gen4/Rich Boy_32_.png",
    "Greeting": "You’re my opponent? Oh, all right... Try not to disappoint me too badly.",
    "Win": "My Pokémon are all tops in luxury. Do you see? This is what power is about.",
    "Loss": "Nyah! I don’t care! I’ve got enough  money to fill a swimming pool!"
  },
  {
    "Class": "Lady",
    "Name": "Amory",
    "Sprite": "gen4/Lady_33_.png",
    "Greeting": "You there. Yes, you. I’m feeling rather bored.",
    "Win": "I suppose that was enjoyable for what it was. I thank you for it.",
    "Loss": "You are rather good. Quite remarkable, even."
  },
  {
    "Class": "Lady",
    "Name": "Juliana",
    "Sprite": "gen4/Lady_33_.png",
    "Greeting": "I can sink your sort with minimal effort.",
    "Win": "It took the barest of efforts to win this match.",
    "Loss": "You swamped us with no effort at all..."
  },
  {
    "Class": "Bug Catcher",
    "Name": "Camui",
    "Sprite": "gen4/Bug Catcher_6_.png",
    "Greeting": "My room is always full of bugs. That drives my mom just wild.",
    "Win": "I want to collect more bug Pokémon for my bug appreciation station.",
    "Loss": "Bugs are loose under my shirt. I’m starting to itch..."
  },
  {
    "Class": "Bug Catcher",
    "Name": "Orlando",
    "Sprite": "gen4/Bug Catcher_6_.png",
    "Greeting": "People claim I’m like an adult. Whatever could they mean, do you suppose?",
    "Win": "Ah, yes, quite enjoyable! We must do this again, surely.",
    "Loss": "Oh, yes! Smashing! That chilled me to my toes, it did!"
  },
  {
    "Class": "Ninja Boy",
    "Name": "Zack",
    "Sprite": "gen4/Ninja Boy_28_.png",
    "Greeting": "I have made my choice. When I fall, it shall be forward!",
    "Win": "You lack conviction.",
    "Loss": "...Thud."
  },
  {
    "Class": "Ninja Boy",
    "Name": "Vance",
    "Sprite": "gen4/Ninja Boy_28_.png",
    "Greeting": "So, what exactly is a ninja, you may ask.",
    "Win": "A ninja is powerful. That will do as a start.",
    "Loss": "Maybe some ninjas are weak?"
  },
  {
    "Class": "Poké Kid",
    "Name": "Kyla",
    "Sprite": "gen4/Poké Kid_22_.png",
    "Greeting": "I once saw a lady wearing the same outfit as me.",
    "Win": "She said, “You’re showing serious fashion chops.”",
    "Loss": "She said, “You’re kidding me, am I right?”"
  },
  {
    "Class": "Poké Kid",
    "Name": "Ruby",
    "Sprite": "gen4/Poké Kid_22_.png",
    "Greeting": "Will you believe that inside this costume is a grown-up Beauty?",
    "Win": "My dream is to live as a Pokémon one day. To become a Pokémon!",
    "Loss": "I’m an adult, but I want to be a Pokémon. Does that make me weird?"
  },
  {
    "Class": "Idol",
    "Name": "Kiley",
    "Sprite": "gen4/Idol_85_.png",
    "Greeting": "My profile’s riding high now, so my schedule’s filled solid!",
    "Win": "Oh, no! It’s this late already? I’d better check my timetable!",
    "Loss": "Talent manager! Do I have time for a rematch?"
  },
  {
    "Class": "Idol",
    "Name": "Utah",
    "Sprite": "gen4/Idol_85_.png",
    "Greeting": "Are you another of my fans? I can give you an autograph if you’d lose?",
    "Win": "Here’s your autograph! Cherish it! Oh, sorry! I don’t do handshakes.",
    "Loss": "I’m sorry, I was acting GASTLY! It was very DELCATTY of me!"
  },
  {
    "Class": "Jogger",
    "Name": "Colt",
    "Sprite": "gen4/Jogger_19_.png",
    "Greeting": "I need to diet. I have to get out jogging.",
    "Win": "Well, I guess I’ll go for a quick trot around here...",
    "Loss": "Your Pokémon know how to punch hard. You see, I’m really a boxer."
  },
  {
    "Class": "Jogger",
    "Name": "Tory",
    "Sprite": "gen4/Jogger_19_.png",
    "Greeting": "I look to bug Pokémon for hints on running all the time.",
    "Win": "I admire the light and agile footwork of bug Pokémon.",
    "Loss": "Skitter..."
  },
  {
    "Class": "Fisherman",
    "Name": "Farley",
    "Sprite": "gen4/Fisherman_11_.png",
    "Greeting": "Listen, I’m feeling bushed today. Can we do this tomorrow first thing?",
    "Win": "Oh, all right. You’re impatient. Couldn’t wait till tomorrow, oh no.",
    "Loss": "That’s why I said tomorrow. I can barely stay awake now."
  },
  {
    "Class": "Fisherman",
    "Name": "Mark",
    "Sprite": "gen4/Fisherman_11_.png",
    "Greeting": "Feed the Pokémon you catch, or they will flee. Do you see?",
    "Win": "Once a Pokémon has fled, it will never return. Do you see?",
    "Loss": "What I said about Pokémon--it is a parable. Do you see?"
  },
  {
    "Class": "Ruin Maniac",
    "Name": "Samuel",
    "Sprite": "gen4/Ruin Maniac_48_.png",
    "Greeting": "When I was younger, I went out on digs chasing rumors of hidden treasures.",
    "Win": "Of course, there are no such things. But it’s about chasing a dream.",
    "Loss": "Well, it sure left huge holes... In the ground and in my bank account."
  },
  {
    "Class": "Ruin Maniac",
    "Name": "Penn",
    "Sprite": "gen4/Ruin Maniac_48_.png",
    "Greeting": "I’ll launch an avalanche of moves! I’ll test your limits of endurance!",
    "Win": "Well, Trainer? Should I try out some more moves?",
    "Loss": "That’s it! I’m all out of stock! I’d like you to leave so I can close up!"
  },
  {
    "Class": "Collector",
    "Name": "Marquez",
    "Sprite": "gen4/Collector_37_.png",
    "Greeting": "I collect and battle Pokémon so I can brag to my peers.",
    "Win": "I’m not all that interested in winning or losing to begin with.",
    "Loss": "You’ve won the battle. But, in terms of the Pokémon involved, I clearly win."
  },
  {
    "Class": "Collector",
    "Name": "Arnold",
    "Sprite": "gen4/Collector_37_.png",
    "Greeting": "Did you want to see my Pokémon? OK, sure. Just a peek, though.",
    "Win": "How’s that for classy? My Pokémon are tops in both moves and character.",
    "Loss": "Hold it right there! You can look, but don’t touch!"
  },
  {
    "Class": "Guitarist",
    "Name": "Fred",
    "Sprite": "gen4/Guitarist_52_.png",
    "Greeting": "Rock? Samba? Traditional folk? I can play in any style. It’s all good!",
    "Win": "Music and Pokémon uplift me! I’m carried up among the stars!",
    "Loss": "Sigh... I’m seeing stars... You’ve got me singing the blues..."
  },
  {
    "Class": "Guitarist",
    "Name": "Chase",
    "Sprite": "gen4/Guitarist_52_.png",
    "Greeting": "Let my exquisite melody ring out! Hear my Pokémon shout out!",
    "Win": "The melody from my Pokémon and me... Did it reach out and touch your heart?",
    "Loss": "I’ve been known to throw matches, but I’ll never throw a guitar on stage!"
  },
  {
    "Class": "Bird Keeper",
    "Name": "McKenna",
    "Sprite": "gen4/Bird Keeper_69_.png",
    "Greeting": "I’m free like a bird! I feel like I could fly!",
    "Win": "That’s how I ended up becoming a Bird Keeper.",
    "Loss": "Like most birds, I can’t see very well at night."
  },
  {
    "Class": "Bird Keeper",
    "Name": "Sally",
    "Sprite": "gen4/Bird Keeper_69_.png",
    "Greeting": "As a Trainer, I’m as fragile as an egg. Please be gentle on me.",
    "Win": "Do you think I’m getting ready to take flight?",
    "Loss": "One of these days, I’ll break out of my shell and defeat you."
  },
  {
    "Class": "Sailor",
    "Name": "Casper",
    "Sprite": "gen4/Sailor_46_.png",
    "Greeting": "Bear witness to my display of machismo and masculinity!",
    "Win": "There! That’s how a real man lives and battles!",
    "Loss": "Waaaah! Waaaah! Mommy!"
  },
  {
    "Class": "Sailor",
    "Name": "Derrian",
    "Sprite": "gen4/Sailor_46_.png",
    "Greeting": "I’ve got a showdown coming up with a Hiker. Let me see if I’m ready!",
    "Win": "Yep, I’d say my team’s about ready. That Hiker won’t know what hit him!",
    "Loss": "Aww, blast it, no! I can’t beat that Hiker like this!"
  },
  {
    "Class": "Hiker",
    "Name": "Monty",
    "Sprite": "gen4/Hiker_9_.png",
    "Greeting": "My showdown against a man of the sea draws near! Let me test my team!",
    "Win": "Everything went as calculated... Be ready for me, man of the sea!",
    "Loss": "Beating the man of the sea is impossible with an outcome this lame..."
  },
  {
    "Class": "Hiker",
    "Name": "Rockie",
    "Sprite": "gen4/Hiker_9_.png",
    "Greeting": "Uhho uho-uho uhho hohoi! This dance I use to psych myself up.",
    "Win": "Uhho uho-uho uhho hohoi! So much fun, I cannot stop.",
    "Loss": "Uhho uho-uho uhho hohoi! I dance to stem my tears from losing..."
  },
  {
    "Class": "Policeman",
    "Name": "Reggie",
    "Sprite": "gen4/Policeman_38_.png",
    "Greeting": "I’m not really with the police. I’m a collector of uniforms.",
    "Win": "Battling as a Policeman made for a very fun battle, it did.",
    "Loss": "That’s it for me. I bid you a fond farewell."
  },
  {
    "Class": "Policeman",
    "Name": "Quincy",
    "Sprite": "gen4/Policeman_38_.png",
    "Greeting": "I’m a Policeman. But on holidays, I’m an entirely different kind of guy.",
    "Win": "Usually, I chase after bad guys as a Policeman.",
    "Loss": "On my days off, I chase after the waves and the ladies as a Swimmer."
  },
  {
    "Class": "PI",
    "Name": "Neil",
    "Sprite": "gen4/PI_51_.png",
    "Greeting": "Perseverance pays off. A case can turn on that.",
    "Win": "It makes for more excitement when you come from behind to take the win.",
    "Loss": "That was more thrilling than any stakeout! Thanks for that!"
  },
  {
    "Class": "PI",
    "Name": "Sergei",
    "Sprite": "gen4/PI_51_.png",
    "Greeting": "My present case can go either way. It’s a coin toss.",
    "Win": "So, I won this time... All decided by a fickle coin...",
    "Loss": "Best two out of three?"
  },
  {
    "Class": "Camper",
    "Name": "Freddy",
    "Sprite": "gen4/Camper_4_.png",
    "Greeting": "I live in the woods. You know, I’m a Camper.",
    "Win": "I’m working on making camp life more comfortable.",
    "Loss": "I am sick and tired of camping out in the woods..."
  },
  {
    "Class": "Camper",
    "Name": "Andre",
    "Sprite": "gen4/Camper_4_.png",
    "Greeting": "No, no, I can’t do this! I’m not cut out for battling!",
    "Win": "Oh, wow! I won! What’ll I do? You’re not mad at me, are you?",
    "Loss": "See! I told you before we started! Battling just isn’t for me."
  },
  {
    "Class": "Picnicker",
    "Name": "Inga",
    "Sprite": "gen4/Picnicker_5_.png",
    "Greeting": "Trainer spotted! It’s time to get cooking!",
    "Win": "A battle should be enjoyed like a tasty meal!",
    "Loss": "I ended up getting cooked!"
  },
  {
    "Class": "Picnicker",
    "Name": "Tonya",
    "Sprite": "gen4/Picnicker_5_.png",
    "Greeting": "Fweeoo-fwee-fwee-fyoo... I saunter into battle, whistling...",
    "Win": "Too easy! I was whistling all the way through that.",
    "Loss": "Fwee-ooo fwee-ooo fwee-ooo... I switched to an ambulance siren..."
  },
  {
    "Class": "Guitarist",
    "Name": "Tobias",
    "Sprite": "gen4/Guitarist_52_.png",
    "Greeting": "I can hear it... The screaming adulation of 100,000 fans rising in unison...",
    "Win": "Right on, everyone! You saw that! I dedicate my win to you!",
    "Loss": "You’re scorching... You’ve made a fan out of me."
  },
  {
    "Class": "Guitarist",
    "Name": "Cecil",
    "Sprite": "gen4/Guitarist_52_.png",
    "Greeting": "Number one worldwide, that’s my dream. Well, to start, anyway.",
    "Win": "“Number one worldwide,” now doesn’t that have a good ring to it?",
    "Loss": "I can’t quite decide what I should be number one worldwide at."
  },
  {
    "Class": "Idol",
    "Name": "Maranda",
    "Sprite": "gen4/Idol_85_.png",
    "Greeting": "I’m not some cheap Idol! I’m an actress! Please remember that!",
    "Win": "My career isn’t anything like your typical Idol’s career!",
    "Loss": "I’m an actress... It sounds so deliciously right..."
  },
  {
    "Class": "Idol",
    "Name": "Helene",
    "Sprite": "gen4/Idol_85_.png",
    "Greeting": "We’re not here for a long time, so let’s make it a good time!",
    "Win": "Thank you! That was soooo fun! I really hope we can battle again!",
    "Loss": "It makes me sad having to say good-bye... Please come see me again!"
  },
  {
    "Class": "Pokéfan",
    "Name": "Simon",
    "Sprite": "gen4/Pokéfan_21_.png",
    "Greeting": "I am the Fan Club Division Manager... Bring your best to bear...",
    "Win": "Kneel before the might of the Fan Club!",
    "Loss": "Gweh! But I did my best! Regrets, I have none!"
  },
  {
    "Class": "Pokéfan",
    "Name": "Turner",
    "Sprite": "gen4/Pokéfan_21_.png",
    "Greeting": "I welcome you, young Trainer. Allow me to demonstrate my power.",
    "Win": "Young Trainer, do you have any idea what my power signifies?",
    "Loss": "You’ve surpassed me in your love of Pokémon. You’re the truest of fans."
  },
  {
    "Class": "Pokéfan",
    "Name": "Europa",
    "Sprite": "gen4/Pokéfan_20_.png",
    "Greeting": "I think I’ll try out the TM the woman next door gave me.",
    "Win": "I am impressed. That woman actually gave me something useful.",
    "Loss": "Oh, that nasty woman! This TM is worthless!"
  },
  {
    "Class": "Pokéfan",
    "Name": "Pandora",
    "Sprite": "gen4/Pokéfan_20_.png",
    "Greeting": "I heard that! I may be old enough to be your mom, but I’m still young!",
    "Win": "Look at my skin tone and my Pokémon! Both firm but supple!",
    "Loss": "Please don’t make that mistake again! I’m young, I tell you!"
  },
  {
    "Class": "Rancher",
    "Name": "Vern",
    "Sprite": "gen4/Rancher_71_.png",
    "Greeting": "Whether it be work or play, I’m with my Pokémon all day.",
    "Win": "Life without Pokémon? I can’t picture that.",
    "Loss": "It’s like I’m married to my Pokémon. I’m not married, though."
  },
  {
    "Class": "Rancher",
    "Name": "Boris",
    "Sprite": "gen4/Rancher_71_.png",
    "Greeting": "You get to be the best by working harder than everyone else.",
    "Win": "I reckon I’ve been a hard worker.",
    "Loss": "Work at battling over and over. Your star will shine one day."
  },
  {
    "Class": "Cowgirl",
    "Name": "Carly",
    "Sprite": "gen4/Cowgirl_18_.png",
    "Greeting": "I’m going to become famous here so I can rebuild the ranch.",
    "Win": "I can’t lose. It’s for my pa and ma.",
    "Loss": "If I can get famous, folks’ll pay to visit my ranch..."
  },
  {
    "Class": "Cowgirl",
    "Name": "Ginger",
    "Sprite": "gen4/Cowgirl_18_.png",
    "Greeting": "From sundown, I live by candlelight until I go to sleep.",
    "Win": "That’s not to say I don’t have electric power on the homestead.",
    "Loss": "Candlelight can be very romantic."
  },
  {
    "Class": "Pokémon Breeder",
    "Name": "Peter",
    "Sprite": "gen4/Pokémon Breeder_17_.png",
    "Greeting": "I’d like to introduce you to my cherished partners.",
    "Win": "Good, good. Good going, gang. You guys all did great.",
    "Loss": "Wheeze... Wheeze... I’m feeling faint..."
  },
  {
    "Class": "Pokémon Breeder",
    "Name": "Tyron",
    "Sprite": "gen4/Pokémon Breeder_17_.png",
    "Greeting": "I’m no green thumb at growing Berries. Raising Pokémon is where I shine.",
    "Win": "I can give you tips on raising Pokémon so they’ll grow tough.",
    "Loss": "Raising a living thing is never an easy job..."
  },
  {
    "Class": "Pokémon Breeder",
    "Name": "Zorya",
    "Sprite": "gen4/Pokémon Breeder_16_.png",
    "Greeting": "Pokémon are Pokémon, no matter how tough, weak, cute, or scary.",
    "Win": "Raise Pokémon with love, and they’ll return it.",
    "Loss": "I think it’s the Trainer who needs to pick up the pace here."
  },
  {
    "Class": "Pokémon Breeder",
    "Name": "Antonia",
    "Sprite": "gen4/Pokémon Breeder_16_.png",
    "Greeting": "Raising a Pokémon right takes money and time.",
    "Win": "But it’s all worthwhile when the Pokémon grows up.",
    "Loss": "To raise the ideal Pokémon, I’m willing to work hard."
  },
  {
    "Class": "Ace Trainer",
    "Name": "Sawyer",
    "Sprite": "gen4/Ace Trainer_53_.png",
    "Greeting": "That’s right, I’m tough. I won’t lose. I don’t think losing’s possible.",
    "Win": "Yup, I’m so tough... Ehehe... Heeheehee...",
    "Loss": "I lost? But, how...? What now? What do I do?"
  },
  {
    "Class": "Ace Trainer",
    "Name": "Charlie",
    "Sprite": "gen4/Ace Trainer_53_.png",
    "Greeting": "I’m an Ace Trainer, so this is for bragging rights.",
    "Win": "Yup, you did good. No, seriously.",
    "Loss": "Heh... I’ve got a long ways to go..."
  },
  {
    "Class": "Ace Trainer",
    "Name": "Chloe",
    "Sprite": "gen4/Ace Trainer_54_.png",
    "Greeting": "I was looking forward to a battle with you!",
    "Win": "I was right! You are pretty decent. Why not become an Ace Trainer?",
    "Loss": "You’re as good as the rumors say... May I have a rematch one day?"
  },
  {
    "Class": "Ace Trainer",
    "Name": "Daphne",
    "Sprite": "gen4/Ace Trainer_54_.png",
    "Greeting": "Look at me. I’m what you should be aspiring to be.",
    "Win": "You expected anything else?",
    "Loss": "You’ve already surpassed me. But you can aim so much higher."
  },
  {
    "Class": "Ace Trainer",
    "Name": "Thad",
    "Sprite": "gen4/Ace Trainer_53_.png",
    "Greeting": "My whole life hinges on this one battle! ...Lose for me, pretty please?",
    "Win": "Yeah! I won! It’s all smooth sailing for me now!",
    "Loss": "I wasn’t supposed to lose... That’s my life derailed..."
  },
  {
    "Class": "Ace Trainer",
    "Name": "Lew",
    "Sprite": "gen4/Ace Trainer_53_.png",
    "Greeting": "I’m running a fever here. Just so’s you know.",
    "Win": "Oogh, my head’s burning up. It makes me feel more inspired.",
    "Loss": "Like I said, I have a cold. I’m not on top of my game."
  },
  {
    "Class": "Ace Trainer",
    "Name": "Opal",
    "Sprite": "gen4/Ace Trainer_54_.png",
    "Greeting": "When we battle, I want you to be very careful. My coat’s very expensive.",
    "Win": "Yikes! Eek! Watch out! You almost got Pokémon sweat on my coat!",
    "Loss": "I was worried about getting my coat dirty. Who cares about your battle?"
  },
  {
    "Class": "Ace Trainer",
    "Name": "Leda",
    "Sprite": "gen4/Ace Trainer_54_.png",
    "Greeting": "I wish you’d leave. I don’t want to see you lose.",
    "Win": "I told you so... Can you leave, please?",
    "Loss": "Listen...is being tough not always a good thing?"
  },
  {
    "Class": "Pokémon Ranger",
    "Name": "Geoff",
    "Sprite": "gen4/Pokémon Ranger_39_.png",
    "Greeting": "Whoa-whoa-whoa... Careful now! Maintaining balance is the key!",
    "Win": "Whoops...! Almost went over! Have to be careful here...",
    "Loss": "...Waaaaaah... Thud!"
  },
  {
    "Class": "Pokémon Ranger",
    "Name": "Gunther",
    "Sprite": "gen4/Pokémon Ranger_39_.png",
    "Greeting": "Now don’t you worry about a thing. You leave everything to me, OK?",
    "Win": "What do you say? Fun, hey? It’d be nice if we could meet again.",
    "Loss": "Well, I’ll be! You sure got the best of me!"
  },
  {
    "Class": "Pokémon Ranger",
    "Name": "Alma",
    "Sprite": "gen4/Pokémon Ranger_40_.png",
    "Greeting": "I will battle. It’s not likely I will lose. I’m tough.",
    "Win": "I win. I could do a dance right now.",
    "Loss": "What is the matter? Why couldn’t I win?"
  },
  {
    "Class": "Pokémon Ranger",
    "Name": "Elise",
    "Sprite": "gen4/Pokémon Ranger_40_.png",
    "Greeting": "Mother Nature, I beseech you! Please, lend me strength!",
    "Win": "Oh, Mother Nature, I thank you! To you, I dedicate this victory!",
    "Loss": "I’m sorry, Mother Nature! I’m sorry to disappoint you!"
  },
  {
    "Class": "Dragon Tamer",
    "Name": "Harvey",
    "Sprite": "gen4/Dragon Tamer_29_.png",
    "Greeting": "A good Trainer takes on all challenges regardless of the foe or the rules.",
    "Win": "No Trainer can be considered bad if they battle the best they can.",
    "Loss": "A good Trainer doesn’t gloat over a win. They just prepare for the next battle."
  },
  {
    "Class": "Dragon Tamer",
    "Name": "Nicolas",
    "Sprite": "gen4/Dragon Tamer_29_.png",
    "Greeting": "Come hither, my Pokémon! Please get rid of this mean Trainer!",
    "Win": "Ooh, yes, I love you, my sweeties!Come here and give me a kiss!",
    "Loss": "How could you?! You hurt my sweet little ones!"
  },
  {
    "Class": "Black Belt",
    "Name": "Fergus",
    "Sprite": "gen4/Black Belt_14_.png",
    "Greeting": "I’m fine with practice and training, but I wilt when the chips are down.",
    "Win": "I feel sick from tension! I’d rather be at home practicing!",
    "Loss": "If it’s about practice, I’d be the champ without a doubt."
  },
  {
    "Class": "Black Belt",
    "Name": "Ronni",
    "Sprite": "gen4/Black Belt_14_.png",
    "Greeting": "Hi-yah! Hah! Hah! One more! Hah! Hah!",
    "Win": "Boo-yah!",
    "Loss": "Hi-yah! ...No, wait! No!"
  },
  {
    "Class": "Battle Girl",
    "Name": "Eve",
    "Sprite": "gen4/Battle Girl_10_.png",
    "Greeting": "Wanna?",
    "Win": "Heh...",
    "Loss": "You beat me? Where’s your dojo?"
  },
  {
    "Class": "Battle Girl",
    "Name": "Mariane",
    "Sprite": "gen4/Battle Girl_10_.png",
    "Greeting": "Come oooon! C’mon, c’mon! Hey! Hey! C’mon, hey!",
    "Win": "Oh, yesssss!",
    "Loss": "Oh, noooooo!"
  },
  {
    "Class": "Veteran",
    "Name": "Costin",
    "Sprite": "gen4/Veteran_27_.png",
    "Greeting": "Your eyes are unclouded by doubt. This match will be entertaining...",
    "Win": "From the bottom of my heart, I look forward to your return.",
    "Loss": "Whew... A most entertaining match. I hope you’ll grant me a rematch."
  },
  {
    "Class": "Veteran",
    "Name": "Alfred",
    "Sprite": "gen4/Veteran_27_.png",
    "Greeting": "You need to be taught what wisdom of age means in battle!",
    "Win": "I’ll have you know that no child can hope to defeat me!",
    "Loss": "That did not happen! Unfair! I demand a rematch right now!"
  },
  {
    "Class": "Socialite",
    "Name": "Rioha",
    "Sprite": "gen4/Socialite_35_.png",
    "Greeting": "I’m feeling cranky today! Help me get my mind off it!",
    "Win": "Whew... A battle is the perfect stress reliever!",
    "Loss": "Eeeeeeeeh! You’ve pushed me over to furious!"
  },
  {
    "Class": "Socialite",
    "Name": "Janice",
    "Sprite": "gen4/Socialite_35_.png",
    "Greeting": "Cue battle music, please! I want to trumpet my victory!",
    "Win": "I love the battle music. It sets my heart racing.",
    "Loss": "Fine, that will do. Back to the regular theme music."
  },
  {
    "Class": "Psychic",
    "Name": "Denver",
    "Sprite": "gen4/Psychic_49_.png",
    "Greeting": "When you’ve been a Trainer as long as I have, let’s just say you’ll see a lot.",
    "Win": "Things like this happen. Don’t let it get you down.",
    "Loss": "People and Pokémon are all different. Isn’t that what makes it beautiful?"
  },
  {
    "Class": "Psychic",
    "Name": "Berkley",
    "Sprite": "gen4/Psychic_49_.png",
    "Greeting": "My big brother told me to go for the eyes! Aim for the eyes!",
    "Win": "I did it, big brother!",
    "Loss": "My big brother told me to wreck the other Trainer’s accuracy!"
  },
  {
    "Class": "Psychic",
    "Name": "Irene",
    "Sprite": "gen4/Psychic_50_.png",
    "Greeting": "I hear my Pokémon calling out... They clamor to battle...",
    "Win": "I hear my Pokémon calling out... They call for your return...",
    "Loss": "I hear my Pokémon calling out... They tell me of the fun they had..."
  },
  {
    "Class": "Psychic",
    "Name": "Sylvie",
    "Sprite": "gen4/Psychic_50_.png",
    "Greeting": "Behind you, I see light. What is its significance?",
    "Win": "I thought I saw an aura of invincibility. I must have been mistaken.",
    "Loss": "Now I see... You glow with the light of victory..."
  },
  {
    "Class": "Waiter",
    "Name": "Xander",
    "Sprite": "gen4/Waiter_81_.png",
    "Greeting": "I’ll deliver defeat to you elegantly and speedily.",
    "Win": "Thank you for your patience!",
    "Loss": "I’m so terribly sorry. I ended up with your intended defeat."
  },
  {
    "Class": "Waiter",
    "Name": "Warren",
    "Sprite": "gen4/Waiter_81_.png",
    "Greeting": "Great, another tough-looking Trainer. The fun never ends for me.",
    "Win": "Bleah, that was too close for comfort. Nothing ever comes easy for me.",
    "Loss": "Yeah, see? I knew I’d lose. If only that move landed..."
  },
  {
    "Class": "Waitress",
    "Name": "Leslie",
    "Sprite": "gen4/Waitress_26_.png",
    "Greeting": "Everyone has too much to say about Pokémon! If it’s fun, that’s enough!",
    "Win": "Excuse me, but are you all right? Maybe you’re a little too tired?",
    "Loss": "If you get too caught up in winning and losing, you’ll burn yourself out."
  },
  {
    "Class": "Waitress",
    "Name": "Kathy",
    "Sprite": "gen4/Waitress_26_.png",
    "Greeting": "Aren’t you the cutest guest! You can expect the best service from me!",
    "Win": "Well, were you impressed by the level of service I provided?",
    "Loss": "Oh, wait, please! I’m not done serving you!"
  },
  {
    "Class": "Cameraman",
    "Name": "Darren",
    "Sprite": "gen4/Cameraman_83_.png",
    "Greeting": "I keep a journal about the lives of the Trainers who arrive here.",
    "Win": "In our vast world, I wonder how many Trainers will cross my path?",
    "Loss": "Every encounter ends in parting. That’s why I keep a journal."
  },
  {
    "Class": "Cameraman",
    "Name": "Skip",
    "Sprite": "gen4/Cameraman_83_.png",
    "Greeting": "I’ve waited all my life for someone like you. I’m never letting you go.",
    "Win": "It was a ploy to confuse you with words out of some romance movie.",
    "Loss": "Now, go on, don’t let me hold you back. Seize your chance at happiness!"
  },
  {
    "Class": "Reporter",
    "Name": "Katie",
    "Sprite": "gen4/Reporter_84_.png",
    "Greeting": "Will you give me an interview if you win?",
    "Win": "You made my job too easy. You need to buckle down.",
    "Loss": "Your feelings now, in a word! Shout it into the mike, please!"
  },
  {
    "Class": "Reporter",
    "Name": "Elaine",
    "Sprite": "gen4/Reporter_84_.png",
    "Greeting": "I’m on a diet... I’m so famished...",
    "Win": "I’m happy, but if I get excited, I’ll get hungry. No thanks...",
    "Loss": "Oh... Your Pokémon look delicious..."
  },
  {
    "Class": "Cyclist",
    "Name": "Clive",
    "Sprite": "gen4/Cyclist_13_.png",
    "Greeting": "Let me make it clear right now, I’m tougher than you can stand!",
    "Win": "See? I wasn’t exaggerating!",
    "Loss": "Who are you exactly?!"
  },
  {
    "Class": "Cyclist",
    "Name": "Ward",
    "Sprite": "gen4/Cyclist_13_.png",
    "Greeting": "Clear the way! Out of the way! Wait! Don’t go! We have to battle!",
    "Win": "Come on, take it up a gear! Keep up with me!",
    "Loss": "OK, out of the way! Clear the way! Let this loser run away!"
  },
  {
    "Class": "Cyclist",
    "Name": "Hilda",
    "Sprite": "gen4/Cyclist_12_.png",
    "Greeting": "Safe driving and safer battling. That’s my motto.",
    "Win": "You can be patient in a battle. Victory will come eventually.",
    "Loss": "I’ll keep to my own pace. I’ll catch up to you one day."
  },
  {
    "Class": "Cyclist",
    "Name": "Vanita",
    "Sprite": "gen4/Cyclist_12_.png",
    "Greeting": "I only have this Bike to look good for the guys. I can’t actually ride.",
    "Win": "It was a pain getting this Bike here. I had to push it all the way!",
    "Loss": "I’m only concerned about looking good. I don’t practice enough."
  },
  {
    "Class": "PI",
    "Name": "Ralph",
    "Sprite": "gen4/PI_51_.png",
    "Greeting": "I’m not looking for any excitement. I don’t need any drama.",
    "Win": "A battle is all the excitement I need.",
    "Loss": "I recently realized that I’m not cut out for this scary job."
  },
  {
    "Class": "PI",
    "Name": "Conway",
    "Sprite": "gen4/PI_51_.png",
    "Greeting": "I’ll battle my way. You battle yours.",
    "Win": "People are people. I’ll go my own way.",
    "Loss": "People are people. You go your own way."
  },
  {
    "Class": "Idol",
    "Name": "Kristi",
    "Sprite": "gen4/Idol_85_.png",
    "Greeting": "Today, I have a special treat for all my fans!",
    "Win": "Thank you! I love your support!",
    "Loss": "Are you really one of my fans?"
  },
  {
    "Class": "Idol",
    "Name": "Trista",
    "Sprite": "gen4/Idol_85_.png",
    "Greeting": "I’m burnt out on being an Idol. I want to go home to the country...",
    "Win": "I can’t quit now! Kids dream of being me!",
    "Loss": "I miss hearing my mother’s voice..."
  },
  {
    "Class": "Jogger",
    "Name": "Austin",
    "Sprite": "gen4/Jogger_19_.png",
    "Greeting": "I’m one of a kind. That’s what I’m saying.",
    "Win": "I keep it real. That’s what makes me tough.",
    "Loss": "I kept it real, but you won anyway. Your reality was more real."
  },
  {
    "Class": "Jogger",
    "Name": "Dimitri",
    "Sprite": "gen4/Jogger_19_.png",
    "Greeting": "Hi! Are you my next opponent? Let’s keep it clean and fair!",
    "Win": "It feels great going all out with no dirty tricks.",
    "Loss": "That was an awesome workout! We have to do this again sometime!"
  },
  {
    "Class": "Fisherman",
    "Name": "Delaney",
    "Sprite": "gen4/Fisherman_11_.png",
    "Greeting": "My needs are simple. Fishing and Moomoo Milk are all I need.",
    "Win": "Winning or losing isn’t something I pay heed to.",
    "Loss": "I could use some Moomoo Milk right about now."
  },
  {
    "Class": "Fisherman",
    "Name": "Keaton",
    "Sprite": "gen4/Fisherman_11_.png",
    "Greeting": "You there! Take a look at the Pokémon I fished up the other day.",
    "Win": "I can tell you’re impressed. This guy, I don’t know how long it took to land.",
    "Loss": "A word of advice: when an older person is bragging, pretend to be interested."
  },
  {
    "Class": "Sailor",
    "Name": "Carlo",
    "Sprite": "gen4/Sailor_46_.png",
    "Greeting": "You’re a Trainer. Let your Pokémon do the talking.",
    "Win": "Where’s your spirit? That didn’t speak to me at all.",
    "Loss": "Great! Great! Your feelings came across!"
  },
  {
    "Class": "Sailor",
    "Name": "Horatio",
    "Sprite": "gen4/Sailor_46_.png",
    "Greeting": "Here comes your prey! Get ’em! Chaaaarge!",
    "Win": "Gaahahaha! That’s it! Good job!",
    "Loss": "We’re outmatched! Pull back, guys! Run away!"
  },
  {
    "Class": "Hiker",
    "Name": "Lyle",
    "Sprite": "gen4/Hiker_9_.png",
    "Greeting": "Bring it on! Ooooh! Haaah!",
    "Win": "Thank you kindly!",
    "Loss": "Thanks for having me!"
  },
  {
    "Class": "Hiker",
    "Name": "Glen",
    "Sprite": "gen4/Hiker_9_.png",
    "Greeting": "I am captivated by the mountains. They’re the main thing in my life!",
    "Win": "The mountains mean more to me than any battle, no matter how fun!",
    "Loss": "Your battle skills are impressive, but I can’t wait to return to the mountains."
  },
  {
    "Class": "Ruin Maniac",
    "Name": "Isadore",
    "Sprite": "gen4/Ruin Maniac_48_.png",
    "Greeting": "We’re going to hammer you, kid. Don’t freeze up and close your eyes.",
    "Win": "I like how you stay defiant even after losing. Good attitude, kid.",
    "Loss": "Honest, I didn’t let up one bit or let down my guard because you’re a kid."
  },
  {
    "Class": "Ruin Maniac",
    "Name": "Walton",
    "Sprite": "gen4/Ruin Maniac_48_.png",
    "Greeting": "I battle around the globe. I’m a worldwide bad boy!",
    "Win": "I don’t lose at battling. I can’t get over how cool I am!",
    "Loss": "I’m hitting the road over that loss. It’s good-bye to the old me!"
  },
  {
    "Class": "Guitarist",
    "Name": "Roget",
    "Sprite": "gen4/Guitarist_52_.png",
    "Greeting": "Battles, I’m good at. But musical aptitude? Forget it.",
    "Win": "This whole battling thing is good, but I wish I could play music as well.",
    "Loss": "Music or Pokémon... It’s a tough choice."
  },
  {
    "Class": "Guitarist",
    "Name": "Iggy",
    "Sprite": "gen4/Guitarist_52_.png",
    "Greeting": "I wrote a song using the cries of Pokémon. I’d like you to hear it.",
    "Win": "Graaah wagyaaah! Wagyaaaah! Chu! Chu! Gyaroooh-gah!",
    "Loss": "Giiyaaaah! Drundundun! Garoo-gah! Wawawaaah!"
  },
  {
    "Class": "Collector",
    "Name": "Leroy",
    "Sprite": "gen4/Collector_37_.png",
    "Greeting": "I’m bored of collecting and hoarding. I’m getting rid of everything now.",
    "Win": "There’s nothing that I really want now. Maybe I’ll become a clown...",
    "Loss": "I threw the match for a start. It’s nice to be unburdened of things."
  },
  {
    "Class": "Collector",
    "Name": "Newman",
    "Sprite": "gen4/Collector_37_.png",
    "Greeting": "Oh! Hold on a second! Incoming text message!",
    "Win": "Ticka-ticka-ticka... Ticka-tick... Huh? Is it over already?",
    "Loss": "Hey, stop that! No peeking at my text messages!"
  },
  {
    "Class": "Roughneck",
    "Name": "Ross",
    "Sprite": "gen4/Roughneck_57_.png",
    "Greeting": "There’s no meaning to this battle! Pokémon should be about love!",
    "Win": "Battling leaves me empty. Hug your Pokémon and show your love!",
    "Loss": "Battling creates nothing. Hug your Pokémon and show your love!"
  },
  {
    "Class": "Roughneck",
    "Name": "Ron",
    "Sprite": "gen4/Roughneck_57_.png",
    "Greeting": "Are you challenging me? ...You are. Kids these days...",
    "Win": "Now run along home, and go help your mommy with her chores!",
    "Loss": "Hey, you... If you think playtime will last forever, you’ll end up like me."
  },
  {
    "Class": "Scientist",
    "Name": "Irwin",
    "Sprite": "gen4/Scientist_113_.png",
    "Greeting": "How will you counter my implacable logic?",
    "Win": "Everything according to calculation... This victory is a complete one.",
    "Loss": "You outcalculated me. I’m incredulous."
  },
  {
    "Class": "Scientist",
    "Name": "Flynn",
    "Sprite": "gen4/Scientist_113_.png",
    "Greeting": "I’ve been ensconced in the lab. My shoulders are all knotted up.",
    "Win": "What a refreshing break! I’m feeling loose and relaxed now.",
    "Loss": "My Pokémon and I, we all need to get outside and exercise more."
  },
  {
    "Class": "Gentleman",
    "Name": "Joachim",
    "Sprite": "gen4/Gentleman_34_.png",
    "Greeting": "Hmmm... So young... I may have to go easy...",
    "Win": "You’re so depressingly young... It’s fine. You may go.",
    "Loss": "Consider the loser’s feelings. That’s where you young people fail..."
  },
  {
    "Class": "Gentleman",
    "Name": "Karston",
    "Sprite": "gen4/Gentleman_34_.png",
    "Greeting": "You see an old man, yes? Don’t be fooled by the way I look.",
    "Win": "I find it abhorrent to lose to any young Trainer.",
    "Loss": "I was fooled by your youth. Foolish, foolish me..."
  },
  {
    "Class": "Worker",
    "Name": "Boyce",
    "Sprite": "gen4/Worker_59_.png",
    "Greeting": "As a Worker, it’s my job to both build and demolish.",
    "Win": "Why don’t you become a Worker, too? I find it fun and rewarding.",
    "Loss": "Making things is harder than demolishing, but it’s more satisfying."
  },
  {
    "Class": "Worker",
    "Name": "Tyrell",
    "Sprite": "gen4/Worker_59_.png",
    "Greeting": "You and your Pokémon, I’ll clean up on you easily.",
    "Win": "Well, well, how pathetic was that. Take your passengers and go home.",
    "Loss": "Gwaah... So heavy... My guys buckled under the load."
  },
  {
    "Class": "Clown",
    "Name": "Frank",
    "Sprite": "gen4/Clown_58_.png",
    "Greeting": "Outstanding athleticism and a great sense of humor; that’s a clown!",
    "Win": "A clown is a job of greatness. Only the chosen can become one!",
    "Loss": "The ability to laugh off disappointment is another requirement for a clown!"
  },
  {
    "Class": "Clown",
    "Name": "Enzo",
    "Sprite": "gen4/Clown_58_.png",
    "Greeting": "Laugh with the face and cry with the heart; that’s how a clown lives.",
    "Win": "Ahahahahaha!",
    "Loss": "Gah! ...Ahahahaha!"
  },
  {
    "Class": "Policeman",
    "Name": "Hugh",
    "Sprite": "gen4/Policeman_38_.png",
    "Greeting": "Oi, listen! I’m a Policeman, sure, but a Trainer before that!",
    "Win": "What? A Policeman can’t lose his temper?",
    "Loss": "Yes, I’m a Policeman, but I have dreams and aspirations, and, and... Snivel..."
  },
  {
    "Class": "Policeman",
    "Name": "Kegan",
    "Sprite": "gen4/Policeman_38_.png",
    "Greeting": "Hands up! Put ’em where I can see ’em! You’re all under arrest!",
    "Win": "Case closed!",
    "Loss": "This is a gross miscarriage of justice!"
  },
  {
    "Class": "PI",
    "Name": "Chester",
    "Sprite": "gen4/PI_51_.png",
    "Greeting": "I’ll have you know that I’m an Internet detective.",
    "Win": "My powers of observation and logic prevailed!",
    "Loss": "Think you’ve outsmarted me? Maybe this was just a sting operation!"
  },
  {
    "Class": "PI",
    "Name": "River",
    "Sprite": "gen4/PI_51_.png",
    "Greeting": "Wherever, whenever, and with whomever. That’s my motto!",
    "Win": "When, where, or whom... It doesn’t matter at all to me.",
    "Loss": "Hahaha! This is great! I want to keep this going!"
  },
  {
    "Class": "Bird Keeper",
    "Name": "Kira",
    "Sprite": "gen4/Bird Keeper_69_.png",
    "Greeting": "The loser has to pretend to be a STUNKY, OK?",
    "Win": "Giggle, you lose. I want to see your STUNKY impression!",
    "Loss": "OK, here’s my STUNKY impression! Three, two, one..."
  },
  {
    "Class": "Bird Keeper",
    "Name": "Eliza",
    "Sprite": "gen4/Bird Keeper_69_.png",
    "Greeting": "A good breeze has sprung up... This is good! I can win this!",
    "Win": "The tailwind put us over the top! ...As they say!",
    "Loss": "The headwind worked against us! ...As they say!"
  },
  {
    "Class": "Parasol Lady",
    "Name": "Angie",
    "Sprite": "gen4/Parasol Lady_80_.png",
    "Greeting": "Even though I always have my parasol up, I actually like sunny days.",
    "Win": "I hope it will be sunny tomorrow...",
    "Loss": "The heavy downpour in my heart... When will it ever stop...?"
  },
  {
    "Class": "Parasol Lady",
    "Name": "Sami",
    "Sprite": "gen4/Parasol Lady_80_.png",
    "Greeting": "My, you’re very eager to go. I’d better take the tension up a notch, too!",
    "Win": "I had a lot of fun with that match! Wouldn’t it be nice to see you again!",
    "Loss": "You’re so full of energy! Why, I feel energized, too!"
  },
  {
    "Class": "Beauty",
    "Name": "Nadia",
    "Sprite": "gen4/Beauty_36_.png",
    "Greeting": "How much longer do I have to wait for a Trainer that’s any good?",
    "Win": "I’m so bored by the weak competition. Maybe I’ll just retire.",
    "Loss": "Oh, hello, there. Now, you’re a little special."
  },
  {
    "Class": "Beauty",
    "Name": "Becky",
    "Sprite": "gen4/Beauty_36_.png",
    "Greeting": "My ladylike charms don’t mean a thing to a little kid...",
    "Win": "That was too close for comfort! It doesn’t pay to underestimate foes.",
    "Loss": "Battling fair and square doesn’t appeal to me. I’d rather win."
  },
  {
    "Class": "Aroma Lady",
    "Name": "Elisha",
    "Sprite": "gen4/Aroma Lady_7_.png",
    "Greeting": "Like everything else, people have likes and dislikes when it comes to scents.",
    "Win": "I love how Pokémon smell after a battle.",
    "Loss": "I feel a little thrill if I catch a whiff of intense effort postbattle."
  },
  {
    "Class": "Aroma Lady",
    "Name": "Ambre",
    "Sprite": "gen4/Aroma Lady_7_.png",
    "Greeting": "Sniff, sniff... Yes! Here it comes! Aroma power!",
    "Win": "With aroma power, I’m invincible!",
    "Loss": "Fizzle... I’m out of aroma power..."
  },
  {
    "Class": "Idol",
    "Name": "Cocoa",
    "Sprite": "gen4/Idol_85_.png",
    "Greeting": "Turn, step, turn, turn... I’ll practice my dance steps while battling!",
    "Win": "I dance with passion and precision. How can there be a weakness?",
    "Loss": "You’re throwing off my rhythm! My dance routine is ruined!"
  },
  {
    "Class": "Idol",
    "Name": "Nissa",
    "Sprite": "gen4/Idol_85_.png",
    "Greeting": "I’m always ready for the public eye. You can come at me at your own pace.",
    "Win": "That’s why people consider me the perfect Idol.",
    "Loss": "I didn’t know how bad it feels to lose. This is a first for me."
  },
  {
    "Class": "Youngster",
    "Name": "Brady",
    "Greeting": "I AM NEVER GOING TO LOSE!",
    "Win": "I AM STRONG AREN'T I?",
    "Loss": "WHAT? BUT HOW?",
    "Sprite": "gen3/youngster.png"
  },
  {
    "Class": "Youngster",
    "Name": "Conner",
    "Greeting": "LOSING DOESN'T BUG ME",
    "Win": "A WIN IS JUST AWESOME",
    "Loss": "DARN... LOSING DOES BUG ME",
    "Sprite": "gen3/youngster.png"
  },
  {
    "Class": "Youngster",
    "Name": "Bradley",
    "Greeting": "HEY THERE! YOU'RE MY OPPONENT TODAY",
    "Win": "HAHAHA! SEE YA LATER!",
    "Loss": "TOMORROW IS WHEN WE REALLY BATTLE",
    "Sprite": "gen3/youngster.png"
  },
  {
    "Class": "Lass",
    "Name": "Cybil",
    "Greeting": "YOU'RE REALLY NOT VERY SCARY AT ALL",
    "Win": "IT'S SAD TO SEE YOU STRUGGLE",
    "Loss": "THIS CAN'T BE HAPPENING TO ME!",
    "Sprite": "gen3/lass.png"
  },
  {
    "Class": "Lass",
    "Name": "Rodette",
    "Greeting": "OH THIS IS SO EXCITING!",
    "Win": "IT'S INCREDIBLE HOW STRONG I AM!",
    "Loss": "OH DEAR... I AM JUST NO GOOD",
    "Sprite": "gen3/lass.png"
  },
  {
    "Class": "Lass",
    "Name": "Peggy",
    "Greeting": "GET READY TO BE DESTROYED!",
    "Win": "HAHAHA!! I AM LOLLING!",
    "Loss": "I AM FEELING SAD THANKS TO YOU",
    "Sprite": "gen3/lass.png"
  },
  {
    "Class": "School Kid",
    "Name": "Keith",
    "Greeting": "I DON'T JUST STUDY YOU KNOW",
    "Win": "YOU DON'T STUDY ENOUGH...",
    "Loss": "I NEED TO STUDY MORE...",
    "Sprite": "gen3/school_kid_m.png"
  },
  {
    "Class": "School Kid",
    "Name": "Grayson",
    "Greeting": "A POKEMON BATTLE ISN'T CHILDS PLAY!",
    "Win": "YOU'RE DONE AREN'T YOU?",
    "Loss": "WE WERE LIKE TOYS TO YOU",
    "Sprite": "gen3/school_kid_m.png"
  },
  {
    "Class": "School Kid",
    "Name": "Glenn",
    "Greeting": "I WOULD BE COOL IF I WIN",
    "Win": "COOL! THAT'S WHAT I AM",
    "Loss": "I AM NOT GOING TO BE COOL",
    "Sprite": "gen3/school_kid_m.png"
  },
  {
    "Class": "School Kid",
    "Name": "Liliana",
    "Greeting": "I WON'T GIVE UP UNTIL I WIN",
    "Win": "THERE IS NO SURRENDER IN ME",
    "Loss": "THAT'S IT... I GIVE UP...",
    "Sprite": "gen3/school_kid_f.png"
  },
  {
    "Class": "School Kid",
    "Name": "Elise",
    "Greeting": "MY STRATEGY IS FROM MY FATHER",
    "Win": "I WIN! FATHER I'VE WON",
    "Loss": "FORGIVE ME FATHER FOR I'VE LOST",
    "Sprite": "gen3/school_kid_f.png"
  },
  {
    "Class": "School Kid",
    "Name": "Zoey",
    "Greeting": "PLEASE BATTLE LIKE YOU MEAN IT",
    "Win": "THANK YOU!! THANK YOU SO MUCH",
    "Loss": "WERE YOU REALLY BEING SERIOUS?",
    "Sprite": "gen3/school_kid_f.png"
  },
  {
    "Class": "Rich Boy",
    "Name": "Manuel",
    "Greeting": "ME LOSE? THAT'S PREPOSTEROUS!",
    "Win": "NATURALLY I WIN",
    "Loss": "WAAAH! I LOST MOTHER",
    "Sprite": "gen3/rich_boy.png"
  },
  {
    "Class": "Rich Boy",
    "Name": "Russ",
    "Greeting": "THEY ALL WANT MY FABULOUS POKEMON",
    "Win": "I WILL HAVE A POKEMON PARTY",
    "Loss": "HOW COULD YOU DO THAT?",
    "Sprite": "gen3/rich_boy.png"
  },
  {
    "Class": "Rich Boy",
    "Name": "Dustin",
    "Greeting": "I REALLY LIKE COOL POKEMON",
    "Win": "I LIKE MYSELF WHEN I WIN!",
    "Loss": "I LIKE MYSELF IF I LOSE TOO",
    "Sprite": "gen3/rich_boy.png"
  },
  {
    "Class": "Lady",
    "Name": "Tina",
    "Greeting": "IF I WIN YOU CAN HAVE A SWEET KISS",
    "Win": "HERE IT IS YOUR SWEET KISS FROM MY JYNX",
    "Loss": "YOU WANT A SWIFT MEGA KICK INSTEAD",
    "Sprite": "gen3/lady.png"
  },
  {
    "Class": "Lady",
    "Name": "Gillian",
    "Greeting": "THE GOURMET THING IS SO YESTERDAY",
    "Win": "POKEMON NEVER GO OUT OF FASHION",
    "Loss": "LOSING DOESN'T DISAPPOINT ME",
    "Sprite": "gen3/lady.png"
  },
  {
    "Class": "Lady",
    "Name": "Zoe",
    "Greeting": "I HAVEN'T A WORRY AT ALL",
    "Win": "LIFE IS ALWAYS GOOD TO ME",
    "Loss": "I WORRY ABOUT MY POKEMON SKILL",
    "Sprite": "gen3/lady.png"
  },
  {
    "Class": "Camper",
    "Name": "Chen",
    "Greeting": "I AM TOTALLY READY TO ROCK TODAY",
    "Win": "I AM READY TO GO ON!",
    "Loss": "I'VE LOST MY FOCUS ENERGY AND TOUGHNESS",
    "Sprite": "gen3/camper.png"
  },
  {
    "Class": "Camper",
    "Name": "Al",
    "Greeting": "YOUR LOOK SAYS YOU'RE REALLY TOUGH",
    "Win": "IT'S ME WHO IS REALLY TOUGH",
    "Loss": "I AM RIGHT! YOU'RE REALLY TOUGH",
    "Sprite": "gen3/camper.png"
  },
  {
    "Class": "Camper",
    "Name": "Mitch",
    "Greeting": "MOTHER NATURE IS MY ALLY!",
    "Win": "WAS THAT ENOUGH FOR YOU?",
    "Loss": "MOTHER NATURE DIDN'T LET ME WIN?",
    "Sprite": "gen3/camper.png"
  },
  {
    "Class": "Picnicker",
    "Name": "Anne",
    "Greeting": "I CAN'T WAIT LET'S BATTLE NOW",
    "Win": "MY HAPPINESS IS OVERWHELMING!",
    "Loss": "YOU'VE DESTROYED MY HAPPINESS...",
    "Sprite": "gen3/picnicker.png"
  },
  {
    "Class": "Picnicker",
    "Name": "Alize",
    "Greeting": "CUTE AND AWFULLY STRONG THAT'S ME",
    "Win": "YUP I AM CUTE AND AWFULLY STRONG",
    "Loss": "I AM WEAK... BUT I AM CUTE",
    "Sprite": "gen3/picnicker.png"
  },
  {
    "Class": "Picnicker",
    "Name": "Lauren",
    "Greeting": "I AM OLD BUT I AM ALSO GOOD",
    "Win": "I SAID I WAS OLD BUT GOOD",
    "Loss": "WHAT A WEIRD DREAM THAT WAS!",
    "Sprite": "gen3/picnicker.png"
  },
  {
    "Class": "Tuber",
    "Name": "Kipp",
    "Greeting": "IF I WIN I AM GOING TO GO SURF",
    "Win": "YEAH! I AM OFF TO SURF",
    "Loss": "OH NO! A WHIRLPOOL!",
    "Sprite": "gen3/tuber_m.png"
  },
  {
    "Class": "Tuber",
    "Name": "Jason",
    "Greeting": "TEACH ME A GOOD STRATEGY",
    "Win": "THAT WAS YOUR GOOD STRATEGY?!",
    "Loss": "WOW THAT IS AN AWESOME STRATEGY",
    "Sprite": "gen3/tuber_m.png"
  },
  {
    "Class": "Tuber",
    "Name": "John",
    "Greeting": "I AM A PRETTY NEW TRAINER",
    "Win": "I AM NEW BUT I WON!",
    "Loss": "I AM NEW SO WHAT IF I LOSE?",
    "Sprite": "gen3/tuber_m.png"
  },
  {
    "Class": "Tuber",
    "Name": "Ann",
    "Greeting": "IT'S SO EXCITING IT REALLY IS",
    "Win": "I AM SO HAPPY I CAN CRY",
    "Loss": "I AM SO SAD I WILL CRY",
    "Sprite": "gen3/tuber_f.png"
  },
  {
    "Class": "Tuber",
    "Name": "Eileen",
    "Greeting": "LET'S PRETEND I AM AN ADULT OK?",
    "Win": "SO THIS IS AN ADULT FEELING",
    "Loss": "AN ADULT CAN'T BEAT YOU?",
    "Sprite": "gen3/tuber_f.png"
  },
  {
    "Class": "Tuber",
    "Name": "Carlie",
    "Greeting": "MY SUMMER VACATION IS FOR POKEMON",
    "Win": "MY SUMMER VACATION WILL BE AWESOME",
    "Loss": "I CAN'T WIN LIKE THIS...",
    "Sprite": "gen3/tuber_f.png"
  },
  {
    "Class": "Swimmer",
    "Name": "Gordon",
    "Greeting": "VICTORY WILL COME TO ME!",
    "Win": "OH YEAH! I REALLY WON",
    "Loss": "NOTHING IS WORKING OUT FOR ME",
    "Sprite": "gen3/swimmer_m.png"
  },
  {
    "Class": "Swimmer",
    "Name": "Ayden",
    "Greeting": "COME ON I NEED A HOT BATTLE",
    "Win": "I NEED WATER TO COOL DOWN",
    "Loss": "YOU HAVE ME FEELING ICE COLD",
    "Sprite": "gen3/swimmer_m.png"
  },
  {
    "Class": "Swimmer",
    "Name": "Marco",
    "Greeting": "I SURF IN THE WINTER TOO",
    "Win": "I WILL GO SURF RIGHT NOW",
    "Loss": "I WILL BEAT UP MY SURF BOARD",
    "Sprite": "gen3/swimmer_m.png"
  },
  {
    "Class": "Swimmer",
    "Name": "Cierra",
    "Greeting": "I LIKE TO SYNCHRONIZE MY SWIFT SWIM",
    "Win": "MY POKEMON SYNCHRONIZE WITH ME",
    "Loss": "I NEED TO SYNCHRONIZE BETTER...",
    "Sprite": "gen3/swimmer_f.png"
  },
  {
    "Class": "Swimmer",
    "Name": "Marcy",
    "Greeting": "I AM A KNOCKOUT YOU CAN'T WIN!",
    "Win": "AFTER ALL I AM A KNOCKOUT!",
    "Loss": "THAT'S NOT THE KNOCKOUT I MEAN",
    "Sprite": "gen3/swimmer_f.png"
  },
  {
    "Class": "Swimmer",
    "Name": "Kathy",
    "Greeting": "I'VE WON EVERY MATCH TODAY!",
    "Win": "IT'S SO GREAT TO WIN!",
    "Loss": "HUH? I SHOULD NOT HAVE LOST",
    "Sprite": "gen3/swimmer_f.png"
  },
  {
    "Class": "Pokefan",
    "Name": "Peyton",
    "Greeting": "I AM NEVER DISAPPOINTED WITH MY POKEMON",
    "Win": "I AM HAPPY IF WE WIN TOGETHER",
    "Loss": "I ADORE MY POKEMON MORE IF I LOSE",
    "Sprite": "gen3/pokefan_m.png"
  },
  {
    "Class": "Pokefan",
    "Name": "Julian",
    "Greeting": "YOU ADORE YOUR POKEMON RIGHT?",
    "Win": "YOU'RE TOTALLY OUT OF THE QUESTION",
    "Loss": "YOU DO ADORE YOUR POKEMON!",
    "Sprite": "gen3/pokefan_m.png"
  },
  {
    "Class": "Pokefan",
    "Name": "Quinn",
    "Greeting": "MY POKEMON ARE BUT A DREAM",
    "Win": "THIS IS A BEAUTIFUL DREAM!",
    "Loss": "THIS IS AN AWFUL NIGHTMARE!",
    "Sprite": "gen3/pokefan_m.png"
  },
  {
    "Class": "Pokefan",
    "Name": "Haylee",
    "Greeting": "I DON'T KNOW HOW I AM FEELING",
    "Win": "I AM FEELING OVERWHELMING JOY OVER THIS",
    "Loss": "DESTROYED IS THE WAY I AM FEELING",
    "Sprite": "gen3/pokefan_f.png"
  },
  {
    "Class": "Pokefan",
    "Name": "Amanda",
    "Greeting": "I COME FROM A TRAINER FAMILY",
    "Win": "I WILL TREASURE THIS WIN",
    "Loss": "I WANT TO GO HOME RIGHT NOW",
    "Sprite": "gen3/pokefan_f.png"
  },
  {
    "Class": "Pokefan",
    "Name": "Stacy",
    "Greeting": "ALL POKEMON HAVE THEIR OWN CUTE CHARM",
    "Win": "YOU SEE WHAT I MEAN?",
    "Loss": "SHOULD I NOT ADORE POKEMON?",
    "Sprite": "gen3/pokefan_f.png"
  },
  {
    "Class": "Pokémon Breeder",
    "Name": "Rafael",
    "Greeting": "COME ON! LET'S SEE SOME SPIRIT",
    "Win": "THAT'S IT! THAT'S THE SPIRIT!",
    "Loss": "WELL SO MUCH FOR OUR SPIRIT",
    "Sprite": "gen3/pkmn_breeder_m.png"
  },
  {
    "Class": "Pokémon Breeder",
    "Name": "Oliver",
    "Greeting": "A GENIUS THAT'S WHAT I AM!",
    "Win": "THAT'S HOW A GENIUS WORKS!",
    "Loss": "YOU'RE MORE A GENIUS THAN I AM",
    "Sprite": "gen3/pkmn_breeder_m.png"
  },
  {
    "Class": "Pokémon Breeder",
    "Name": "Payton",
    "Greeting": "I TRAIN FROM THE EGG UP",
    "Win": "WELL DONE!",
    "Loss": "THAT WAS A SOFT BOILED LOSS...",
    "Sprite": "gen3/pkmn_breeder_m.png"
  },
  {
    "Class": "Pokémon Breeder",
    "Name": "Pamela",
    "Greeting": "ALL POKEMON ADORE A KIND TRAINER",
    "Win": "IT'S TOO BAD YOU LOST",
    "Loss": "YOU'RE KIND AND YOU'RE ALSO STRONG",
    "Sprite": "gen3/pkmn_breeder_f.png"
  },
  {
    "Class": "Pokémon Breeder",
    "Name": "Eliza",
    "Greeting": "I ADORE POKEMON LIKE MY CHILDREN",
    "Win": "I AM SO HAPPY FOR MY POKEMON",
    "Loss": "OH DEAR I AM SO SORRY ABOUT THIS",
    "Sprite": "gen3/pkmn_breeder_f.png"
  },
  {
    "Class": "Pokémon Breeder",
    "Name": "Marisa",
    "Greeting": "I PROMISE TO BATTLE SERIOUSLY",
    "Win": "PROMISE ME YOU WILL DO BETTER",
    "Loss": "PROMISE ME ANOTHER BATTLE PLEASE!",
    "Sprite": "gen3/pkmn_breeder_f.png"
  },
  {
    "Class": "Bug Catcher",
    "Name": "Lewis",
    "Greeting": "A LITTLE BUG IS SCARY? HAHAHA",
    "Win": "LOOK LOOK! A SCARY BUG",
    "Loss": "OH A BUG ISN'T SCARY...",
    "Sprite": "gen3/bug_catcher.png"
  },
  {
    "Class": "Bug Catcher",
    "Name": "Yoshi",
    "Greeting": "BUG POKEMON MAKE ME FEELING LOVEY DOVEY",
    "Win": "BUG POKEMON ARE THE BEST!",
    "Loss": "YOU'RE IGNORANT ABOUT BUG POKEMON",
    "Sprite": "gen3/bug_catcher.png"
  },
  {
    "Class": "Bug Catcher",
    "Name": "Destin",
    "Greeting": "IT'S WAY TOO HOT HERE",
    "Win": "I AM ABOUT TO OVERHEAT",
    "Loss": "PLEASE I NEED SOME WATER",
    "Sprite": "gen3/bug_catcher.png"
  },
  {
    "Class": "Ninja Boy",
    "Name": "Keon",
    "Greeting": "FORGIVE ME BUT HERE I COME!",
    "Win": "FORGIVE ME FOR MY OVERWHELMING POWER",
    "Loss": "I AM SORRY...",
    "Sprite": "gen3/ninja_boy.png"
  },
  {
    "Class": "Ninja Boy",
    "Name": "Stuart",
    "Greeting": "I PROMISE YOU A HOT BATTLE",
    "Win": "THE MASTER OF COOL THAT'S ME",
    "Loss": "I SEE I AM NOT SO COOL",
    "Sprite": "gen3/ninja_boy.png"
  },
  {
    "Class": "Ninja Boy",
    "Name": "Nestor",
    "Greeting": "SHOW ME A REALLY SMOOTH MOVE",
    "Win": "THERE WAS NOTHING SMOOTH ABOUT THAT",
    "Loss": "YOU REALLY ARE SMOOTH!",
    "Sprite": "gen3/ninja_boy.png"
  },
  {
    "Class": "Bug Maniac",
    "Name": "Derrick",
    "Greeting": "LET'S SEE YOU MEDITATE LIKE ME",
    "Win": "HOW I MEDITATE IS JUST BEAUTIFUL",
    "Loss": "I WILL MEDITATE FOR A CALM MIND",
    "Sprite": "gen3/bug_maniac.png"
  },
  {
    "Class": "Bug Maniac",
    "Name": "Bryson",
    "Greeting": "POISON POWDER IS IN OUR COTTON SPORE MOVE",
    "Win": "HOW DO YOU LIKE OUR POISON POWDER?",
    "Loss": "MY COTTON SPORE WAS USELESS",
    "Sprite": "gen3/bug_maniac.png"
  },
  {
    "Class": "Bug Maniac",
    "Name": "Clayton",
    "Greeting": "HUH? WHERE IS IT?",
    "Win": "WHERE IS IT? I'VE LOST MY POKENAV",
    "Loss": "WHERE IS IT? I'VE LOST MY SENSE",
    "Sprite": "gen3/bug_maniac.png"
  },
  {
    "Class": "Fisherman",
    "Name": "Trenton",
    "Greeting": "COME OVER FOR SOME TASTY WATER",
    "Win": "MMM DO YOU WANT SOME?",
    "Loss": "I GOT THIS TASTY WATER SHOPPING",
    "Sprite": "gen3/fisherman.png"
  },
  {
    "Class": "Fisherman",
    "Name": "Jenson",
    "Greeting": "MY POKEMON WILL MAKE YOU DOWNCAST",
    "Win": "YOUR POKEMON DON'T MAKE THE CUT",
    "Loss": "I AM THE TRAINER WHO IS FEELING DOWNCAST",
    "Sprite": "gen3/fisherman.png"
  },
  {
    "Class": "Fisherman",
    "Name": "Wesley",
    "Greeting": "MEW MEW IS HOW I CRY",
    "Win": "YES I KNOW I AM CUTE!",
    "Loss": "MEW MEW! MEW!!",
    "Sprite": "gen3/fisherman.png"
  },
  {
    "Class": "Ruin Maniac",
    "Name": "Anton",
    "Greeting": "GET READY FOR ME TO THRASH",
    "Win": "WAHAHAHA! SORRY ABOUT THAT!",
    "Loss": "IT'S A TOUGH LOSS TO SWALLOW",
    "Sprite": "gen3/ruin_maniac.png"
  },
  {
    "Class": "Ruin Maniac",
    "Name": "Lawson",
    "Greeting": "I AM YOUNG AT HEART!",
    "Win": "NOT COOL! NOT AT ALL",
    "Loss": "I AM OLD AND FEELING SHAKY...",
    "Sprite": "gen3/ruin_maniac.png"
  },
  {
    "Class": "Ruin Maniac",
    "Name": "Sammy",
    "Greeting": "MY PARTY IS READY TO ROCK",
    "Win": "MY PARTY IS JUST INCREDIBLE!",
    "Loss": "I CRY FOR MY PARTY...",
    "Sprite": "gen3/ruin_maniac.png"
  },
  {
    "Class": "Collector",
    "Name": "Arnie",
    "Greeting": "I AM NO  I HAVE NO RIVAL",
    "Win": "YOU SEE? I CAN'T LOSE",
    "Loss": "NO! I WON'T ACCEPT THIS",
    "Sprite": "gen3/collector.png"
  },
  {
    "Class": "Collector",
    "Name": "Adrian",
    "Greeting": "YAHOO! YAHOO!!",
    "Win": "THANK YOU! THANK YOU!!",
    "Loss": "GOOD BYE! GOOD BYE!!",
    "Sprite": "gen3/collector.png"
  },
  {
    "Class": "Collector",
    "Name": "Tristan",
    "Greeting": "CONFUSED? I AM A GENIUS",
    "Win": "SEE? I AM A GENIUS",
    "Loss": "I AM NOT A GENIUS IN BATTLE",
    "Sprite": "gen3/collector.png"
  },
  {
    "Class": "Parasol Lady",
    "Name": "Juliana",
    "Greeting": "I THINK I AM SHOPPING TOO MUCH",
    "Win": "BUT I WANT A POKEMON PLUSH DOLL",
    "Loss": "I SO WANT ANOTHER POKEMON PLUSH DOLL",
    "Sprite": "gen3/parasol_lady.png"
  },
  {
    "Class": "Parasol Lady",
    "Name": "Rylee",
    "Greeting": "SHOW ME THAT YOU HAVE GUTS",
    "Win": "BYE BYE! YOU HAVE NO GUTS",
    "Loss": "THAT WAS GUTSY... YOU'RE QUITE SUPER",
    "Sprite": "gen3/parasol_lady.png"
  },
  {
    "Class": "Parasol Lady",
    "Name": "Chelsea",
    "Greeting": "I SERIOUSLY MEAN TO WIN!",
    "Win": "THAT WAS MY WILL TO WIN",
    "Loss": "YOU'RE FAR TOO STRONG FOR ME",
    "Sprite": "gen3/parasol_lady.png"
  },
  {
    "Class": "Beauty",
    "Name": "Danela",
    "Greeting": "YOU MUST BE MY OPPONENT NOW!",
    "Win": "OH DEAR TOO WEAK! DON'T GIVE UP!",
    "Loss": "THAT WAS GOOD AND THIS IS GOOD BYE",
    "Sprite": "gen3/beauty.png"
  },
  {
    "Class": "Beauty",
    "Name": "Lizbeth",
    "Greeting": "IF I LOSE YOU CAN HAVE A PRESENT",
    "Win": "HERE IT IS A LITTLE PRAISE AS YOUR PRESENT",
    "Loss": "YOUR PRESENT?! HERE IT IS A DOUBLE SLAP",
    "Sprite": "gen3/beauty.png"
  },
  {
    "Class": "Beauty",
    "Name": "Amelia",
    "Greeting": "I BELIEVE IN CUTE FASHION APPEAL",
    "Win": "YOUR FASHION SENSE IS A DISASTER",
    "Loss": "THAT WAS AWFUL! I AM GOING HOME",
    "Sprite": "gen3/beauty.png"
  },
  {
    "Class": "Aroma Lady",
    "Name": "Jillian",
    "Greeting": "WHAT IS THAT I SMELL?",
    "Win": "IT'S THE SWEET SCENT OF TASTY WATER",
    "Loss": "IT'S YOUR OFFENSIVE STENCH THAT'S WHAT",
    "Sprite": "gen3/aroma_lady.png"
  },
  {
    "Class": "Aroma Lady",
    "Name": "Abbie",
    "Greeting": "YOU TRY MY SECRET AROMATHERAPY OK?",
    "Win": "MY AROMATHERAPY IS TERRIBLE FOR YOU",
    "Loss": "DIDN'T YOU SMELL A THING?!",
    "Sprite": "gen3/aroma_lady.png"
  },
  {
    "Class": "Aroma Lady",
    "Name": "Briana",
    "Greeting": "MY BOY FRIEND WORKS TOO MUCH",
    "Win": "I ONLY MISS HIM MORE...",
    "Loss": "I AM SO LONESOME WITHOUT HIM...",
    "Sprite": "gen3/aroma_lady.png"
  },
  {
    "Class": "Guitarist",
    "Name": "Antonio",
    "Greeting": "I KNOW HOW TO GO GO",
    "Win": "BUT I DON'T LIKE TO DANCE",
    "Loss": "GO GO... JUST FLAIL ABOUT",
    "Sprite": "gen3/guitarist.png"
  },
  {
    "Class": "Guitarist",
    "Name": "Jaden",
    "Greeting": "HELLO I THINK I ADORE YOU",
    "Win": "YOU MAKE ME THRASH IN FRUSTRATION",
    "Loss": "THIS IS IT! GOOD BYE FOREVER!",
    "Sprite": "gen3/guitarist.png"
  },
  {
    "Class": "Guitarist",
    "Name": "Dakota",
    "Greeting": "YOU HAVE TO DANCE WITH POWER",
    "Win": "GOT IT? DANCE WITH POWER",
    "Loss": "OKAY YOU UNDERSTAND ALL RIGHT!",
    "Sprite": "gen3/guitarist.png"
  },
  {
    "Class": "Bird Keeper",
    "Name": "Brayden",
    "Greeting": "COLOR CHANGE VERSION TOYS ARE USELESS!",
    "Win": "I ONLY COLLECT NORMAL VERSION TOYS",
    "Loss": "I ATTRACT COLOR CHANGE VERSION TOYS...",
    "Sprite": "gen3/bird_keeper.png"
  },
  {
    "Class": "Bird Keeper",
    "Name": "Corson",
    "Greeting": "I GET TO BEAT UP ON YOU",
    "Win": "TOO EASY! I AM SO COOL",
    "Loss": "WHY?! I CURSE YOU",
    "Sprite": "gen3/bird_keeper.png"
  },
  {
    "Class": "Bird Keeper",
    "Name": "Trevin",
    "Greeting": "THERE IS NONE BETTER THAN ME",
    "Win": "YES SIR! I AM THE BEST",
    "Loss": "SERIOUS?!",
    "Sprite": "gen3/bird_keeper.png"
  },
  {
    "Class": "Sailor",
    "Name": "Patrick",
    "Greeting": "I AM PERFECT! GIVE UP NOW",
    "Win": "DON'T BE DISAPPOINTED I AM PERFECT",
    "Loss": "BUT HOW? I AM PERFECT...",
    "Sprite": "gen3/sailor.png"
  },
  {
    "Class": "Sailor",
    "Name": "Kaden",
    "Greeting": "WHAT ARE YOU UP TO?",
    "Win": "YOU WERE A SURPRISE TO ME!",
    "Loss": "I DON'T KNOW WHO I AM...",
    "Sprite": "gen3/sailor.png"
  },
  {
    "Class": "Sailor",
    "Name": "Maxwell",
    "Greeting": "HEY THERE WHO IS YOUR RIVAL?",
    "Win": "MY RIVAL IS MY GIRL FRIEND",
    "Loss": "I AM MAKING YOU MY RIVAL",
    "Sprite": "gen3/sailor.png"
  },
  {
    "Class": "Hiker",
    "Name": "Daryl",
    "Greeting": "I ONLY KNOW HOW TO CHARGE",
    "Win": "AM I OVERWHELMING OR WHAT?",
    "Loss": "YOU'RE GOING TO A LEGEND!",
    "Sprite": "gen3/hiker.png"
  },
  {
    "Class": "Hiker",
    "Name": "Kenneth",
    "Greeting": "YOU BETTER NOT SLACK OFF WITH ME",
    "Win": "DID MY TAUNT INTIMIDATE YOU?",
    "Loss": "I AM SORRY...",
    "Sprite": "gen3/hiker.png"
  },
  {
    "Class": "Hiker",
    "Name": "Rich",
    "Greeting": "YOUR FACADE DOESN'T TRICK ME",
    "Win": "SERIOUSLY ARE YOU REALLY OK?",
    "Loss": "THAT WAS REALLY TOUGH ON ME",
    "Sprite": "gen3/hiker.png"
  },
  {
    "Class": "Kindler",
    "Name": "Caden",
    "Greeting": "I CAN'T BE DEFEATED!",
    "Win": "FIRE! FIRE!!",
    "Loss": "I AM TIRED... IT'S SO HOT",
    "Sprite": "gen3/kindler.png"
  },
  {
    "Class": "Kindler",
    "Name": "Marlon",
    "Greeting": "A POKEDEX IS A LITTLE RADIO?",
    "Win": "A LITTLE RADIO HUH? THAT'S TOTALLY COOL",
    "Loss": "IT'S NOT? IS POKENAV?",
    "Sprite": "gen3/kindler.png"
  },
  {
    "Class": "Kindler",
    "Name": "Nash",
    "Greeting": "I AM ON FIRE BABY!",
    "Win": "I LEFT YOU JUST AN EMBER",
    "Loss": "AIYEEH!! NO WATER PLEASE",
    "Sprite": "gen3/kindler.png"
  },
  {
    "Class": "Running Triathlete",
    "Name": "Robby",
    "Greeting": "HAHAHA! HAPPY TO MEET YOU!",
    "Win": "I AM THE LEADER WITH REFRESHING SERENE GRACE",
    "Loss": "I WILL THRASH MY TOYS!",
    "Sprite": "gen3/running_triathlete_m.png"
  },
  {
    "Class": "Running Triathlete",
    "Name": "Reece",
    "Greeting": "MY QUICK ATTACK CAN BEAT A TELEPORT",
    "Win": "LIKE I SAID I AM DARN FAST",
    "Loss": "I WAS KIDDING ABOUT THAT TELEPORT THING",
    "Sprite": "gen3/running_triathlete_m.png"
  },
  {
    "Class": "Running Triathlete",
    "Name": "Kathryn",
    "Greeting": "I DON'T TRAIN GOOD ENOUGH?",
    "Win": "DON'T TAUNT ME LIKE THAT OK?",
    "Loss": "WHY COULDN'T I WIN THIS?",
    "Sprite": "gen3/running_triathlete_f.png"
  },
  {
    "Class": "Running Triathlete",
    "Name": "Ellen",
    "Greeting": "CRUSH YOU LIKE AN EGG!",
    "Win": "THAT WAS A TASTY VICTORY FOR ME",
    "Loss": "TOO TOUGH TO CRUSH!",
    "Sprite": "gen3/running_triathlete_f.png"
  },
  {
    "Class": "Swimming Triathlete",
    "Name": "Ramon",
    "Greeting": "OKAY! THIS IS PERFECTION",
    "Win": "I AM HAPPY THAT I WON!",
    "Loss": "IT'S A SECRET WHY I AM HAPPY",
    "Sprite": "gen3/swimming_triathlete_m.png"
  },
  {
    "Class": "Swimming Triathlete",
    "Name": "Arthur",
    "Greeting": "HERE I COME FEELING READY FOR IT ALL",
    "Win": "THAT'S IT! THAT WAS FABULOUS!",
    "Loss": "THAT WAS NOT WHAT I NEED",
    "Sprite": "gen3/swimming_triathlete_m.png"
  },
  {
    "Class": "Swimming Triathlete",
    "Name": "Alondra",
    "Greeting": "EVERY DAY IS A GREAT DAY",
    "Win": "MY DIVE WILL BE A LEGEND",
    "Loss": "MY DIVE LEFT ME COLD...",
    "Sprite": "gen3/swimming_triathlete_f.png"
  },
  {
    "Class": "Swimming Triathlete",
    "Name": "Adriana",
    "Greeting": "COME SEE AN INCREDIBLE SWIFT SWIM!",
    "Win": "I MAKE IT LOOK SO EASY",
    "Loss": "I AM FEELING BEAT UP AND TIRED",
    "Sprite": "gen3/swimming_triathlete_f.png"
  },
  {
    "Class": "Cycling Triathlete",
    "Name": "Malik",
    "Greeting": "OH NOT ANOTHER BATTLE PLEASE...",
    "Win": "I FINALLY WON... I AM TIRED",
    "Loss": "I FINALLY LOST... I AM TIRED",
    "Sprite": "gen3/cycling_triathlete_m.png"
  },
  {
    "Class": "Cycling Triathlete",
    "Name": "Jill",
    "Greeting": "I AM THE QUICK ATTACK TRAINER!",
    "Win": "THE QUICK ATTACK TRAINER WINS!",
    "Loss": "THE QUICK ATTACK TRAINER GIVES UP!",
    "Sprite": "gen3/cycling_triathlete_f.png"
  },
  {
    "Class": "Running Triathlete",
    "Name": "Erik",
    "Greeting": "I AM THE SPEED BOOST HERO!",
    "Win": "THANK YOU FROM THE SPEED BOOST HERO!",
    "Loss": "WAAAH!! NO NO!!",
    "Sprite": "gen3/running_triathlete_m.png"
  },
  {
    "Class": "Running Triathlete",
    "Name": "Yazmin",
    "Greeting": "I WOULD RATHER RUN THAN BIKE",
    "Win": "YES I WOULD MUCH RATHER RUN",
    "Loss": "BYE BYE! I AM GOING TO RUN AWAY",
    "Sprite": "gen3/running_triathlete_f.png"
  },
  {
    "Class": "Swimming Triathlete",
    "Name": "Jamal",
    "Greeting": "I AM GOING TO BE A FATHER",
    "Win": "I CAN'T WAIT FOR MY BABY",
    "Loss": "MY BABY WILL BE TOTALLY AWESOME",
    "Sprite": "gen3/swimming_triathlete_m.png"
  },
  {
    "Class": "Swimming Triathlete",
    "Name": "Leslie",
    "Greeting": "I AM GOING TO BE A MOTHER",
    "Win": "A BABY WILL BE A LITTLE CHALLENGE",
    "Loss": "I AM TOO HAPPY TO BE ANGRY",
    "Sprite": "gen3/swimming_triathlete_f.png"
  },
  {
    "Class": "Cycling Triathlete",
    "Name": "Dave",
    "Greeting": "WHAT SHOULD I DO TODAY?",
    "Win": "I SHOULD ENJOY SOME SPORTS!",
    "Loss": "I WILL GO PLAY A GAME",
    "Sprite": "gen3/cycling_triathlete_m.png"
  },
  {
    "Class": "Cycling Triathlete",
    "Name": "Carlo",
    "Greeting": "HAH!! YEAH!!",
    "Win": "I DO THINGS AT EXTREME SPEED!",
    "Loss": "I LOST AT EXTREME SPEED...",
    "Sprite": "gen3/cycling_triathlete_m.png"
  },
  {
    "Class": "Cycling Triathlete",
    "Name": "Emilia",
    "Greeting": "ME WORRY? I HAVE NONE",
    "Win": "AHAHA SEE? THAT WAS FANTASTIC!",
    "Loss": "AHAHA SEE? THAT WAS ENTERTAINING!",
    "Sprite": "gen3/cycling_triathlete_f.png"
  },
  {
    "Class": "Cycling Triathlete",
    "Name": "Dalia",
    "Greeting": "MY BIKE IS VERY EXPENSIVE",
    "Win": "DON'T COME NEAR MY BIKE!",
    "Loss": "MY BIKE IS MY BEST FRIEND",
    "Sprite": "gen3/cycling_triathlete_f.png"
  },
  {
    "Class": "Black Belt",
    "Name": "Hitomi",
    "Greeting": "YEAH!! HAH!!",
    "Win": "WHAT?! I WON?!",
    "Loss": "AIYEEH!! I AM SORRY!!",
    "Sprite": "gen3/black_belt.png"
  },
  {
    "Class": "Black Belt",
    "Name": "Ricardo",
    "Greeting": "COME ON! PLAY TIME IS OVER",
    "Win": "YOU'RE OUT OF HERE!",
    "Loss": "PLEASE DON'T HIT ME!",
    "Sprite": "gen3/black_belt.png"
  },
  {
    "Class": "Black Belt",
    "Name": "Shizuka",
    "Greeting": "SHOW ME THAT YOU'RE SERIOUS!",
    "Win": "I WON'T FORGET ABOUT YOU",
    "Loss": "YOU'RE PERFECT IN EVERY WAY!",
    "Sprite": "gen3/black_belt.png"
  },
  {
    "Class": "Battle Girl",
    "Name": "Joana",
    "Greeting": "YOU'RE GOING TO LOSE RIGHT AWAY",
    "Win": "I AM THE WINNER HEAR ME ROAR",
    "Loss": "I REFUSE TO ACCEPT THAT OUTRAGE",
    "Sprite": "gen3/battle_girl.png"
  },
  {
    "Class": "Battle Girl",
    "Name": "Kelly",
    "Greeting": "MY NIGHT SCHOOL IS REALLY SCARY",
    "Win": "A LADY GHOST APPEARS THERE",
    "Loss": "THE HOME WORK IS AWFULLY SCARY",
    "Sprite": "gen3/battle_girl.png"
  },
  {
    "Class": "Battle Girl",
    "Name": "Rayna",
    "Greeting": "I AM NO  WHEN IT'S ABOUT POWER",
    "Win": "UNDERSTAND MY POWER NOW?",
    "Loss": "TERRIBLE... I AM TERRIBLE...",
    "Sprite": "gen3/battle_girl.png"
  },
  {
    "Class": "Expert",
    "Name": "Evan",
    "Greeting": "EVERY BATTLE HAS A SMELL",
    "Win": "OH! THE SWEET SCENT OF VICTORY",
    "Loss": "THE AWFUL STENCH OF A LOSS",
    "Sprite": "gen3/expert_m.png"
  },
  {
    "Class": "Expert",
    "Name": "Jordan",
    "Greeting": "GOOD! COME ON!!",
    "Win": "YOU CAN'T BEAT ME!",
    "Loss": "WHAT?! BUT HOW?",
    "Sprite": "gen3/expert_m.png"
  },
  {
    "Class": "Expert",
    "Name": "Joel",
    "Greeting": "FUFUFU...",
    "Win": "GIGGLE...",
    "Loss": "HAHAHA...",
    "Sprite": "gen3/expert_m.png"
  },
  {
    "Class": "Expert",
    "Name": "Kristen",
    "Greeting": "HAHAHA... A KID...",
    "Win": "JUST A LITTLE KID AFTER ALL!",
    "Loss": "A TOUGH KID HUH? HUMPH!",
    "Sprite": "gen3/expert_f.png"
  },
  {
    "Class": "Expert",
    "Name": "Selphy",
    "Greeting": "HUH? WHAT IS IT?",
    "Win": "OH YES! WHY NOT?",
    "Loss": "OH NO! WHY NOT?",
    "Sprite": "gen3/expert_f.png"
  },
  {
    "Class": "Expert",
    "Name": "Chloe",
    "Greeting": "COME WE WILL DO BATTLE NOW",
    "Win": "MORE! ANOTHER BATTLE!",
    "Loss": "OH! STRONG YOU ARE",
    "Sprite": "gen3/expert_f.png"
  },
  {
    "Class": "Psychic",
    "Name": "Norton",
    "Greeting": "I KNOW ONLY YOU",
    "Win": "EXCUSE ME BUT YOU'RE A PUSHOVER!",
    "Loss": "YOU'RE SOME KIND OF AWESOME!",
    "Sprite": "gen3/psychic_m.png"
  },
  {
    "Class": "Psychic",
    "Name": "Lukas",
    "Greeting": "MY JOKING IS PRETTY TERRIBLE...",
    "Win": "YOUR ROCK HEAD EXISTS TO SHINE!",
    "Loss": "YOUR ROCK HEAD COME TO SHINE",
    "Sprite": "gen3/psychic_m.png"
  },
  {
    "Class": "Psychic",
    "Name": "Zach",
    "Greeting": "I AM AN EXCELLENT MIMIC OF POKEMON",
    "Win": "I AM HAPPY LIKE A LITTLE TOGEPI!",
    "Loss": "I AM ANGRY LIKE A MANKEY!",
    "Sprite": "gen3/psychic_m.png"
  },
  {
    "Class": "Psychic",
    "Name": "Kaitlyn",
    "Greeting": "I CRUSH THINGS WITH PSYCHIC POWER",
    "Win": "MY VICTORY WILL MAKE THE NEWS",
    "Loss": "NO NO... THIS WON'T DO",
    "Sprite": "gen3/psychic_f.png"
  },
  {
    "Class": "Psychic",
    "Name": "Breanna",
    "Greeting": "MY POKEMON WILL CRUSH YOU!",
    "Win": "HAVE SOME MORE OF THIS!",
    "Loss": "YOU HAVE GUTS AND SKILL",
    "Sprite": "gen3/psychic_f.png"
  },
  {
    "Class": "Psychic",
    "Name": "Kendra",
    "Greeting": "IF YOU'RE SMART STOP RIGHT NOW",
    "Win": "I SAID THAT YOU SHOULD STOP",
    "Loss": "WHY DIDN'T YOU STOP?",
    "Sprite": "gen3/psychic_f.png"
  },
  {
    "Class": "Hex Maniac",
    "Name": "Molly",
    "Greeting": "WILL MY CUTE CHARM ATTRACT YOU?",
    "Win": "YOUR POKEMON ARE MY TOYS NOW",
    "Loss": "OH HOW COULD YOU?",
    "Sprite": "gen3/hex_maniac.png"
  },
  {
    "Class": "Hex Maniac",
    "Name": "Jazmin",
    "Greeting": "I FORECAST TERRIBLE THINGS FOR YOU",
    "Win": "THERE WASN'T MY FORECAST RIGHT?",
    "Loss": "MY FORESIGHT DIDN'T SHOW ME THIS",
    "Sprite": "gen3/hex_maniac.png"
  },
  {
    "Class": "Hex Maniac",
    "Name": "Kelsey",
    "Greeting": "I HAVEN'T SLEPT IN DAYS...",
    "Win": "MY SLEEP WILL BE EXCELLENT NOW",
    "Loss": "YOU HAVE DESTROYED MY SLEEP...",
    "Sprite": "gen3/hex_maniac.png"
  },
  {
    "Class": "Pokemaniac",
    "Name": "Jalen",
    "Greeting": "I DON'T ALLOW POKEMON TO THRASH",
    "Win": "HAHAHA! ARE YOU ANGRY?",
    "Loss": "WHY IS THIS SO HARD?",
    "Sprite": "gen3/pokemaniac.png"
  },
  {
    "Class": "Pokemaniac",
    "Name": "Griffen",
    "Greeting": "I SWALLOW SLUDGE TO TRANSFORM MYSELF",
    "Win": "I HAVE A GROWTH OF ACID ARMOR",
    "Loss": "I HAVE A GROWTH OF SUCTION CUPS",
    "Sprite": "gen3/pokemaniac.png"
  },
  {
    "Class": "Pokemaniac",
    "Name": "Xander",
    "Greeting": "I GOT MY POKEMON ON RENTAL",
    "Win": "IT'S INCREDIBLE MY RENTAL POKEMON WON",
    "Loss": "RENTAL POKEMON AREN'T UP TO SCRATCH",
    "Sprite": "gen3/pokemaniac.png"
  },
  {
    "Class": "Gentleman",
    "Name": "Marvin",
    "Greeting": "YOU'RE UP TO THE CHALLENGE?",
    "Win": "I DIDN'T THINK YOU'RE GOOD ENOUGH",
    "Loss": "I AM FEELING PERFECT THANK YOU SO MUCH",
    "Sprite": "gen3/gentleman.png"
  },
  {
    "Class": "Gentleman",
    "Name": "Brennan",
    "Greeting": "I WISH TO SEE THE NEWS",
    "Win": "COMICS GET DAMP FROM DRIZZLE?",
    "Loss": "THE TIGHT MONEY LIVING CHANNEL?!",
    "Sprite": "gen3/gentleman.png"
  },
  {
    "Class": "Bug Maniac",
    "Name": "Baley",
    "Greeting": "SCREECH IS LIKE MUSIC TO ME!",
    "Win": "MY SCREECH STRATEGY IS THE BEST",
    "Loss": "YOU'RE SOUNDPROOF?",
    "Sprite": "gen3/bug_maniac.png"
  },
  {
    "Class": "Ruin Maniac",
    "Name": "Zackary",
    "Greeting": "CAN YOU DIG IT YO?",
    "Win": "TAKE DOWN TAKE A DIVE YO YO",
    "Loss": "BREAK DOWN DIVE TIME FOR ME",
    "Sprite": "gen3/ruin_maniac.png"
  },
  {
    "Class": "Collector",
    "Name": "Gabriel",
    "Greeting": "POUND THE THICK FAT ON MY BELLY DRUM",
    "Win": "POUND MY BELLY DRUM POUND MY BELLY DRUM",
    "Loss": "MY BELLY DRUM WAS TOO WEAK...",
    "Sprite": "gen3/collector.png"
  },
  {
    "Class": "Parasol Lady",
    "Name": "Emily",
    "Greeting": "HOW ABOUT A TINY BIT OF HYPNOSIS?",
    "Win": "MY HYPNOSIS STRATEGY WORKS TO PERFECTION",
    "Loss": "MY HYPNOSIS STRATEGY WENT BADLY...",
    "Sprite": "gen3/parasol_lady.png"
  },
  {
    "Class": "Beauty",
    "Name": "Jordyn",
    "Greeting": "YOU DON'T KNOW MY SECRET...",
    "Win": "I AM NOT AS I APPEAR...",
    "Loss": "BUT HOW DID YOU KNOW?",
    "Sprite": "gen3/beauty.png"
  },
  {
    "Class": "Aroma Lady",
    "Name": "Sofia",
    "Greeting": "PROBABLY HAS A SWEET SCENT",
    "Win": "THAT'S THE FEELING THAT I GET",
    "Loss": "I WORK AT THE DEPT STORE",
    "Sprite": "gen3/aroma_lady.png"
  },
  {
    "Class": "Cooltrainer",
    "Name": "Braden",
    "Greeting": "I CHOOSE YOU! THIS IS IT!",
    "Win": "I AM FEELING PRETTY AWESOME ABOUT MYSELF",
    "Loss": "ALL RIGHT! I SURRENDER!",
    "Sprite": "gen3/cooltrainer_m.png"
  },
  {
    "Class": "Cooltrainer",
    "Name": "Kayden",
    "Greeting": "THEY OVERDO THAT GOURMET THING...",
    "Win": "THAT GOURMET THING ISN'T FOR ME",
    "Loss": "HEY THIS IS PRETTY TASTY",
    "Sprite": "gen3/cooltrainer_m.png"
  },
  {
    "Class": "Cooltrainer",
    "Name": "Cooper",
    "Greeting": "THIS SHOULD ABSOLUTELY BE A PUSHOVER",
    "Win": "THAT WAS TOO EXCITING FOR ME...",
    "Loss": "PLEASE! SORRY I AM SORRY",
    "Sprite": "gen3/cooltrainer_m.png"
  },
  {
    "Class": "Cooltrainer",
    "Name": "Julia",
    "Greeting": "SPIRIT ALONE WON'T MAKE YOU WIN",
    "Win": "YOU SHOULD ACCEPT THIS WITH SERENE GRACE",
    "Loss": "FOR NOW GOOD BYE BUT IT'S NOT OVER",
    "Sprite": "gen3/cooltrainer_f.png"
  },
  {
    "Class": "Cooltrainer",
    "Name": "Amara",
    "Greeting": "WROOOAAR!!! I AM SO READY!!",
    "Win": "I LOSE MYSELF IF IT'S EXCITING",
    "Loss": "THAT'S TOO MUCH TO TACKLE!",
    "Sprite": "gen3/cooltrainer_f.png"
  },
  {
    "Class": "Cooltrainer",
    "Name": "Lynn",
    "Greeting": "YOUR SECRET CAN'T BE HIDDEN FOREVER",
    "Win": "I KNOW YOUR SECRET NOW!",
    "Loss": "YOU CAN'T SAFEGUARD YOUR OWN SECRET",
    "Sprite": "gen3/cooltrainer_f.png"
  },
  {
    "Class": "Pokémon Ranger",
    "Name": "Jovan",
    "Greeting": "YOUR BATTLE SENSE IS SADLY LACKING",
    "Win": "MY BATTLE SENSE IS COOL ISN'T IT?",
    "Loss": "I WAS MINUS MY NORMAL POWER TODAY",
    "Sprite": "gen3/pkmn_ranger_m.png"
  },
  {
    "Class": "Pokémon Ranger",
    "Name": "Dominic",
    "Greeting": "I HAVE THIS EXCELLENT CAMERA",
    "Win": "MY CAMERA WAS AWFULLY EXPENSIVE",
    "Loss": "MY CAMERA DOESN'T MISS A THING",
    "Sprite": "gen3/pkmn_ranger_m.png"
  },
  {
    "Class": "Pokémon Ranger",
    "Name": "Nikolas",
    "Greeting": "I MIMIC POKEMON AFTER EVERY BATTLE",
    "Win": "IF I WIN I PRETEND I AM A TAUROS",
    "Loss": "IF I LOSE I PRETEND I AM A MILTANK",
    "Sprite": "gen3/pkmn_ranger_m.png"
  },
  {
    "Class": "Pokémon Ranger",
    "Name": "Valeria",
    "Greeting": "I WISH YOU WOULD NOT GLARE",
    "Win": "YOU'RE MEAN! I MEAN REALLY",
    "Loss": "YOU HAVE A REALLY SCARY FACE!",
    "Sprite": "gen3/pkmn_ranger_f.png"
  },
  {
    "Class": "Pokémon Ranger",
    "Name": "Delaney",
    "Greeting": "SCHOOL IS OVER TIME TO PLAY",
    "Win": "MY BOY FRIEND IS FROM SCHOOL",
    "Loss": "I HAVE TO WORK NEXT WEEK",
    "Sprite": "gen3/pkmn_ranger_f.png"
  },
  {
    "Class": "Pokémon Ranger",
    "Name": "Meghan",
    "Greeting": "SCHOOL IS OUT TIME TO PLAY",
    "Win": "MY BOY FRIEND LIKES COMICS",
    "Loss": "IT'S BACK TO SCHOOL SOON",
    "Sprite": "gen3/pkmn_ranger_f.png"
  },
  {
    "Class": "Dragon Tamer",
    "Name": "Roberto",
    "Greeting": "DRAGON POKEMON ARE INVINCIBLE!",
    "Win": "YOU WEREN'T BAD I WAS JUST BETTER",
    "Loss": "AREN'T YOU SATISFIED YET?",
    "Sprite": "gen3/dragon_tamer.png"
  },
  {
    "Class": "Dragon Tamer",
    "Name": "Damian",
    "Greeting": "MY PURE POWER IS MACHINE LIKE!",
    "Win": "MY MACH PUNCH WILL MAKE A BRICK BREAK",
    "Loss": "ARRGH! NO!!",
    "Sprite": "gen3/dragon_tamer.png"
  },
  {
    "Class": "Dragon Tamer",
    "Name": "Brody",
    "Greeting": "MY FASHION SENSE SEEMS?",
    "Win": "IT'S MY FAMILY STAY AT HOME LOOK!",
    "Loss": "I QUESTION YOUR FASHION SENSE SERIOUSLY",
    "Sprite": "gen3/dragon_tamer.png"
  },
  {
    "Class": "Dragon Tamer",
    "Name": "Graham",
    "Greeting": "YEAH! YEAH YEAH!!",
    "Win": "WAHAHAHA WAHAHAHA! WAHAHAHA WAHAHAHA!!",
    "Loss": "I AM SORRY... IT'S MY BAD",
    "Sprite": "gen3/dragon_tamer.png"
  },
  {
    "Class": "Pokefan",
    "Name": "Tylor",
    "Greeting": "ARE YOU FEELING MY HEAT WAVE?",
    "Win": "YES I AM ON FIRE!",
    "Loss": "BUT I WAS ON FIRE FOR YOU",
    "Sprite": "gen3/pokefan_m.png"
  },
  {
    "Class": "Pokefan",
    "Name": "Jaren",
    "Greeting": "FIGHTING SPIRIT? ME?",
    "Win": "I WANT MORE CUTE POKEMON",
    "Loss": "YOUR POKEMON LOOK QUITE CUTE",
    "Sprite": "gen3/pokefan_f.png"
  },
  {
    "Class": "Pokémon Breeder",
    "Name": "Cordell",
    "Greeting": "A BATTLE IS DECIDED ON SPIRIT",
    "Win": "CAN'T YOU ACCEPT THAT?",
    "Loss": "I WILL BE ON MY WAY",
    "Sprite": "gen3/pkmn_breeder_m.png"
  },
  {
    "Class": "Pokémon Breeder",
    "Name": "Jazlyn",
    "Greeting": "IS YOUR POKEDEX REALLY AWESOME?",
    "Win": "OH YEAH WOW YOUR POKEDEX IS SUPER",
    "Loss": "AN AVANT GARDE POKEDEX WOULD BE AWESOME",
    "Sprite": "gen3/pkmn_breeder_f.png"
  },
  {
    "Class": "Youngster",
    "Name": "Zachery",
    "Greeting": "I HAVE MY OWN PLACE YEEHAW!",
    "Win": "IT'S AN EXCITING TIME FOR ME",
    "Loss": "YOU CAN'T FLATTEN MY HAPPINESS!",
    "Sprite": "gen3/youngster.png"
  },
  {
    "Class": "Youngster",
    "Name": "Johan",
    "Greeting": "WINTER WILL SOON BE HERE",
    "Win": "MY ALLOWANCE COULD USE A HELPING HAND",
    "Loss": "I ALWAYS USE MY ALLOWANCE UP",
    "Sprite": "gen3/youngster.png"
  },
  {
    "Class": "Lass",
    "Name": "Shea",
    "Greeting": "DO YOU BATTLE WITH BEAUTY?",
    "Win": "YOU BATTLE IN AN UGLY WAY",
    "Loss": "WHAT IS BEAUTY TO YOU?",
    "Sprite": "gen3/lass.png"
  },
  {
    "Class": "Lass",
    "Name": "Kaila",
    "Greeting": "I AM FEELING THIRSTY RIGHT NOW...",
    "Win": "I COULD USE A COLD DRINK",
    "Loss": "THAT LOSS IS HARD TO SWALLOW",
    "Sprite": "gen3/lass.png"
  },
  {
    "Class": "School Kid",
    "Name": "Isiah",
    "Greeting": "I PRETEND TO STUDY A LOT",
    "Win": "I TRICK MOTHER FOR MY ALLOWANCE",
    "Loss": "I DON'T WANT TO STUDY MORE",
    "Sprite": "gen3/school_kid_m.png"
  },
  {
    "Class": "School Kid",
    "Name": "Garrett",
    "Greeting": "I ENJOY COMICS AND THIS GAME",
    "Win": "I LIKE THIS MUSIC IDOL TOO",
    "Loss": "BUT I HAVE TO STUDY MORE",
    "Sprite": "gen3/school_kid_m.png"
  },
  {
    "Class": "School Kid",
    "Name": "Haylie",
    "Greeting": "I WORRY TOO MUCH TO SLEEP",
    "Win": "A WIN GIVES ME A CALM MIND",
    "Loss": "MY INSOMNIA WILL GET BAD...",
    "Sprite": "gen3/school_kid_f.png"
  },
  {
    "Class": "School Kid",
    "Name": "Megan",
    "Greeting": "I BELIEVE IN AN AROMATHERAPY BATH",
    "Win": "I WANT A HEALTHY CLEAR BODY",
    "Loss": "IF ONLY AROMATHERAPY WERE LESS EXPENSIVE",
    "Sprite": "gen3/school_kid_f.png"
  },
  {
    "Class": "Rich Boy",
    "Name": "Issac",
    "Greeting": "MY HOBBY?",
    "Win": "I LIKE ANY KIND OF WATER SPORT",
    "Loss": "I DISLIKE ANY KIND OF MUD SPORT",
    "Sprite": "gen3/rich_boy.png"
  },
  {
    "Class": "Rich Boy",
    "Name": "Quinton",
    "Greeting": "I AM SAD CAUSE I AM TOO WEAK",
    "Win": "YOU AREN'T TOO STRONG FOR ME",
    "Loss": "HEY WHAT DID I DO?",
    "Sprite": "gen3/rich_boy.png"
  },
  {
    "Class": "Lady",
    "Name": "Salma",
    "Greeting": "YOU'VE GOT YOUR HUSTLE ON!",
    "Win": "I WIN YOU HUSTLE ON OUT",
    "Loss": "I DON'T GET HOW I LOST",
    "Sprite": "gen3/lady.png"
  },
  {
    "Class": "Lady",
    "Name": "Ansley",
    "Greeting": "I AM BORED... DANCE FOR ME",
    "Win": "YOU'VE BORED ME SOME MORE",
    "Loss": "TAKE YOUR FRUSTRATION SOME OTHER PLACE",
    "Sprite": "gen3/lady.png"
  },
  {
    "Class": "Bug Catcher",
    "Name": "Holden",
    "Greeting": "LET'S COMMEMORATE MY COOLNESS IN BATTLE",
    "Win": "YOU'RE TOO WEAK FOR ANY PRAISE",
    "Loss": "YOUR BATTLE SENSE IS AMUSING",
    "Sprite": "gen3/bug_catcher.png"
  },
  {
    "Class": "Bug Catcher",
    "Name": "Luca",
    "Greeting": "WE WILL HAVE A COOL BATTLE",
    "Win": "I WON IN A COOL WAY",
    "Loss": "HELLO? I AM JUST A KID",
    "Sprite": "gen3/bug_catcher.png"
  },
  {
    "Class": "Ninja Boy",
    "Name": "Jamison",
    "Greeting": "MY SECRET POWER IS OVERWHELMING TO POKEMON",
    "Win": "DID YOU SEE THAT?",
    "Loss": "I WILL USE SMOKESCREEN TO ESCAPE",
    "Sprite": "gen3/ninja_boy.png"
  },
  {
    "Class": "Ninja Boy",
    "Name": "Gunnar",
    "Greeting": "I CUT DOWN EVERY OPPONENT",
    "Win": "DON'T GRUDGE ME FOR YOUR LOSS",
    "Loss": "PLEASE LOSE THAT SCARY FACE OF YOURS",
    "Sprite": "gen3/ninja_boy.png"
  },
  {
    "Class": "Tuber",
    "Name": "Craig",
    "Greeting": "I CAN'T WAIT FOR MY TRAIN",
    "Win": "MY TRAIN ISN'T HERE YET...",
    "Loss": "HERE IT IS MY TRAIN SEE YA!",
    "Sprite": "gen3/tuber_m.png"
  },
  {
    "Class": "Tuber",
    "Name": "Pierce",
    "Greeting": "THERE WAS A HEAT WAVE LAST WEEK",
    "Win": "I CAN'T TAKE A HEAT WAVE",
    "Loss": "DIDN'T IT HAIL TOO?",
    "Sprite": "gen3/tuber_m.png"
  },
  {
    "Class": "Tuber",
    "Name": "Regina",
    "Greeting": "I LIKE TO PLAY IN WATER",
    "Win": "I REFUSE TO COME OUT",
    "Loss": "YOU'RE NOT MUCH GOOD IN WATER",
    "Sprite": "gen3/tuber_f.png"
  },
  {
    "Class": "Tuber",
    "Name": "Alison",
    "Greeting": "THIS KINDERGARTEN MAGAZINE IS TOO MUCH",
    "Win": "HOW TO BUG YOUR TEACHER?",
    "Loss": "ENJOY A TASTY SCHOOL DIET?",
    "Sprite": "gen3/tuber_f.png"
  },
  {
    "Class": "Bug Maniac",
    "Name": "Hank",
    "Greeting": "THERE IS A BUG EVENT SOON",
    "Win": "IT'S A BUG FASHION SHOW!",
    "Loss": "DON'T YOU LIKE BUG POKEMON?",
    "Sprite": "gen3/bug_maniac.png"
  },
  {
    "Class": "Bug Maniac",
    "Name": "Earl",
    "Greeting": "THE INVINCIBLE BUG TRAINER IS HERE",
    "Win": "THE INVINCIBLE BUG TRAINER AM I",
    "Loss": "SEE HOW FAST I RUN AWAY!",
    "Sprite": "gen3/bug_maniac.png"
  },
  {
    "Class": "Fisherman",
    "Name": "Ramiro",
    "Greeting": "I WENT TO A FISHING SCHOOL",
    "Win": "SERIOUSLY I AM IN THE FISHING HALL OF FAME",
    "Loss": "I WANT TO GO BACK...",
    "Sprite": "gen3/fisherman.png"
  },
  {
    "Class": "Fisherman",
    "Name": "Hunter",
    "Greeting": "SHOW ME A TOTALLY COOL CROSS CHOP",
    "Win": "YOU'RE TOO WEAK TO DO A CROSS CHOP",
    "Loss": "WAS IT A MISTAKE?",
    "Sprite": "gen3/fisherman.png"
  },
  {
    "Class": "Ruin Maniac",
    "Name": "Aiden",
    "Greeting": "MY WORK IS MAKING ME HEALTHY",
    "Win": "YOU SEE? I AM HEALTHY!",
    "Loss": "YOU'RE MORE HEALTHY THAN I AM...",
    "Sprite": "gen3/ruin_maniac.png"
  },
  {
    "Class": "Ruin Maniac",
    "Name": "Xavier",
    "Greeting": "HEY THERE! LOOK LOOK!!",
    "Win": "GOOD BYE AND THANK YOU THAT WAS FUNNY",
    "Loss": "WOWEE! NO NO!!",
    "Sprite": "gen3/ruin_maniac.png"
  },
  {
    "Class": "Collector",
    "Name": "Clinton",
    "Greeting": "WANT TO SEE MY HYPNOSIS?",
    "Win": "YOUR FURY SWIPES YOUR STRENGTH YOUNG TRAINER",
    "Loss": "TCH... I AM TOO WEAK...",
    "Sprite": "gen3/collector.png"
  },
  {
    "Class": "Collector",
    "Name": "Jesse",
    "Greeting": "THIS BATTLE IS FOR MY MOTHER",
    "Win": "MOTHER WILL BE HAPPY FOR ME",
    "Loss": "I WANT MY MOTHER!",
    "Sprite": "gen3/collector.png"
  },
  {
    "Class": "Guitarist",
    "Name": "Eduardo",
    "Greeting": "OUR MUSIC WILL PLAY ALL NIGHT",
    "Win": "NIGHTTIME IS WHEN I PLAY BEST",
    "Loss": "LET'S PARTY UNTIL THE MORNING SUN!",
    "Sprite": "gen3/guitarist.png"
  },
  {
    "Class": "Guitarist",
    "Name": "Hal",
    "Greeting": "I AM TRENDY AREN'T I?",
    "Win": "I AM FEELING HIP AND HAPPENING OH YEAH!",
    "Loss": "I AM ALWAYS TRENDY THANK YOU VERY MUCH",
    "Sprite": "gen3/guitarist.png"
  },
  {
    "Class": "Bird Keeper",
    "Name": "Gage",
    "Greeting": "HERE IT IS A FLYING TYPE HIDDEN MOVE",
    "Win": "IT'S A FLYING TYPE VICTORY!",
    "Loss": "IF I LOSE I JUST FLY AWAY",
    "Sprite": "gen3/bird_keeper.png"
  },
  {
    "Class": "Bird Keeper",
    "Name": "Arnold",
    "Greeting": "I AM FEELING WEIRD FROM A DREAM",
    "Win": "YOUR SCARY FACE WAS IN MY DREAM",
    "Loss": "MY INCREDIBLE DREAM WAS SO WEIRD",
    "Sprite": "gen3/bird_keeper.png"
  },
  {
    "Class": "Sailor",
    "Name": "Jarrett",
    "Greeting": "COME ON LET'S DANCE LIKE IT'S YESTERDAY",
    "Win": "YOU LIKE HOW I DANCE?",
    "Loss": "YOU DON'T APPRECIATE HOW I DANCE",
    "Sprite": "gen3/sailor.png"
  },
  {
    "Class": "Sailor",
    "Name": "Garett",
    "Greeting": "MY GIRL GIVES ME A LITTLE SWEET KISS",
    "Win": "MY GIRL FRIEND IS MY TREASURE",
    "Loss": "A TREASURE ISN'T ALWAYS ABOUT MONEY",
    "Sprite": "gen3/sailor.png"
  },
  {
    "Class": "Hiker",
    "Name": "Emanuel",
    "Greeting": "SMARTNESS ALONE WON'T MAKE YOU WIN",
    "Win": "I AM NOT VERY SMART BUT I WON",
    "Loss": "HOW DID YOU FAKE OUT ME?",
    "Sprite": "gen3/hiker.png"
  },
  {
    "Class": "Hiker",
    "Name": "Gustavo",
    "Greeting": "CHARGE! CHARGE!!",
    "Win": "SURRENDER? SO SOON?",
    "Loss": "YOU CAN'T MAKE ME SURRENDER YET",
    "Sprite": "gen3/hiker.png"
  },
  {
    "Class": "Kindler",
    "Name": "Kameron",
    "Greeting": "TAKE THAT! IT'S MY FIERY TRICK",
    "Win": "DID MY FIERY TRICK ASTONISH?",
    "Loss": "YOU DIDN'T FALL FOR MY TRICK",
    "Sprite": "gen3/kindler.png"
  },
  {
    "Class": "Kindler",
    "Name": "Alfredo",
    "Greeting": "A FIERY GOURMET AM I!",
    "Win": "IT'S A TASTY GOURMET VICTORY!",
    "Loss": "WHAT A DISASTER THAT WAS!",
    "Sprite": "gen3/kindler.png"
  },
  {
    "Class": "Gentleman",
    "Name": "Ruben",
    "Greeting": "I CAN'T WAIT TO GET GOING",
    "Win": "GET GOING! THIS IS GOOD BYE",
    "Loss": "I'VE GOT TO GET GOING",
    "Sprite": "gen3/gentleman.png"
  },
  {
    "Class": "Gentleman",
    "Name": "Lamar",
    "Greeting": "A PRESENT FOR ME?",
    "Win": "MMM THIS IS QUITE TASTY...",
    "Loss": "OH IT'S A GAME IS IT?",
    "Sprite": "gen3/gentleman.png"
  },
  {
    "Class": "Youngster",
    "Name": "Jaxon",
    "Greeting": "A SHELL ARMOR IS WHAT I WANT",
    "Win": "MY FATHER AND MOTHER WON'T ACCEPT",
    "Loss": "PLEASE I NEED A SHELL ARMOR!",
    "Sprite": "gen3/youngster.png"
  },
  {
    "Class": "Youngster",
    "Name": "Logan",
    "Greeting": "IF I LOSE I WILL STUDY FOR SCHOOL",
    "Win": "ME STUDY? NOT VERY LIKELY TO SEE",
    "Loss": "NO THANKS I AM GOING TO SLEEP",
    "Sprite": "gen3/youngster.png"
  },
  {
    "Class": "Lass",
    "Name": "Emilee",
    "Greeting": "IS THIS KIND OF BATTLE OK?",
    "Win": "LET'S GO FOR AN ICY WIND SURF",
    "Loss": "HOW ABOUT A ROCK SLIDE SHOW?",
    "Sprite": "gen3/lass.png"
  },
  {
    "Class": "Lass",
    "Name": "Josie",
    "Greeting": "A POKEMON FASHION CONTEST IS PRETTY",
    "Win": "I REALLY LIKE MODE FASHION THINGS",
    "Loss": "YOU'RE TOTALLY LACKING IN FASHION SENSE",
    "Sprite": "gen3/lass.png"
  },
  {
    "Class": "Camper",
    "Name": "Armando",
    "Greeting": "I NEED MORE GRASS TYPE POKEMON",
    "Win": "TRADE ME A GRASS POKEMON PLEASE",
    "Loss": "THERE AREN'T ENOUGH GRASS TYPE POKEMON",
    "Sprite": "gen3/camper.png"
  },
  {
    "Class": "Camper",
    "Name": "Skyler",
    "Greeting": "INGRAIN IS MY CHOICE BATTLE MOVE",
    "Win": "YOU CAN'T MOVE ME NOW!",
    "Loss": "YOU CUT ME DOWN...",
    "Sprite": "gen3/camper.png"
  },
  {
    "Class": "Picnicker",
    "Name": "Ruth",
    "Greeting": "I WANT TO ENJOY THIS BATTLE",
    "Win": "THAT WAS MUCH TOO EASY!",
    "Loss": "PLEASE STOP I DON'T ENJOY THIS",
    "Sprite": "gen3/picnicker.png"
  },
  {
    "Class": "Picnicker",
    "Name": "Melody",
    "Greeting": "I WISH SUNDAY IS A SUNNY DAY",
    "Win": "SUNDAY SEEMS FOREVER TO COME...",
    "Loss": "THE FORECAST SAYS IT WILL HAIL",
    "Sprite": "gen3/picnicker.png"
  },
  {
    "Class": "Swimmer",
    "Name": "Pedro",
    "Greeting": "A SWIFT SWIM WILL DO YOU GOOD",
    "Win": "THAT'S HOW I SINK AN OPPONENT",
    "Loss": "UH OH! A WHIRLPOOL!",
    "Sprite": "gen3/swimmer_m.png"
  },
  {
    "Class": "Swimmer",
    "Name": "Erick",
    "Greeting": "I WILL TACKLE YOU DOWN!",
    "Win": "DON'T YOU RUN AWAY YOU LOSER!",
    "Loss": "I DIDN'T THINK YOU WOULD COUNTER",
    "Sprite": "gen3/swimmer_m.png"
  },
  {
    "Class": "Swimmer",
    "Name": "Elaine",
    "Greeting": "MY HEROINE ADVENTURE ISN'T GOING WELL",
    "Win": "THANK YOU! THAT'S WHAT I NEED",
    "Loss": "I KNOW I AM NOT A HEROINE",
    "Sprite": "gen3/swimmer_f.png"
  },
  {
    "Class": "Swimmer",
    "Name": "Joyce",
    "Greeting": "YOU MAKE ME GO AHAHA!",
    "Win": "LALALA NO LOSING FOR ME!",
    "Loss": "LALALA... HUH?",
    "Sprite": "gen3/swimmer_f.png"
  },
  {
    "Class": "Pokefan",
    "Name": "Todd",
    "Greeting": "YOU'RE A LIGHTNINGROD FOR MY POWER",
    "Win": "THAT'S ALL YOU COULD ABSORB?",
    "Loss": "YOU REFLECT MY POWER BACK?",
    "Sprite": "gen3/pokefan_m.png"
  },
  {
    "Class": "Pokefan",
    "Name": "Gavin",
    "Greeting": "I WILL BIDE MY TIME",
    "Win": "IT'S OVER SO SOON?",
    "Loss": "MY MISTAKE WAS TOO EXPENSIVE...",
    "Sprite": "gen3/pokefan_m.png"
  },
  {
    "Class": "Pokefan",
    "Name": "Malory",
    "Greeting": "PROMISE TO SHOW ME CUTE POKEMON",
    "Win": "GIGGLE... THANK YOU SO MUCH",
    "Loss": "TCH YOUR POKEMON AREN'T VERY NICE",
    "Sprite": "gen3/pokefan_f.png"
  },
  {
    "Class": "Pokefan",
    "Name": "Esther",
    "Greeting": "I WANT A NICE PRESENT...",
    "Win": "PLEASE GET ME A POKEMON GAME",
    "Loss": "MESSAGE CARDS MAKE A WEAK PRESENT",
    "Sprite": "gen3/pokefan_f.png"
  },
  {
    "Class": "Pokémon Breeder",
    "Name": "Oscar",
    "Greeting": "LET'S SEE YOUR POWER IN FULL",
    "Win": "THAT WAS NOT YOUR FULL POWER!",
    "Loss": "NOT FUNNY... YOU'RE TOO STRONG",
    "Sprite": "gen3/pkmn_breeder_m.png"
  },
  {
    "Class": "Pokémon Breeder",
    "Name": "Wilson",
    "Greeting": "WORK IS MAKING ME AN EARLY BIRD",
    "Win": "ALL WORK AND NO PLAY...",
    "Loss": "ENDURE IS ALL I CAN DO",
    "Sprite": "gen3/pkmn_breeder_m.png"
  },
  {
    "Class": "Pokémon Breeder",
    "Name": "Clare",
    "Greeting": "YAY! A TOUGH TRAINER!",
    "Win": "AWW! A WIMPY TRAINER!",
    "Loss": "COOL! A GENIUS TRAINER!",
    "Sprite": "gen3/pkmn_breeder_f.png"
  },
  {
    "Class": "Pokémon Breeder",
    "Name": "Tess",
    "Greeting": "WANT SOME DESIGN SWEETS?",
    "Win": "THEY RE A SECRET POKEMON GOURMET ITEM",
    "Loss": "THEY RE TASTY! REFRESHING TOO!",
    "Sprite": "gen3/pkmn_breeder_f.png"
  },
  {
    "Class": "Cooltrainer",
    "Name": "Leon",
    "Greeting": "I AM BETTER THAN ANY OTHER TRAINER",
    "Win": "I DID IT JUMP KICK FOR JOY",
    "Loss": "BACK HOME I WILL GO...",
    "Sprite": "gen3/cooltrainer_m.png"
  },
  {
    "Class": "Cooltrainer",
    "Name": "Alonzo",
    "Greeting": "I'VE NOT LOST ONCE YET!",
    "Win": "YOUR SAD LOOK BECOMES YOU",
    "Loss": "I DON'T BELIEVE THIS...",
    "Sprite": "gen3/cooltrainer_m.png"
  },
  {
    "Class": "Cooltrainer",
    "Name": "Vince",
    "Greeting": "THE TOP TRAINER THAT'S ME!",
    "Win": "THE TOP RANK BELONGS TO ME!",
    "Loss": "I WILL APPEAL THIS OUTRAGE!",
    "Sprite": "gen3/cooltrainer_m.png"
  },
  {
    "Class": "Cooltrainer",
    "Name": "Bryon",
    "Greeting": "MY BARRAGE WILL SLAM YOU!",
    "Win": "YOU DIDN'T COUNT ON ANY LESS?",
    "Loss": "I JUST DON'T GET IT...",
    "Sprite": "gen3/cooltrainer_m.png"
  },
  {
    "Class": "Cooltrainer",
    "Name": "Ava",
    "Greeting": "I AM A TREASURE OF THIS WORLD",
    "Win": "MY WORLD IS FULL OF WONDER",
    "Loss": "WHY ARE YOU SO TERRIBLE?",
    "Sprite": "gen3/cooltrainer_f.png"
  },
  {
    "Class": "Cooltrainer",
    "Name": "Miriam",
    "Greeting": "OH A TRAINER WITH A SCARY FACE",
    "Win": "AHAHA YOU ONLY LOOK SCARY!",
    "Loss": "AIYEEH! YOU REALLY ARE SCARY",
    "Sprite": "gen3/cooltrainer_f.png"
  },
  {
    "Class": "Cooltrainer",
    "Name": "Carrie",
    "Greeting": "I WILL SHOW YOU GUTSY!",
    "Win": "IT'S ALL ABOUT GUTS!",
    "Loss": "OH NO... SELF DESTRUCT MODE!",
    "Sprite": "gen3/cooltrainer_f.png"
  },
  {
    "Class": "Cooltrainer",
    "Name": "Gillian",
    "Greeting": "I SEEK A TRULY GREAT BATTLE",
    "Win": "I NEED A LOT BETTER BATTLE...",
    "Loss": "THAT WAS A LITTLE TOO MUCH TO TAKE",
    "Sprite": "gen3/cooltrainer_f.png"
  },
  {
    "Class": "Pokémon Ranger",
    "Name": "Tyler",
    "Greeting": "YO! LET'S GO!!",
    "Win": "YO! I WON YO",
    "Loss": "YO! I LOST YO",
    "Sprite": "gen3/pkmn_ranger_m.png"
  },
  {
    "Class": "Pokémon Ranger",
    "Name": "Chaz",
    "Greeting": "MY POKEMON HAVE TOO MUCH POWER",
    "Win": "THEY HAVE MORE POWER NOW!",
    "Loss": "YEAH TAKE DOWN THEIR POWER A TINY BIT PLEASE",
    "Sprite": "gen3/pkmn_ranger_m.png"
  },
  {
    "Class": "Pokémon Ranger",
    "Name": "Nelson",
    "Greeting": "WELL THEN WILL THIS POKEMON WORK?",
    "Win": "I SEE THAT IT WAS TOO STRONG",
    "Loss": "IT DIDN'T MATCH UP WELL I THINK",
    "Sprite": "gen3/pkmn_ranger_m.png"
  },
  {
    "Class": "Pokémon Ranger",
    "Name": "Shania",
    "Greeting": "ALL MY POKEMON ABSOLUTELY ADORE ME",
    "Win": "HAPPINESS IS A POKEMON WITH CUTE CHARM",
    "Loss": "YOU'RE SO MEAN TO CUTE POKEMON",
    "Sprite": "gen3/pkmn_ranger_f.png"
  },
  {
    "Class": "Pokémon Ranger",
    "Name": "Stella",
    "Greeting": "I WANT TO SEE YOUR POKEMON",
    "Win": "WELL AREN'T THEY BORING? AHAHA",
    "Loss": "YOUR POKEMON ARE SOMETHING ELSE ALL RIGHT",
    "Sprite": "gen3/pkmn_ranger_f.png"
  },
  {
    "Class": "Pokémon Ranger",
    "Name": "Dorine",
    "Greeting": "I AM YOUNG AND STRONG!",
    "Win": "SEE? AREN'T I GOOD?",
    "Loss": "THIS ISN'T WORKING OUT AT ALL",
    "Sprite": "gen3/pkmn_ranger_f.png"
  },
  {
    "Class": "Dragon Tamer",
    "Name": "Maddox",
    "Greeting": "DRAGON POKEMON ARE MY NO  CHOICE",
    "Win": "IT'S NO SECRET DRAGON POKEMON WIN",
    "Loss": "DRAGON POKEMON SHOULD NOT LOSE!",
    "Sprite": "gen3/dragon_tamer.png"
  },
  {
    "Class": "Dragon Tamer",
    "Name": "Davin",
    "Greeting": "LET'S HEAR YOU ROAR!",
    "Win": "WROOOAAR! VICTORY!!",
    "Loss": "WROOOAAR! WHY?!",
    "Sprite": "gen3/dragon_tamer.png"
  },
  {
    "Class": "Dragon Tamer",
    "Name": "Trevon",
    "Greeting": "I AM LIVING ONLY WITH DRAGON POKEMON",
    "Win": "THE WAY I AM LIVING IS PERFECT",
    "Loss": "YOU'VE DESTROYED THE WAY I AM LIVING",
    "Sprite": "gen3/dragon_tamer.png"
  },
  {
    "Class": "Black Belt",
    "Name": "Mateo",
    "Greeting": "THIS SHOULD BE OVER SOON ENOUGH",
    "Win": "WELL THAT DIDN'T TAKE VERY MUCH",
    "Loss": "I CAN'T LOSE SO SOON!",
    "Sprite": "gen3/black_belt.png"
  },
  {
    "Class": "Black Belt",
    "Name": "Bret",
    "Greeting": "I LIKE ROCK SOLID POKEMON THE BEST",
    "Win": "TOUGHNESS IS THE WAY TO GO",
    "Loss": "I ALSO HAVE A PLUSH DOLL COLLECTION",
    "Sprite": "gen3/black_belt.png"
  },
  {
    "Class": "Black Belt",
    "Name": "Raul",
    "Greeting": "I REJECT EVERY WEAK TRAINER",
    "Win": "HUMPH! ANOTHER WEAK TRAINER...",
    "Loss": "THERE IS NOTHING WEAK ABOUT YOU",
    "Sprite": "gen3/black_belt.png"
  },
  {
    "Class": "Battle Girl",
    "Name": "Kay",
    "Greeting": "AND YET ANOTHER BATTLE?",
    "Win": "I WON BUT I AM TIRED...",
    "Loss": "GOOD IT'S OVER AT LAST...",
    "Sprite": "gen3/battle_girl.png"
  },
  {
    "Class": "Battle Girl",
    "Name": "Elena",
    "Greeting": "A BATTLE GIRL THAT'S ME!",
    "Win": "ISN'T A BATTLE GIRL AWESOME?",
    "Loss": "YOU DISLIKE A BATTLE GIRL?",
    "Sprite": "gen3/battle_girl.png"
  },
  {
    "Class": "Battle Girl",
    "Name": "Alana",
    "Greeting": "EAT MY INVINCIBLE ATTACK YOU!",
    "Win": "YOU HAVE MUCH TO LEARN",
    "Loss": "SO MUCH FOR MY INVINCIBLE ATTACK",
    "Sprite": "gen3/battle_girl.png"
  },
  {
    "Class": "Expert",
    "Name": "Alexas",
    "Greeting": "GOOD TO MEET YOU YOUNG TRAINER!",
    "Win": "WAHAHAHA! GIVE IT UP",
    "Loss": "YOU ARE A STRONG TRAINER KID",
    "Sprite": "gen3/expert_m.png"
  },
  {
    "Class": "Expert",
    "Name": "Weston",
    "Greeting": "I DON'T PLAY DOWN ALL RIGHT?",
    "Win": "YOU'RE FAR TOO EASY TO ATTACK",
    "Loss": "WELL WELL... I SURRENDER...",
    "Sprite": "gen3/expert_m.png"
  },
  {
    "Class": "Expert",
    "Name": "Jasper",
    "Greeting": "I AM NOT OLD I AM SKILLED!",
    "Win": "SKILLED THAT'S WHAT I AM!",
    "Loss": "I AM SHOCKED! DOWN I GO",
    "Sprite": "gen3/expert_m.png"
  },
  {
    "Class": "Expert",
    "Name": "Nadia",
    "Greeting": "YOU CAN'T BEAT ME DOWN!",
    "Win": "HAH! I BEAT YOU",
    "Loss": "I AM BEAT UP AND DOWNCAST...",
    "Sprite": "gen3/expert_f.png"
  },
  {
    "Class": "Expert",
    "Name": "Miranda",
    "Greeting": "WELL WELL LET'S START",
    "Win": "WHAT? DONE SO SOON?",
    "Loss": "WELL I SEE THAT I AM TOO WEAK",
    "Sprite": "gen3/expert_f.png"
  },
  {
    "Class": "Expert",
    "Name": "Emma",
    "Greeting": "I'VE BEEN HEARING ABOUT YOU",
    "Win": "I THINK I'VE MISHEARD THINGS",
    "Loss": "WHAT I'VE BEEN HEARING IS RIGHT",
    "Sprite": "gen3/expert_f.png"
  },
  {
    "Class": "Psychic",
    "Name": "Rolando",
    "Greeting": "I AM A SUPER POKEMON HERO!",
    "Win": "WAS THAT ENOUGH FOR YOU?",
    "Loss": "YOU SHOULD NOT BEAT A HERO",
    "Sprite": "gen3/psychic_m.png"
  },
  {
    "Class": "Psychic",
    "Name": "Stanly",
    "Greeting": "THIS SHOULD BE AN EASY MATCH",
    "Win": "IT REALLY WAS EASY",
    "Loss": "ARE YOU HAPPY NOW?",
    "Sprite": "gen3/psychic_m.png"
  },
  {
    "Class": "Psychic",
    "Name": "Dario",
    "Greeting": "MY FORESIGHT SAYS I WILL WIN",
    "Win": "MY FORESIGHT HAS BEEN PERFECT",
    "Loss": "I DIDN'T SEE THIS REVERSAL...",
    "Sprite": "gen3/psychic_m.png"
  },
  {
    "Class": "Psychic",
    "Name": "Karlee",
    "Greeting": "SOMETHING GOOD WILL COME OF THIS",
    "Win": "YOU SEE? FANTASTIC!",
    "Loss": "THAT SOMETHING GOOD WENT TO YOU",
    "Sprite": "gen3/psychic_f.png"
  },
  {
    "Class": "Psychic",
    "Name": "Jaylin",
    "Greeting": "EVERY TRAINER HAS BEEN TOO WEAK...",
    "Win": "IT'S MAKING ME YAWN THAT BATTLE",
    "Loss": "I SLEPT AND SO I LOST",
    "Sprite": "gen3/psychic_f.png"
  },
  {
    "Class": "Psychic",
    "Name": "Ingrid",
    "Greeting": "I AM NOT A VERY MEAN TRAINER",
    "Win": "WASN'T THAT A GOOD MATCH?",
    "Loss": "I LOST CAUSE YOU'RE MEAN...",
    "Sprite": "gen3/psychic_f.png"
  },
  {
    "Class": "Hex Maniac",
    "Name": "Delilah",
    "Greeting": "DON'T GRUDGE ME IF I WIN OK?",
    "Win": "I AM SORRY TO SEE YOU ANGRY",
    "Loss": "I HAVE A GRUDGE WITH YOU",
    "Sprite": "gen3/hex_maniac.png"
  },
  {
    "Class": "Hex Maniac",
    "Name": "Carly",
    "Greeting": "I WILL SCATTER SOME POISON POWDER ABOUT",
    "Win": "IT'S SCARY HOW MY STRATEGY WORKS",
    "Loss": "I DISLIKE YOU AND YOUR POKEMON",
    "Sprite": "gen3/hex_maniac.png"
  },
  {
    "Class": "Hex Maniac",
    "Name": "Lexie",
    "Greeting": "WANT TO SEE SCARY POKEMON?",
    "Win": "WASN'T THAT SCARY EH?",
    "Loss": "YOU'RE MORE SCARY THAN MY POKEMON",
    "Sprite": "gen3/hex_maniac.png"
  },
  {
    "Class": "Pokemaniac",
    "Name": "Miller",
    "Greeting": "HELLO? HELLO?!",
    "Win": "HELLO MOTHER! I WON!",
    "Loss": "MY PHONE ISN'T WORKING...",
    "Sprite": "gen3/pokemaniac.png"
  },
  {
    "Class": "Pokemaniac",
    "Name": "Marv",
    "Greeting": "YOU CAN LOSE YOUR SWAGGER NOW",
    "Win": "THERE IS NO SWAGGER LEFT EH?",
    "Loss": "GO ON SWAGGER ALL YOU WANT",
    "Sprite": "gen3/pokemaniac.png"
  },
  {
    "Class": "Pokemaniac",
    "Name": "Layton",
    "Greeting": "I KNOW I AM TOTALLY COOL!",
    "Win": "YOU CAN LOOK UP TO ME",
    "Loss": "YOU'RE COOL! NO REALLY!",
    "Sprite": "gen3/pokemaniac.png"
  },
  {
    "Class": "Gentleman",
    "Name": "Brooks",
    "Greeting": "THIS IS A HIGH LEVEL BATTLE",
    "Win": "THAT WAS HIGH LEVEL AND EXCITING TOO",
    "Loss": "YOU'RE TOO HIGH IN LEVEL...",
    "Sprite": "gen3/gentleman.png"
  },
  {
    "Class": "Gentleman",
    "Name": "Gregory",
    "Greeting": "I AM NOT THAT OLD YET",
    "Win": "WHO SAYS I AM TOO OLD?",
    "Loss": "PLEASE I AM REALLY NOT THAT OLD",
    "Sprite": "gen3/gentleman.png"
  },
  {
    "Class": "Gentleman",
    "Name": "Reese",
    "Greeting": "I'VE A COUPLE THINGS",
    "Win": "DON'T DIET PLAY SPORTS INSTEAD",
    "Loss": "INSTEAD OF TELEVISION GET A BOOK",
    "Sprite": "gen3/gentleman.png"
  },
  {
    "Class": "Running Triathlete",
    "Name": "Mason",
    "Greeting": "PLEASE DON'T MAKE THIS SCARY",
    "Win": "THANK YOU... I AM HAPPY NOW",
    "Loss": "I AM DISAPPOINTED...",
    "Sprite": "gen3/running_triathlete_m.png"
  },
  {
    "Class": "Running Triathlete",
    "Name": "Toby",
    "Greeting": "LISTEN UP I ALWAYS WIN",
    "Win": "I AM A GENIUS OR WHAT?",
    "Loss": "I CAN BEAT YOU AT SMARTNESS",
    "Sprite": "gen3/running_triathlete_m.png"
  },
  {
    "Class": "Running Triathlete",
    "Name": "Dorothy",
    "Greeting": "THE SPORTS WORLD SHOULD ACCEPT POKEMON",
    "Win": "THANK YOU! THAT WIN WAS REFRESHING",
    "Loss": "THANK YOU! THAT LOSS WAS REFRESHING",
    "Sprite": "gen3/running_triathlete_f.png"
  },
  {
    "Class": "Running Triathlete",
    "Name": "Piper",
    "Greeting": "COME ON YOU NEED A SPEED BOOST?",
    "Win": "YOU NEED TO SHOW MORE GUTS",
    "Loss": "OH YOU!",
    "Sprite": "gen3/running_triathlete_f.png"
  },
  {
    "Class": "Swimming Triathlete",
    "Name": "Finn",
    "Greeting": "NOT ANOTHER TRAINER BATTLE...",
    "Win": "WON'T THIS EVER END?",
    "Loss": "I FINALLY GET TO REST A LITTLE",
    "Sprite": "gen3/swimming_triathlete_m.png"
  },
  {
    "Class": "Swimming Triathlete",
    "Name": "Samir",
    "Greeting": "I DIVE BELOW THE SURF!",
    "Win": "YAHOO TAKE A DIVE YOU!",
    "Loss": "I AM GOING TO SINK...",
    "Sprite": "gen3/swimming_triathlete_m.png"
  },
  {
    "Class": "Swimming Triathlete",
    "Name": "Fiona",
    "Greeting": "DID YOU LIMBER UP BEFORE?",
    "Win": "YOU NEED TO BE MORE READY",
    "Loss": "BEING LIMBER DIDN'T WORK FOR ME",
    "Sprite": "gen3/swimming_triathlete_f.png"
  },
  {
    "Class": "Swimming Triathlete",
    "Name": "Gloria",
    "Greeting": "I LIKE TO ATTACK WITH SUCTION CUPS",
    "Win": "GIGGLE... IT'S OVER FOR YOU",
    "Loss": "I DON'T GET HOW SUCTION CUPS WORK",
    "Sprite": "gen3/swimming_triathlete_f.png"
  },
  {
    "Class": "Cycling Triathlete",
    "Name": "Nico",
    "Greeting": "LIKE A SONIC BOOM I VE ARRIVED",
    "Win": "SORRY TO MAKE YOU SO DOWNCAST",
    "Loss": "I AM GOING WITH A SUPERSONIC SPEED BOOST",
    "Sprite": "gen3/cycling_triathlete_m.png"
  },
  {
    "Class": "Cycling Triathlete",
    "Name": "Jeremy",
    "Greeting": "A POKEMON MASTER THAT'S MY DREAM",
    "Win": "MY DREAM ISN'T FAR OFF!",
    "Loss": "WHAT I DREAM ISN'T HAPPENING...",
    "Sprite": "gen3/cycling_triathlete_m.png"
  },
  {
    "Class": "Cycling Triathlete",
    "Name": "Caitlin",
    "Greeting": "DON'T YOU THINK I AM CUTE?",
    "Win": "THERE IS MORE TO ME THAN CUTENESS",
    "Loss": "MY CUTE CHARM DOESN'T ATTRACT YOU?",
    "Sprite": "gen3/cycling_triathlete_f.png"
  },
  {
    "Class": "Cycling Triathlete",
    "Name": "Reena",
    "Greeting": "I AM ALWAYS HAPPY HAPPY HAPPY!",
    "Win": "OH YAY! YAHOO FOR ME",
    "Loss": "YAHOO! I AM HAPPY FOR YOU",
    "Sprite": "gen3/cycling_triathlete_f.png"
  },
  {
    "Class": "Bug Maniac",
    "Name": "Avery",
    "Greeting": "I'VE GOT A LOT OF BUG POKEMON",
    "Win": "MY BUG POKEMON ARE ALL UNBELIEVABLE",
    "Loss": "MY BUG POKEMON ARE ALL UPSIDE DOWN",
    "Sprite": "gen3/bug_maniac.png"
  },
  {
    "Class": "Bug Maniac",
    "Name": "Liam",
    "Greeting": "WE REALLY DISLIKE FIRE AND FLYING",
    "Win": "BUG POKEMON AREN'T BAD HEY?",
    "Loss": "YOU KNOW WHAT WE DISLIKE HEY?",
    "Sprite": "gen3/bug_maniac.png"
  },
  {
    "Class": "Fisherman",
    "Name": "Theo",
    "Greeting": "FISHING IS MY CHOICE IN LIFE",
    "Win": "WATER POKEMON ATTRACT ME WITHOUT END",
    "Loss": "DON'T COUNT ON THAT HAPPENING ANOTHER TIME",
    "Sprite": "gen3/fisherman.png"
  },
  {
    "Class": "Fisherman",
    "Name": "Bailey",
    "Greeting": "I AM AN ADULT I BATTLE EASY",
    "Win": "I AM AN ADULT I SWALLOW JOY",
    "Loss": "I AM AN ADULT I SWALLOW FRUSTRATION",
    "Sprite": "gen3/fisherman.png"
  },
  {
    "Class": "Ruin Maniac",
    "Name": "Hugo",
    "Greeting": "I TRY THE BEST I CAN",
    "Win": "I CAN WIN IF I TRY ENOUGH",
    "Loss": "I DID TRY DIDN'T I?",
    "Sprite": "gen3/ruin_maniac.png"
  },
  {
    "Class": "Ruin Maniac",
    "Name": "Bryce",
    "Greeting": "I WAS ON VACATION UNTIL ONLY YESTERDAY",
    "Win": "I HAVEN'T LOST MY SKILL YET",
    "Loss": "THAT'S IT... I NEED SLEEP",
    "Sprite": "gen3/ruin_maniac.png"
  },
  {
    "Class": "Collector",
    "Name": "Gideon",
    "Greeting": "WHAT'S UP? YOU THINK I AM SCARY?",
    "Win": "I AM COOL BUT NOT SCARY!",
    "Loss": "LOOK AT MY FABULOUS FASHION SENSE",
    "Sprite": "gen3/collector.png"
  },
  {
    "Class": "Collector",
    "Name": "Triston",
    "Greeting": "I WOULD RATHER LOOK AT POKEMON",
    "Win": "HUH? YOU MEAN I WON?!",
    "Loss": "SEE? I ALWAYS LOSE",
    "Sprite": "gen3/collector.png"
  },
  {
    "Class": "Guitarist",
    "Name": "Charles",
    "Greeting": "IT'S HOPELESS TO STRUGGLE WITH ME",
    "Win": "SUBMISSION WAS YOUR ONLY CHOICE",
    "Loss": "I AM GOING DOWN DOWN DOWN!",
    "Sprite": "gen3/guitarist.png"
  },
  {
    "Class": "Guitarist",
    "Name": "Raymond",
    "Greeting": "WANT TO HEAR MY SONG?",
    "Win": "SATISFIED THAT'S WHAT I AM!",
    "Loss": "SATISFIED IS WHAT I CAN'T BE",
    "Sprite": "gen3/guitarist.png"
  },
  {
    "Class": "Bird Keeper",
    "Name": "Dirk",
    "Greeting": "FLYING POKEMON ARE ABOVE THE REST",
    "Win": "YOU CAN'T WIN! FLYING POKEMON RULE",
    "Loss": "AREN'T THERE MORE FLYING POKEMON?",
    "Sprite": "gen3/bird_keeper.png"
  },
  {
    "Class": "Bird Keeper",
    "Name": "Harold",
    "Greeting": "MY POKEMON APPEAL TO YOU?",
    "Win": "YOU DO LIKE MY POKEMON?",
    "Loss": "SO YOU DISLIKE MY POKEMON?",
    "Sprite": "gen3/bird_keeper.png"
  },
  {
    "Class": "Sailor",
    "Name": "Omar",
    "Greeting": "LET ME WIN IN RETURN FOR A PRESENT",
    "Win": "HERE YOU ARE SOME TOXIC SWEETS",
    "Loss": "YOUR PRESENT? WHAT FOR?!",
    "Sprite": "gen3/sailor.png"
  },
  {
    "Class": "Sailor",
    "Name": "Peter",
    "Greeting": "I BRAG ABOUT MY HAPPINESS OK?",
    "Win": "YOU HAVE TO LISTEN TO ME BRAG",
    "Loss": "I AM DISAPPOINTED YOU WON'T LISTEN TO ME",
    "Sprite": "gen3/sailor.png"
  },
  {
    "Class": "Hiker",
    "Name": "Dev",
    "Greeting": "COME ON LET'S GET A MOVE ON",
    "Win": "I GET TO NAP AFTER THAT",
    "Loss": "I NEED TO NAP AFTER THAT",
    "Sprite": "gen3/hiker.png"
  },
  {
    "Class": "Hiker",
    "Name": "Corey",
    "Greeting": "LET'S TEACH YOU HOW TOUGH I AM",
    "Win": "LOOK AT ME MAKE A BRICK BREAK",
    "Loss": "MY FRUSTRATION IS CLOSE TO ERUPTION",
    "Sprite": "gen3/hiker.png"
  },
  {
    "Class": "Kindler",
    "Name": "Andre",
    "Greeting": "NOW THIS IS A PERFECT FLAME BODY",
    "Win": "LOOK AT MY FIERY DANCE!",
    "Loss": "YOU WANT AN EXPLOSION HERE?",
    "Sprite": "gen3/kindler.png"
  },
  {
    "Class": "Kindler",
    "Name": "Ferris",
    "Greeting": "I AM NO  IN THE OLD CLASS",
    "Win": "NO  THAT'S WHAT I AM!",
    "Loss": "I AM NOT NO  ANY MORE...",
    "Sprite": "gen3/kindler.png"
  },
  {
    "Class": "Parasol Lady",
    "Name": "Alivia",
    "Greeting": "I AM FEELING GIDDY SO SHOULD YOU",
    "Win": "IT WAS ALL TOGETHER TOO EASY",
    "Loss": "I WILL GIDDY UP AND AWAY",
    "Sprite": "gen3/parasol_lady.png"
  },
  {
    "Class": "Parasol Lady",
    "Name": "Paige",
    "Greeting": "LET'S ENJOY OUR BATTLE TOGETHER",
    "Win": "THAT'S IT! THANK YOU VERY MUCH",
    "Loss": "THAT'S IT! DO GO ON",
    "Sprite": "gen3/parasol_lady.png"
  },
  {
    "Class": "Beauty",
    "Name": "Anya",
    "Greeting": "I DISLIKE OH SO PRETTY FASHION",
    "Win": "FASHION SHOULD MATCH THE PERSON",
    "Loss": "PRETTY COULD BE GOOD",
    "Sprite": "gen3/beauty.png"
  },
  {
    "Class": "Beauty",
    "Name": "Dawn",
    "Greeting": "I GO ALL OUT!",
    "Win": "DON'T BE A BABY!",
    "Loss": "YOU WON! MOVE ON!",
    "Sprite": "gen3/beauty.png"
  },
  {
    "Class": "Aroma Lady",
    "Name": "Abby",
    "Greeting": "I LIKE A TRAINER THAT'S REFRESHING",
    "Win": "VICTORY HAS A SWEET SCENT!",
    "Loss": "WHAT AN AWFUL STENCH!",
    "Sprite": "gen3/aroma_lady.png"
  },
  {
    "Class": "Aroma Lady",
    "Name": "Gretel",
    "Greeting": "I CAUSE OUTRAGE AS A TRAINER",
    "Win": "IT'S ONLY NATURAL SEE YA BYE BYE!",
    "Loss": "IT'S HARD TO BELIEVE BUT CONGRATS",
    "Sprite": "gen3/aroma_lady.png"
  }
]